[Killed] BlockStatement
main/components/Citations/CitationTable.jsx:29:49
 const DUP_FLAG_COLOR = "#dc3545";
 const LINK_FLAG_COLOR = "#ffff00";
 
-function FlagBadge({ color, testId, children }) {
-  return (
-    <Badge
-      pill
-      bg={null}
-      style={{ backgroundColor: color, color: getContrastTextColor(color) }}
-      className="me-1"
-      data-testid={testId}
-    >
-      {children}
-    </Badge>
-  );
-}
+function FlagBadge({ color, testId, children }) {}
 
 export default function CitationTable({
killedBy: CitationTable tests the Flags column shows a red dup? pill badge when possibleDuplicateIds is set
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-flags-dup-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ObjectLiteral
main/components/Citations/CitationTable.jsx:34:14
     <Badge
       pill
       bg={null}
-      style={{ backgroundColor: color, color: getContrastTextColor(color) }}
+      style={{}}
       className="me-1"
       data-testid={testId}
killedBy: CitationTable tests the Flags column shows a red dup? pill badge when possibleDuplicateIds is set
statusReason: expect(element).toHaveStyle()

- Expected

- background-color: rgb(220, 53, 69);

[Killed] BooleanLiteral
main/components/Citations/CitationTable.jsx:47:14
   citations,
   projectId,
   testId = "CitationTable",
-  readOnly = false,
+  readOnly = true,
   allTags = [],
   mutationQueryKeys = [`/api/bibtexentries/project?projectId=${projectId}`],
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: Unable to find an element by: [data-testid="CitationTable-header-edit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Survived] StringLiteral
main/components/Citations/CitationTable.jsx:49:24
   testId = "CitationTable",
   readOnly = false,
   allTags = [],
-  mutationQueryKeys = [`/api/bibtexentries/project?projectId=${projectId}`],
+  mutationQueryKeys = [``],
 }) {
   const [showEditModal, setShowEditModal] = useState(false);

[Timeout] BooleanLiteral
main/components/Citations/CitationTable.jsx:51:54
   allTags = [],
   mutationQueryKeys = [`/api/bibtexentries/project?projectId=${projectId}`],
 }) {
-  const [showEditModal, setShowEditModal] = useState(false);
+  const [showEditModal, setShowEditModal] = useState(true);
   const [selectedEntryForEdit, setSelectedEntryForEdit] = useState(null);
   const [showDeleteModal, setShowDeleteModal] = useState(false);

[Timeout] BooleanLiteral
main/components/Citations/CitationTable.jsx:53:58
 }) {
   const [showEditModal, setShowEditModal] = useState(false);
   const [selectedEntryForEdit, setSelectedEntryForEdit] = useState(null);
-  const [showDeleteModal, setShowDeleteModal] = useState(false);
+  const [showDeleteModal, setShowDeleteModal] = useState(true);
   const [entryToDelete, setEntryToDelete] = useState(null);
 

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:56:35
   const [showDeleteModal, setShowDeleteModal] = useState(false);
   const [entryToDelete, setEntryToDelete] = useState(null);
 
-  const cellToAxiosParamsDelete = (entry) => ({
-    url: "/api/bibtexentries/delete",
-    method: "DELETE",
-    params: {
-      id: entry.id,
-      projectId: projectId,
-    },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   const onDeleteSuccess = () => {
killedBy: CitationTable tests owner can delete a citation after confirming
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Citations/CitationTable.jsx:56:47
   const [showDeleteModal, setShowDeleteModal] = useState(false);
   const [entryToDelete, setEntryToDelete] = useState(null);
 
-  const cellToAxiosParamsDelete = (entry) => ({
-    url: "/api/bibtexentries/delete",
-    method: "DELETE",
-    params: {
-      id: entry.id,
-      projectId: projectId,
-    },
-  });
+  const cellToAxiosParamsDelete = (entry) => ({});
 
   const onDeleteSuccess = () => {
killedBy: CitationTable tests owner can delete a citation after confirming
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Citations/CitationTable.jsx:65:33
     },
   });
 
-  const onDeleteSuccess = () => {
-    toast("Citation deleted successfully");
-    setShowDeleteModal(false);
-    setEntryToDelete(null);
-  };
+  const onDeleteSuccess = () => {};
 
   const onDeleteError = (error) => {
killedBy: CitationTable tests owner can delete a citation after confirming
statusReason: expected "vi.fn()" to be called with arguments: [ 'Citation deleted successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:66:11
   });
 
   const onDeleteSuccess = () => {
-    toast("Citation deleted successfully");
+    toast("");
     setShowDeleteModal(false);
     setEntryToDelete(null);
killedBy: CitationTable tests owner can delete a citation after confirming
statusReason: expected "vi.fn()" to be called with arguments: [ 'Citation deleted successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Citation deleted successfully",

[Survived] BooleanLiteral
main/components/Citations/CitationTable.jsx:67:24
 
   const onDeleteSuccess = () => {
     toast("Citation deleted successfully");
-    setShowDeleteModal(false);
+    setShowDeleteModal(true);
     setEntryToDelete(null);
   };

[Killed] BlockStatement
main/components/Citations/CitationTable.jsx:71:36
     setEntryToDelete(null);
   };
 
-  const onDeleteError = (error) => {
-    // Stryker disable next-line OptionalChaining : defensive coding for error shape
-    if (error.response?.data?.message)
-      toast(`Could not delete citation:\n${error.response.data.message}`);
-    else toast(`Could not delete citation:\n${error.message}`);
-  };
+  const onDeleteError = (error) => {};
 
   const deleteMutation = useBackendMutation(
killedBy: CitationTable tests shows a toast with the backend message when delete fails
statusReason: expected "vi.fn()" to be called with arguments: [ 'Could not delete citation:\nboom' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Citations/CitationTable.jsx:84:42
     mutationQueryKeys,
   );
 
-  const handleShowEditModal = (entry) => {
-    setSelectedEntryForEdit(entry);
-    setShowEditModal(true);
-  };
+  const handleShowEditModal = (entry) => {};
 
   const columns = [
killedBy: CitationTable tests clicking Edit opens the modal pre-filled from the export endpoint
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] BooleanLiteral
main/components/Citations/CitationTable.jsx:86:22
 
   const handleShowEditModal = (entry) => {
     setSelectedEntryForEdit(entry);
-    setShowEditModal(true);
+    setShowEditModal(false);
   };
 
killedBy: CitationTable tests clicking Edit opens the modal pre-filled from the export endpoint
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ObjectLiteral
main/components/Citations/CitationTable.jsx:90:5
   };
 
   const columns = [
-    {
-      header: "Cite Key",
-      id: "citeKey",
-      accessorFn: (row) => row.citeKey ?? "",
-      cell: ({ cell }) => (
-        <Link
-          to={`/project/${projectId}/bibtex/${cell.row.original.id}`}
-          data-testid={`${testId}-cell-row-${cell.row.index}-col-citeKey-link`}
-        >
-          {truncate(cell.row.original.citeKey, CITEKEY_MAX_LENGTH)}
-        </Link>
-      ),
-    },
+    {},
     {
       // Sortable by priority (High down to Unreviewed), not alphabetically — see
killedBy: CitationTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:93:19
     {
       header: "Cite Key",
       id: "citeKey",
-      accessorFn: (row) => row.citeKey ?? "",
+      accessorFn: () => undefined,
       cell: ({ cell }) => (
         <Link
killedBy: CitationTable tests clicking the Cite Key column header sorts rows lexicographically by the full citeKey
statusReason: expected [ 'smith202...', 'jones201...', …(1) ] to deeply equal [ 'jones201...', 'lee2021', …(1) ]

[Killed] LogicalOperator
main/components/Citations/CitationTable.jsx:93:28
     {
       header: "Cite Key",
       id: "citeKey",
-      accessorFn: (row) => row.citeKey ?? "",
+      accessorFn: (row) => row.citeKey && "",
       cell: ({ cell }) => (
         <Link
killedBy: CitationTable tests clicking the Cite Key column header sorts rows lexicographically by the full citeKey
statusReason: expected [ 'smith202...', 'jones201...', …(1) ] to deeply equal [ 'jones201...', 'lee2021', …(1) ]

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:94:13
       header: "Cite Key",
       id: "citeKey",
       accessorFn: (row) => row.citeKey ?? "",
-      cell: ({ cell }) => (
-        <Link
-          to={`/project/${projectId}/bibtex/${cell.row.original.id}`}
-          data-testid={`${testId}-cell-row-${cell.row.index}-col-citeKey-link`}
-        >
-          {truncate(cell.row.original.citeKey, CITEKEY_MAX_LENGTH)}
-        </Link>
-      ),
+      cell: () => undefined,
     },
     {
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:97:24
       cell: ({ cell }) => (
         <Link
           to={`/project/${projectId}/bibtex/${cell.row.original.id}`}
-          data-testid={`${testId}-cell-row-${cell.row.index}-col-citeKey-link`}
+          data-testid={``}
         >
           {truncate(cell.row.original.citeKey, CITEKEY_MAX_LENGTH)}
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ObjectLiteral
main/components/Citations/CitationTable.jsx:103:5
         </Link>
       ),
     },
-    {
-      // Sortable by priority (High down to Unreviewed), not alphabetically — see
-      // main/utils/relevance.js. The colors are defined once, in index.css (issue #54).
-      header: "Relevance",
-      id: "relevance",
-      accessorFn: (row) => relevanceRank(getEntryRelevance(row)),
-      cell: ({ cell }) => {
-        const relevance = getEntryRelevance(cell.row.original);
-        return (
-          <span
-            className={`relevance-badge ${relevanceClassName(relevance)}`}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-relevance-badge`}
-          >
-            {relevanceLabel(relevance)}
-          </span>
-        );
-      },
-    },
+    {},
     {
       // Debug/iteration aid (issue #68): flags entries the "Detect Duplicates" job has marked as
killedBy: CitationTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:108:19
       // main/utils/relevance.js. The colors are defined once, in index.css (issue #54).
       header: "Relevance",
       id: "relevance",
-      accessorFn: (row) => relevanceRank(getEntryRelevance(row)),
+      accessorFn: () => undefined,
       cell: ({ cell }) => {
         const relevance = getEntryRelevance(cell.row.original);
killedBy: CitationTable tests clicking the Relevance column header sorts by priority, not alphabetically
statusReason: expected [ 'lee2021', 'jones201...', …(1) ] to deeply equal [ 'smith202...', 'jones201...', …(1) ]

[Killed] BlockStatement
main/components/Citations/CitationTable.jsx:109:27
       header: "Relevance",
       id: "relevance",
       accessorFn: (row) => relevanceRank(getEntryRelevance(row)),
-      cell: ({ cell }) => {
-        const relevance = getEntryRelevance(cell.row.original);
-        return (
-          <span
-            className={`relevance-badge ${relevanceClassName(relevance)}`}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-relevance-badge`}
-          >
-            {relevanceLabel(relevance)}
-          </span>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: CitationTable tests the Relevance column shows the level's label and color class, defaulting to (unreviewed)
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-relevance-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:114:26
         return (
           <span
             className={`relevance-badge ${relevanceClassName(relevance)}`}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-relevance-badge`}
+            data-testid={``}
           >
             {relevanceLabel(relevance)}
killedBy: CitationTable tests the Relevance column shows the level's label and color class, defaulting to (unreviewed)
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-relevance-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Timeout] StringLiteral
main/components/Citations/CitationTable.jsx:127:15
       // having a broken DOI/URL. Not yet a finished UX — see issue #75 for the eventual
       // duplicate-review workflow. Sortable (via accessorFn) so all flagged rows can be grouped
       // to the top/bottom of the table.
-      header: "Flags",
+      header: "",
       id: "flags",
       accessorFn: (row) =>

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:129:19
       // to the top/bottom of the table.
       header: "Flags",
       id: "flags",
-      accessorFn: (row) =>
-        [
-          hasPossibleDuplicateFlag(row) ? "dup?" : null,
-          hasInvalidLinkFlag(row) ? "link?" : null,
-        ]
-          .filter(Boolean)
-          .join(" "),
+      accessorFn: () => undefined,
       cell: ({ cell }) => {
         const entry = cell.row.original;
killedBy: CitationTable tests clicking the Flags column header sorts unflagged and flagged rows into distinct groups
statusReason: expected [ 'jones201...', 'smith202...' ] to deeply equal [ 'smith202...', 'jones201...' ]

[Survived] MethodExpression
main/components/Citations/CitationTable.jsx:130:9
       header: "Flags",
       id: "flags",
       accessorFn: (row) =>
-        [
-          hasPossibleDuplicateFlag(row) ? "dup?" : null,
-          hasInvalidLinkFlag(row) ? "link?" : null,
-        ]
-          .filter(Boolean)
+        [hasPossibleDuplicateFlag(row) ? "dup?" : null, hasInvalidLinkFlag(row) ? "link?" : null]
           .join(" "),
       cell: ({ cell }) => {

[Killed] BlockStatement
main/components/Citations/CitationTable.jsx:136:27
         ]
           .filter(Boolean)
           .join(" "),
-      cell: ({ cell }) => {
-        const entry = cell.row.original;
-        return (
-          <>
-            {hasPossibleDuplicateFlag(entry) && (
-              <FlagBadge
-                color={DUP_FLAG_COLOR}
-                testId={`${testId}-cell-row-${cell.row.index}-col-flags-dup-badge`}
-              >
-                dup?
-              </FlagBadge>
-            )}
-            {hasInvalidLinkFlag(entry) && (
-              <FlagBadge
-                color={LINK_FLAG_COLOR}
-                testId={`${testId}-cell-row-${cell.row.index}-col-flags-link-badge`}
-              >
-                link?
-              </FlagBadge>
-            )}
-          </>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: CitationTable tests the Flags column shows a red dup? pill badge when possibleDuplicateIds is set
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-flags-dup-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] LogicalOperator
main/components/Citations/CitationTable.jsx:140:14
         const entry = cell.row.original;
         return (
           <>
-            {hasPossibleDuplicateFlag(entry) && (
-              <FlagBadge
-                color={DUP_FLAG_COLOR}
-                testId={`${testId}-cell-row-${cell.row.index}-col-flags-dup-badge`}
-              >
-                dup?
-              </FlagBadge>
-            )}
+            {hasPossibleDuplicateFlag(entry) || <FlagBadge color={DUP_FLAG_COLOR} testId={`${testId}-cell-row-${cell.row.index}-col-flags-dup-badge`}>
+                dup?
+              </FlagBadge>}
             {hasInvalidLinkFlag(entry) && (
               <FlagBadge
killedBy: CitationTable tests the Flags column is empty for an entry with no flagged fields set
statusReason: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  dup?

[Killed] ConditionalExpression
main/components/Citations/CitationTable.jsx:140:14
         const entry = cell.row.original;
         return (
           <>
-            {hasPossibleDuplicateFlag(entry) && (
-              <FlagBadge
-                color={DUP_FLAG_COLOR}
-                testId={`${testId}-cell-row-${cell.row.index}-col-flags-dup-badge`}
-              >
-                dup?
-              </FlagBadge>
-            )}
+            {true}
             {hasInvalidLinkFlag(entry) && (
               <FlagBadge
killedBy: CitationTable tests the Flags column shows a red dup? pill badge when possibleDuplicateIds is set
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-flags-dup-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:143:25
             {hasPossibleDuplicateFlag(entry) && (
               <FlagBadge
                 color={DUP_FLAG_COLOR}
-                testId={`${testId}-cell-row-${cell.row.index}-col-flags-dup-badge`}
+                testId={``}
               >
                 dup?
killedBy: CitationTable tests the Flags column shows a red dup? pill badge when possibleDuplicateIds is set
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-flags-dup-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ConditionalExpression
main/components/Citations/CitationTable.jsx:148:14
                 dup?
               </FlagBadge>
             )}
-            {hasInvalidLinkFlag(entry) && (
-              <FlagBadge
-                color={LINK_FLAG_COLOR}
-                testId={`${testId}-cell-row-${cell.row.index}-col-flags-link-badge`}
-              >
-                link?
-              </FlagBadge>
-            )}
+            {false}
           </>
         );
killedBy: CitationTable tests the Flags column shows a bright yellow link? pill badge when CITELINES_invalid_doi is True
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-flags-link-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] LogicalOperator
main/components/Citations/CitationTable.jsx:148:14
                 dup?
               </FlagBadge>
             )}
-            {hasInvalidLinkFlag(entry) && (
-              <FlagBadge
-                color={LINK_FLAG_COLOR}
-                testId={`${testId}-cell-row-${cell.row.index}-col-flags-link-badge`}
-              >
-                link?
-              </FlagBadge>
-            )}
+            {hasInvalidLinkFlag(entry) || <FlagBadge color={LINK_FLAG_COLOR} testId={`${testId}-cell-row-${cell.row.index}-col-flags-link-badge`}>
+                link?
+              </FlagBadge>}
           </>
         );
killedBy: CitationTable tests the Flags column is empty for an entry with no flagged fields set
statusReason: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  link?

[Killed] ObjectLiteral
main/components/Citations/CitationTable.jsx:160:5
         );
       },
     },
-    {
-      header: "Tags",
-      id: "tags",
-      cell: ({ cell }) => {
-        const entry = cell.row.original;
-        const assignedTagIds = new Set(entry.tagIds ?? []);
-        const assignedTags = allTags.filter((tag) =>
-          assignedTagIds.has(tag.id),
-        );
-        return (
-          <>
-            {assignedTags.map((tag) => (
-              <TagPill
-                key={tag.id}
-                tag={tag}
-                testId={`${testId}-cell-row-${cell.row.index}-col-tags-${tag.id}-badge`}
-              />
-            ))}
-          </>
-        );
-      },
-    },
+    {},
     {
       header: "Link",
killedBy: CitationTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Citations/CitationTable.jsx:163:27
     {
       header: "Tags",
       id: "tags",
-      cell: ({ cell }) => {
-        const entry = cell.row.original;
-        const assignedTagIds = new Set(entry.tagIds ?? []);
-        const assignedTags = allTags.filter((tag) =>
-          assignedTagIds.has(tag.id),
-        );
-        return (
-          <>
-            {assignedTags.map((tag) => (
-              <TagPill
-                key={tag.id}
-                tag={tag}
-                testId={`${testId}-cell-row-${cell.row.index}-col-tags-${tag.id}-badge`}
-              />
-            ))}
-          </>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: CitationTable tests the Tags column shows a pill badge, in the assigned color, for each assigned tag
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-tags-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] LogicalOperator
main/components/Citations/CitationTable.jsx:165:40
       id: "tags",
       cell: ({ cell }) => {
         const entry = cell.row.original;
-        const assignedTagIds = new Set(entry.tagIds ?? []);
+        const assignedTagIds = new Set(entry.tagIds && []);
         const assignedTags = allTags.filter((tag) =>
           assignedTagIds.has(tag.id),
killedBy: CitationTable tests the Tags column shows a pill badge, in the assigned color, for each assigned tag
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-tags-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] MethodExpression
main/components/Citations/CitationTable.jsx:166:30
       cell: ({ cell }) => {
         const entry = cell.row.original;
         const assignedTagIds = new Set(entry.tagIds ?? []);
-        const assignedTags = allTags.filter((tag) =>
-          assignedTagIds.has(tag.id),
-        );
+        const assignedTags = allTags;
         return (
           <>
killedBy: CitationTable tests the Tags column is empty when the entry has no tagIds
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="me-1 badge rounded-pill"
  data-testid="CitationTable-cell-row-0-col-tags-1-badge"
  style="background-color: rgb(30, 136, 229); color: rgb(255, 255, 255);"
>
  methodology

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:166:45
       cell: ({ cell }) => {
         const entry = cell.row.original;
         const assignedTagIds = new Set(entry.tagIds ?? []);
-        const assignedTags = allTags.filter((tag) =>
-          assignedTagIds.has(tag.id),
+        const assignedTags = allTags.filter(() => undefined,
         );
         return (
killedBy: CitationTable tests the Tags column shows a pill badge, in the assigned color, for each assigned tag
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-tags-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:171:31
         );
         return (
           <>
-            {assignedTags.map((tag) => (
-              <TagPill
-                key={tag.id}
-                tag={tag}
-                testId={`${testId}-cell-row-${cell.row.index}-col-tags-${tag.id}-badge`}
-              />
-            ))}
+            {assignedTags.map(() => undefined)}
           </>
         );
killedBy: CitationTable tests the Tags column shows a pill badge, in the assigned color, for each assigned tag
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-tags-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:184:11
     },
     {
       header: "Link",
-      id: "link",
+      id: "",
       accessorFn: (row) =>
         row.keyValuePairs?.doi ? "doi" : row.keyValuePairs?.url ? "url" : "",
killedBy: CitationTable tests renders without crashing for empty table
statusReason: Columns require an id when using an accessorFn

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:185:19
     {
       header: "Link",
       id: "link",
-      accessorFn: (row) =>
-        row.keyValuePairs?.doi ? "doi" : row.keyValuePairs?.url ? "url" : "",
+      accessorFn: () => undefined,
       cell: ({ cell }) => {
         const doi = cell.row.original.keyValuePairs?.doi;
killedBy: CitationTable tests clicking the Link column header sorts rows by doi/url/blank
statusReason: expected [ 'smith202...', 'jones201...', …(1) ] to deeply equal [ 'smith202...', 'lee2021', …(1) ]

[Survived] OptionalChaining
main/components/Citations/CitationTable.jsx:186:42
       header: "Link",
       id: "link",
       accessorFn: (row) =>
-        row.keyValuePairs?.doi ? "doi" : row.keyValuePairs?.url ? "url" : "",
+        row.keyValuePairs?.doi ? "doi" : row.keyValuePairs.url ? "url" : "",
       cell: ({ cell }) => {
         const doi = cell.row.original.keyValuePairs?.doi;

[Survived] OptionalChaining
main/components/Citations/CitationTable.jsx:186:9
       header: "Link",
       id: "link",
       accessorFn: (row) =>
-        row.keyValuePairs?.doi ? "doi" : row.keyValuePairs?.url ? "url" : "",
+        row.keyValuePairs.doi ? "doi" : row.keyValuePairs?.url ? "url" : "",
       cell: ({ cell }) => {
         const doi = cell.row.original.keyValuePairs?.doi;

[Survived] OptionalChaining
main/components/Citations/CitationTable.jsx:188:21
       accessorFn: (row) =>
         row.keyValuePairs?.doi ? "doi" : row.keyValuePairs?.url ? "url" : "",
       cell: ({ cell }) => {
-        const doi = cell.row.original.keyValuePairs?.doi;
+        const doi = cell.row.original.keyValuePairs.doi;
         if (doi) {
           return (

[Killed] BlockStatement
main/components/Citations/CitationTable.jsx:189:18
         row.keyValuePairs?.doi ? "doi" : row.keyValuePairs?.url ? "url" : "",
       cell: ({ cell }) => {
         const doi = cell.row.original.keyValuePairs?.doi;
-        if (doi) {
-          return (
-            <a
-              href={`https://doi.org/${doi}`}
-              target="_blank"
-              rel="noopener noreferrer"
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-doi-link`}
-            >
-              doi
-            </a>
-          );
-        }
+        if (doi) {}
         const url = cell.row.original.keyValuePairs?.url;
         if (url) {
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-doi-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"
