[Killed] ArrayDeclaration
main/pages/Admin/AdminJobsPage.jsx:43:5
   };
 
   const { data: jobs } = useBackend(
-    ["/api/jobs/all"],
+    [],
     {
       //Stryker disable next-line StringLiteral: axios default is GET
killedBy: AdminJobsPage tests renders without crashing
statusReason: expected undefined to deeply equal []
