[Killed] BooleanLiteral
main/pages/Admin/AdminsCreatePage.tsx:15:15
 };
 
 export default function AdminsCreatePage({
-  storybook = false,
+  storybook = true,
 }: AdminsCreatePageProps): React.JSX.Element {
   const objectToAxiosParams = (
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admin/admins
statusReason: expected "vi.fn()" to be called with arguments: [ { to: '/admin/admins' } ]

Number of calls: 0

[Killed] ArrowFunction
main/pages/Admin/AdminsCreatePage.tsx:17:31
 export default function AdminsCreatePage({
   storybook = false,
 }: AdminsCreatePageProps): React.JSX.Element {
-  const objectToAxiosParams = (
-    admin: RoleEmailFormFields,
-  ): AxiosRequestConfig => ({
-    url: "/api/admin/post",
-    method: "POST",
-    params: {
-      email: admin.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (admin: RoleEmailFormFields) => {
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admin/admins
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/AdminsCreatePage.tsx:27:53
     },
   });
 
-  const onSuccess = (admin: RoleEmailFormFields) => {
-    toast(`New admin added - email: ${admin.email}`);
-  };
+  const onSuccess = (admin: RoleEmailFormFields) => {};
 
   const mutation = useBackendMutation(
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admin/admins
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/pages/Admin/AdminsCreatePage.tsx:39:57
 
   const { isSuccess } = mutation;
 
-  const onSubmit = async (data: RoleEmailFormFields) => {
-    mutation.mutate(data);
-  };
+  const onSubmit = async (data: RoleEmailFormFields) => {};
 
   if (isSuccess && !storybook) {
killedBy: AdminsCreatePage tests on submit, makes request to backend, and redirects to /admin/admins
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
