[Killed] ConditionalExpression
main/components/Citations/CitationTable.jsx:189:13
         row.keyValuePairs?.doi ? "doi" : row.keyValuePairs?.url ? "url" : "",
       cell: ({ cell }) => {
         const doi = cell.row.original.keyValuePairs?.doi;
-        if (doi) {
+        if (false) {
           return (
             <a
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-doi-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Survived] OptionalChaining
main/components/Citations/CitationTable.jsx:201:21
             </a>
           );
         }
-        const url = cell.row.original.keyValuePairs?.url;
+        const url = cell.row.original.keyValuePairs.url;
         if (url) {
           return (

[Killed] ConditionalExpression
main/components/Citations/CitationTable.jsx:202:13
           );
         }
         const url = cell.row.original.keyValuePairs?.url;
-        if (url) {
+        if (false) {
           return (
             <a
killedBy: CitationTable tests renders no doi link when the entry has no doi field but shows a url link when url is present
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-url-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ConditionalExpression
main/components/Citations/CitationTable.jsx:202:13
           );
         }
         const url = cell.row.original.keyValuePairs?.url;
-        if (url) {
+        if (true) {
           return (
             <a
killedBy: CitationTable tests renders no doi or url link when neither field is present
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  data-testid="CitationTable-cell-row-0-col-url-link"
  rel="noopener noreferrer"
  target="_blank"
>
  url

[Timeout] StringLiteral
main/components/Citations/CitationTable.jsx:218:15
       },
     },
     {
-      header: "Year",
+      header: "",
       id: "year",
       accessorFn: (row) => row.keyValuePairs?.year ?? "",

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:219:11
     },
     {
       header: "Year",
-      id: "year",
+      id: "",
       accessorFn: (row) => row.keyValuePairs?.year ?? "",
     },
killedBy: CitationTable tests renders without crashing for empty table
statusReason: Columns require an id when using an accessorFn

[Killed] LogicalOperator
main/components/Citations/CitationTable.jsx:220:28
     {
       header: "Year",
       id: "year",
-      accessorFn: (row) => row.keyValuePairs?.year ?? "",
+      accessorFn: (row) => row.keyValuePairs?.year && "",
     },
     {
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2020
Received:

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:220:19
     {
       header: "Year",
       id: "year",
-      accessorFn: (row) => row.keyValuePairs?.year ?? "",
+      accessorFn: () => undefined,
     },
     {
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2020
Received:

[Timeout] StringLiteral
main/components/Citations/CitationTable.jsx:223:15
       accessorFn: (row) => row.keyValuePairs?.year ?? "",
     },
     {
-      header: "Author",
+      header: "",
       id: "author",
       accessorFn: (row) =>

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:224:11
     },
     {
       header: "Author",
-      id: "author",
+      id: "",
       accessorFn: (row) =>
         truncate(row.keyValuePairs?.author, AUTHOR_MAX_LENGTH),
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:225:19
     {
       header: "Author",
       id: "author",
-      accessorFn: (row) =>
-        truncate(row.keyValuePairs?.author, AUTHOR_MAX_LENGTH),
+      accessorFn: () => undefined,
     },
     {
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Jane Q. Smith a...
Received:

[Survived] OptionalChaining
main/components/Citations/CitationTable.jsx:226:18
       header: "Author",
       id: "author",
       accessorFn: (row) =>
-        truncate(row.keyValuePairs?.author, AUTHOR_MAX_LENGTH),
+        truncate(row.keyValuePairs.author, AUTHOR_MAX_LENGTH),
     },
     {

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:231:19
     {
       header: "Title",
       id: "title",
-      accessorFn: (row) => truncate(row.keyValuePairs?.title, TITLE_MAX_LENGTH),
+      accessorFn: () => undefined,
     },
   ];
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  A Very Long Title Th...
Received:

[Survived] OptionalChaining
main/components/Citations/CitationTable.jsx:231:37
     {
       header: "Title",
       id: "title",
-      accessorFn: (row) => truncate(row.keyValuePairs?.title, TITLE_MAX_LENGTH),
+      accessorFn: (row) => truncate(row.keyValuePairs.title, TITLE_MAX_LENGTH),
     },
   ];

[Killed] ConditionalExpression
main/components/Citations/CitationTable.jsx:235:7
     },
   ];
 
-  if (!readOnly) {
+  if (true) {
     columns.push(
       {
killedBy: CitationTable tests readOnly mode hides the Edit/Delete columns and buttons
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th
  colspan="1"
  data-testid="CitationTable-header-edit"
>
  <div
    data-testid="CitationTable-header-edit-sort-header"

[Killed] BooleanLiteral
main/components/Citations/CitationTable.jsx:235:7
     },
   ];
 
-  if (!readOnly) {
+  if (readOnly) {
     columns.push(
       {
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: Unable to find an element by: [data-testid="CitationTable-header-edit"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:240:15
       {
         header: "Edit",
         id: "edit",
-        cell: ({ cell }) => (
-          <Button
-            variant="outline-primary"
-            size="sm"
-            onClick={() => handleShowEditModal(cell.row.original)}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-button`}
-          >
-            Edit
-          </Button>
-        ),
+        cell: () => undefined,
       },
       {
killedBy: CitationTable tests clicking Edit opens the modal pre-filled from the export endpoint
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:244:22
           <Button
             variant="outline-primary"
             size="sm"
-            onClick={() => handleShowEditModal(cell.row.original)}
+            onClick={() => undefined}
             data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-button`}
           >
killedBy: CitationTable tests clicking Edit opens the modal pre-filled from the export endpoint
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:245:26
             variant="outline-primary"
             size="sm"
             onClick={() => handleShowEditModal(cell.row.original)}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-button`}
+            data-testid={``}
           >
             Edit
killedBy: CitationTable tests clicking Edit opens the modal pre-filled from the export endpoint
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ObjectLiteral
main/components/Citations/CitationTable.jsx:251:7
           </Button>
         ),
       },
-      {
-        header: "Delete",
-        id: "delete",
-        cell: ({ cell }) => (
-          <Button
-            variant="danger"
-            size="sm"
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
-            onClick={() => {
-              setEntryToDelete(cell.row.original);
-              setShowDeleteModal(true);
-            }}
-          >
-            Delete
-          </Button>
-        ),
-      },
+      {},
     );
   }
killedBy: CitationTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:254:15
       {
         header: "Delete",
         id: "delete",
-        cell: ({ cell }) => (
-          <Button
-            variant="danger"
-            size="sm"
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
-            onClick={() => {
-              setEntryToDelete(cell.row.original);
-              setShowDeleteModal(true);
-            }}
-          >
-            Delete
-          </Button>
-        ),
+        cell: () => undefined,
       },
     );
killedBy: CitationTable tests owner can delete a citation after confirming
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:258:26
           <Button
             variant="danger"
             size="sm"
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
+            data-testid={``}
             onClick={() => {
               setEntryToDelete(cell.row.original);
killedBy: CitationTable tests owner can delete a citation after confirming
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BlockStatement
main/components/Citations/CitationTable.jsx:259:28
             variant="danger"
             size="sm"
             data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
-            onClick={() => {
-              setEntryToDelete(cell.row.original);
-              setShowDeleteModal(true);
-            }}
+            onClick={() => {}}
           >
             Delete
killedBy: CitationTable tests owner can delete a citation after confirming
statusReason: Unable to find an element with the text: /Please confirm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] BooleanLiteral
main/components/Citations/CitationTable.jsx:261:34
             data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
             onClick={() => {
               setEntryToDelete(cell.row.original);
-              setShowDeleteModal(true);
+              setShowDeleteModal(false);
             }}
           >
killedBy: CitationTable tests owner can delete a citation after confirming
statusReason: Unable to find an element with the text: /Please confirm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] BooleanLiteral
main/components/Citations/CitationTable.jsx:273:8
 
   return (
     <>
-      {!readOnly && (
+      {readOnly && (
         <>
           <BibTexEntryModal
killedBy: CitationTable tests clicking Edit opens the modal pre-filled from the export endpoint
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ConditionalExpression
main/components/Citations/CitationTable.jsx:294:16
             </Modal.Header>
 
             <Modal.Body>
-              {entryToDelete && (
-                <p>
-                  Please confirm that you really want to delete the citation{" "}
-                  <strong>{entryToDelete.citeKey}</strong>. This action cannot
-                  be undone.
-                </p>
-              )}
+              {true}
             </Modal.Body>
 
killedBy: CitationTable tests owner can delete a citation after confirming
statusReason: Unable to find an element with the text: /Please confirm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] LogicalOperator
main/components/Citations/CitationTable.jsx:294:16
             </Modal.Header>
 
             <Modal.Body>
-              {entryToDelete && (
-                <p>
-                  Please confirm that you really want to delete the citation{" "}
-                  <strong>{entryToDelete.citeKey}</strong>. This action cannot
-                  be undone.
-                </p>
-              )}
+              {entryToDelete || <p>
+                  Please confirm that you really want to delete the citation{" "}
+                  <strong>{entryToDelete.citeKey}</strong>. This action cannot
+                  be undone.
+                </p>}
             </Modal.Body>
 
killedBy: CitationTable tests renders without crashing for empty table
statusReason: Cannot read properties of null (reading 'citeKey')

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:306:26
             <Modal.Footer>
               <Button
                 variant="secondary"
-                onClick={() => setShowDeleteModal(false)}
+                onClick={() => undefined}
               >
                 Do not delete
killedBy: CitationTable tests Do not delete button hides the modal without deleting
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Please confirm that you really want to delete the citation
   
  <strong>
    smith2020
  </strong>

[Killed] BooleanLiteral
main/components/Citations/CitationTable.jsx:306:51
             <Modal.Footer>
               <Button
                 variant="secondary"
-                onClick={() => setShowDeleteModal(false)}
+                onClick={() => setShowDeleteModal(true)}
               >
                 Do not delete
killedBy: CitationTable tests Do not delete button hides the modal without deleting
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <p>
  Please confirm that you really want to delete the citation
   
  <strong>
    smith2020
  </strong>

[Killed] ArrowFunction
main/components/Citations/CitationTable.jsx:314:26
               <Button
                 variant="danger"
                 data-testid={`${testId}-delete-modal-confirm-button`}
-                onClick={() => deleteMutation.mutate(entryToDelete)}
+                onClick={() => undefined}
               >
                 Yes, Delete
killedBy: CitationTable tests owner can delete a citation after confirming
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""
