[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:42:3
 const UNRESOLVED_COUNT_TOOLTIP =
   `Whenever "Get References"/"Get Citations" learns a related paper exists ` +
   `but can't fully identify it, that gap is recorded rather than silently ` +
-  `dropped, so this count doesn't quietly hide references we know about but ` +
+  `` +
   `couldn't add. This can happen when: a resolver names a related work but ` +
   `it doesn't actually resolve to anything when fetched; a related work ` +

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:43:3
   `Whenever "Get References"/"Get Citations" learns a related paper exists ` +
   `but can't fully identify it, that gap is recorded rather than silently ` +
   `dropped, so this count doesn't quietly hide references we know about but ` +
-  `couldn't add. This can happen when: a resolver names a related work but ` +
+  `` +
   `it doesn't actually resolve to anything when fetched; a related work ` +
   `resolves but no title could be found for it from any provider; or a ` +

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:46:3
   `couldn't add. This can happen when: a resolver names a related work but ` +
   `it doesn't actually resolve to anything when fetched; a related work ` +
   `resolves but no title could be found for it from any provider; or a ` +
-  `related work was added successfully but has no DOI, so it can't itself ` +
+  `` +
   `be used to keep expanding the citation graph further.`;
 

[Killed] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:54:19
 // unprefixed)
 // preserved CITELINES_ field name used to persist each card's state onto the entry itself, e.g.
 // "card_bibtex" <-> CITELINES_card_bibtex = {Open|Closed}.
-const CARD_DEFS = [
-  { key: "abstract", field: "card_abstract", defaultOpen: false },
-  { key: "bibtex", field: "card_bibtex", defaultOpen: true },
-  { key: "comments", field: "card_comments", defaultOpen: false },
-  { key: "references", field: "card_references", defaultOpen: false },
-  { key: "citations", field: "card_citations", defaultOpen: false },
-];
+const CARD_DEFS = [];
 
 /** A card whose body can be independently expanded/collapsed, unlike react-bootstrap's Accordion
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  null

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:55:59
 // preserved CITELINES_ field name used to persist each card's state onto the entry itself, e.g.
 // "card_bibtex" <-> CITELINES_card_bibtex = {Open|Closed}.
 const CARD_DEFS = [
-  { key: "abstract", field: "card_abstract", defaultOpen: false },
+  { key: "abstract", field: "card_abstract", defaultOpen: true },
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:55:29
 // preserved CITELINES_ field name used to persist each card's state onto the entry itself, e.g.
 // "card_bibtex" <-> CITELINES_card_bibtex = {Open|Closed}.
 const CARD_DEFS = [
-  { key: "abstract", field: "card_abstract", defaultOpen: false },
+  { key: "abstract", field: "", defaultOpen: false },
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:56:55
 // "card_bibtex" <-> CITELINES_card_bibtex = {Open|Closed}.
 const CARD_DEFS = [
   { key: "abstract", field: "card_abstract", defaultOpen: false },
-  { key: "bibtex", field: "card_bibtex", defaultOpen: true },
+  { key: "bibtex", field: "card_bibtex", defaultOpen: false },
   { key: "comments", field: "card_comments", defaultOpen: false },
   { key: "references", field: "card_references", defaultOpen: false },
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:56:10
 // "card_bibtex" <-> CITELINES_card_bibtex = {Open|Closed}.
 const CARD_DEFS = [
   { key: "abstract", field: "card_abstract", defaultOpen: false },
-  { key: "bibtex", field: "card_bibtex", defaultOpen: true },
+  { key: "", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },
   { key: "references", field: "card_references", defaultOpen: false },
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  null

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:57:59
 const CARD_DEFS = [
   { key: "abstract", field: "card_abstract", defaultOpen: false },
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
-  { key: "comments", field: "card_comments", defaultOpen: false },
+  { key: "comments", field: "card_comments", defaultOpen: true },
   { key: "references", field: "card_references", defaultOpen: false },
   { key: "citations", field: "card_citations", defaultOpen: false },
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:58:63
   { key: "abstract", field: "card_abstract", defaultOpen: false },
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },
-  { key: "references", field: "card_references", defaultOpen: false },
+  { key: "references", field: "card_references", defaultOpen: true },
   { key: "citations", field: "card_citations", defaultOpen: false },
 ];
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:58:3
   { key: "abstract", field: "card_abstract", defaultOpen: false },
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },
-  { key: "references", field: "card_references", defaultOpen: false },
+  {},
   { key: "citations", field: "card_citations", defaultOpen: false },
 ];
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  null

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:59:61
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },
   { key: "references", field: "card_references", defaultOpen: false },
-  { key: "citations", field: "card_citations", defaultOpen: false },
+  { key: "citations", field: "card_citations", defaultOpen: true },
 ];
 
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:82:16
         aria-expanded={isOpen}
         data-testid={`${testId}-header`}
         className="d-flex justify-content-between align-items-center"
-        style={{ cursor: "pointer", ...headerStyle }}
+        style={{}}
       >
         <div className="flex-grow-1">{header}</div>
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: expect(element).toHaveStyle()

- Expected

- background-color: rgb(248, 215, 218);

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:82:26
         aria-expanded={isOpen}
         data-testid={`${testId}-header`}
         className="d-flex justify-content-between align-items-center"
-        style={{ cursor: "pointer", ...headerStyle }}
+        style={{ cursor: "", ...headerStyle }}
       >
         <div className="flex-grow-1">{header}</div>

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:85:10
         style={{ cursor: "pointer", ...headerStyle }}
       >
         <div className="flex-grow-1">{header}</div>
-        {headerActions && (
-          <div className="me-2" onClick={(e) => e.stopPropagation()}>
-            {headerActions}
-          </div>
-        )}
+        {true}
         <span data-testid={`${testId}-toggle-icon`}>{isOpen ? "▲" : "▼"}</span>
       </Card.Header>
killedBy: BibTexEntryShowPage tests shows an Edit button in the BibTex Entry card header formatted like the CitationTable's Edit button
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-edit-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:85:10
         style={{ cursor: "pointer", ...headerStyle }}
       >
         <div className="flex-grow-1">{header}</div>
-        {headerActions && (
-          <div className="me-2" onClick={(e) => e.stopPropagation()}>
-            {headerActions}
-          </div>
-        )}
+        {false}
         <span data-testid={`${testId}-toggle-icon`}>{isOpen ? "▲" : "▼"}</span>
       </Card.Header>
killedBy: BibTexEntryShowPage tests shows an Edit button in the BibTex Entry card header formatted like the CitationTable's Edit button
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-edit-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Survived] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:86:42
       >
         <div className="flex-grow-1">{header}</div>
         {headerActions && (
-          <div className="me-2" onClick={(e) => e.stopPropagation()}>
+          <div className="me-2" onClick={() => undefined}>
             {headerActions}
           </div>

[Killed] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:103:72
 
 /** The formatted-citation link for a single entry named as a possible duplicate — its own
  * component (rather than an inline map) since each one needs its own useBackend call. */
-function PossibleDuplicateCitation({ projectId, duplicateId, testId }) {
-  const queryKey = `/api/bibtexentries/formatted?projectId=${projectId}&id=${duplicateId}`;
-  const { data: formattedCitation } = useBackend(
-    [queryKey],
-    {
-      method: "GET",
-      url: "/api/bibtexentries/formatted",
-      params: { projectId, id: duplicateId },
-    },
-    "",
-    true,
-  );
-
-  return (
-    <Link
-      to={`/project/${projectId}/bibtex/${duplicateId}`}
-      data-testid={testId}
-    >
-      {formattedCitation || "Loading..."}
-    </Link>
-  );
-}
+function PossibleDuplicateCitation({ projectId, duplicateId, testId }) {}
 
 export default function BibTexEntryShowPage({
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-PossibleDuplicatesCard-citation-64f1b2c3d4e5f6a7b8c9d0e9"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:104:20
 /** The formatted-citation link for a single entry named as a possible duplicate — its own
  * component (rather than an inline map) since each one needs its own useBackend call. */
 function PossibleDuplicateCitation({ projectId, duplicateId, testId }) {
-  const queryKey = `/api/bibtexentries/formatted?projectId=${projectId}&id=${duplicateId}`;
+  const queryKey = ``;
   const { data: formattedCitation } = useBackend(
     [queryKey],
killedBy: BibTexEntryShowPage tests lists multiple possible duplicates, one after another
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Second Duplicate Citation.
Received:
  First Duplicate Citation.

[Killed] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:106:5
 function PossibleDuplicateCitation({ projectId, duplicateId, testId }) {
   const queryKey = `/api/bibtexentries/formatted?projectId=${projectId}&id=${duplicateId}`;
   const { data: formattedCitation } = useBackend(
-    [queryKey],
+    [],
     {
       method: "GET",
killedBy: BibTexEntryShowPage tests lists multiple possible duplicates, one after another
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Second Duplicate Citation.
Received:
  First Duplicate Citation.

[Survived] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:113:5
       params: { projectId, id: duplicateId },
     },
     "",
-    true,
+    false,
   );
 

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:121:8
       to={`/project/${projectId}/bibtex/${duplicateId}`}
       data-testid={testId}
     >
-      {formattedCitation || "Loading..."}
+      {false}
     </Link>
   );
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Other, A. The Other Paper.
Received:

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:121:8
       to={`/project/${projectId}/bibtex/${duplicateId}`}
       data-testid={testId}
     >
-      {formattedCitation || "Loading..."}
+      {true}
     </Link>
   );
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Other, A. The Other Paper.
Received:

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:127:12
 }
 
 export default function BibTexEntryShowPage({
-  testId = "BibTexEntryShowPage",
+  testId = "",
 }) {
   const { id: projectId, entryId } = useParams();
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:130:56
   testId = "BibTexEntryShowPage",
 }) {
   const { id: projectId, entryId } = useParams();
-  const [showErrorModal, setShowErrorModal] = useState(false);
+  const [showErrorModal, setShowErrorModal] = useState(true);
   const [showAddReferenceModal, setShowAddReferenceModal] = useState(false);
   const [showAddCitationModal, setShowAddCitationModal] = useState(false);

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:131:70
 }) {
   const { id: projectId, entryId } = useParams();
   const [showErrorModal, setShowErrorModal] = useState(false);
-  const [showAddReferenceModal, setShowAddReferenceModal] = useState(false);
+  const [showAddReferenceModal, setShowAddReferenceModal] = useState(true);
   const [showAddCitationModal, setShowAddCitationModal] = useState(false);
   const [showBulkCitationUploadModal, setShowBulkCitationUploadModal] =
killedBy: BibTexEntryShowPage tests clicking Add Citation opens the modal, and submitting posts with relationship=citation
statusReason: Found multiple elements by: [data-testid="BibTexEntryModal-base"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="modal-dialog bibtex-entry-modal modal-dialog-centered"
  data-testid="BibTexEntryModal-base"

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:132:68
   const { id: projectId, entryId } = useParams();
   const [showErrorModal, setShowErrorModal] = useState(false);
   const [showAddReferenceModal, setShowAddReferenceModal] = useState(false);
-  const [showAddCitationModal, setShowAddCitationModal] = useState(false);
+  const [showAddCitationModal, setShowAddCitationModal] = useState(true);
   const [showBulkCitationUploadModal, setShowBulkCitationUploadModal] =
     useState(false);
killedBy: BibTexEntryShowPage tests clicking Add Reference opens the modal, and submitting posts with relationship=reference
statusReason: Found multiple elements by: [data-testid="BibTexEntryModal-base"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="modal-dialog bibtex-entry-modal modal-dialog-centered"
  data-testid="BibTexEntryModal-base"

[Survived] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:134:14
   const [showAddReferenceModal, setShowAddReferenceModal] = useState(false);
   const [showAddCitationModal, setShowAddCitationModal] = useState(false);
   const [showBulkCitationUploadModal, setShowBulkCitationUploadModal] =
-    useState(false);
+    useState(true);
   const [showBulkReferenceUploadModal, setShowBulkReferenceUploadModal] =
     useState(false);

[Survived] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:136:14
   const [showBulkCitationUploadModal, setShowBulkCitationUploadModal] =
     useState(false);
   const [showBulkReferenceUploadModal, setShowBulkReferenceUploadModal] =
-    useState(false);
+    useState(true);
   const [showEditModal, setShowEditModal] = useState(false);
   const [showDeleteModal, setShowDeleteModal] = useState(false);

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:137:54
     useState(false);
   const [showBulkReferenceUploadModal, setShowBulkReferenceUploadModal] =
     useState(false);
-  const [showEditModal, setShowEditModal] = useState(false);
+  const [showEditModal, setShowEditModal] = useState(true);
   const [showDeleteModal, setShowDeleteModal] = useState(false);
   const [showAbstractEditModal, setShowAbstractEditModal] = useState(false);
killedBy: BibTexEntryShowPage tests clicking Add Reference opens the modal, and submitting posts with relationship=reference
statusReason: Found multiple elements by: [data-testid="BibTexEntryModal-base"]

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  class="modal-dialog bibtex-entry-modal modal-dialog-centered"
  data-testid="BibTexEntryModal-base"

[Survived] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:138:58
   const [showBulkReferenceUploadModal, setShowBulkReferenceUploadModal] =
     useState(false);
   const [showEditModal, setShowEditModal] = useState(false);
-  const [showDeleteModal, setShowDeleteModal] = useState(false);
+  const [showDeleteModal, setShowDeleteModal] = useState(true);
   const [showAbstractEditModal, setShowAbstractEditModal] = useState(false);
   // Debug-only card (issue #77): local, unpersisted state (unlike CARD_DEFS' cards) since this

[Survived] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:139:70
     useState(false);
   const [showEditModal, setShowEditModal] = useState(false);
   const [showDeleteModal, setShowDeleteModal] = useState(false);
-  const [showAbstractEditModal, setShowAbstractEditModal] = useState(false);
+  const [showAbstractEditModal, setShowAbstractEditModal] = useState(true);
   // Debug-only card (issue #77): local, unpersisted state (unlike CARD_DEFS' cards) since this
   // is a temporary aid for actively developing/verifying backend schema changes, not a permanent

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:143:52
   // Debug-only card (issue #77): local, unpersisted state (unlike CARD_DEFS' cards) since this
   // is a temporary aid for actively developing/verifying backend schema changes, not a permanent
   // per-entry preference worth writing into CITELINES_ fields.
-  const [showRawEntry, setShowRawEntry] = useState(false);
+  const [showRawEntry, setShowRawEntry] = useState(true);
   // Open by default whenever the entry is flagged, matching CitationTable's Flags column.
   const [showPossibleDuplicates, setShowPossibleDuplicates] = useState(true);
killedBy: BibTexEntryShowPage tests the Raw BibTeX (debug) card is closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:145:72
   // per-entry preference worth writing into CITELINES_ fields.
   const [showRawEntry, setShowRawEntry] = useState(false);
   // Open by default whenever the entry is flagged, matching CitationTable's Flags column.
-  const [showPossibleDuplicates, setShowPossibleDuplicates] = useState(true);
+  const [showPossibleDuplicates, setShowPossibleDuplicates] = useState(false);
 
   const entryQueryKey = `/api/bibtexentries/entry?projectId=${projectId}&id=${entryId}`;
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:147:25
   // Open by default whenever the entry is flagged, matching CitationTable's Flags column.
   const [showPossibleDuplicates, setShowPossibleDuplicates] = useState(true);
 
-  const entryQueryKey = `/api/bibtexentries/entry?projectId=${projectId}&id=${entryId}`;
+  const entryQueryKey = ``;
   const { data: entry, failureCount: entryBackendFailureCount } = useBackend(
     [entryQueryKey],

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:159:26
     true,
   );
 
-  const getEntryFailed = entryBackendFailureCount > 0;
+  const getEntryFailed = false;
 
   const navigate = useNavigate();
killedBy: BibTexEntryShowPage tests shows an error modal and returns to the project page when the entry cannot be fetched
statusReason: Unable to find an element with the text: Citation Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] EqualityOperator
main/pages/Projects/BibTexEntryShowPage.jsx:159:26
     true,
   );
 
-  const getEntryFailed = entryBackendFailureCount > 0;
+  const getEntryFailed = entryBackendFailureCount >= 0;
 
   const navigate = useNavigate();

[Killed] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:162:19
   const getEntryFailed = entryBackendFailureCount > 0;
 
   const navigate = useNavigate();
-  useEffect(() => {
-    if (getEntryFailed) {
-      setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate(`/project/${projectId}`, { replace: true });
-      }, 3000);
-      // Stryker disable next-line BlockStatement
-      return () => {
-        clearTimeout(timer);
-      };
-    }
-  }, [getEntryFailed, navigate, projectId]);
+  useEffect(() => {}, [getEntryFailed, navigate, projectId]);
 
   const { data: project } = useBackend(
killedBy: BibTexEntryShowPage tests shows an error modal and returns to the project page when the entry cannot be fetched
statusReason: Unable to find an element with the text: Citation Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:163:9
 
   const navigate = useNavigate();
   useEffect(() => {
-    if (getEntryFailed) {
+    if (false) {
       setShowErrorModal(true);
       const timer = setTimeout(() => {
killedBy: BibTexEntryShowPage tests shows an error modal and returns to the project page when the entry cannot be fetched
statusReason: Unable to find an element with the text: Citation Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:163:25
 
   const navigate = useNavigate();
   useEffect(() => {
-    if (getEntryFailed) {
-      setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate(`/project/${projectId}`, { replace: true });
-      }, 3000);
-      // Stryker disable next-line BlockStatement
-      return () => {
-        clearTimeout(timer);
-      };
-    }
+    if (getEntryFailed) {}
   }, [getEntryFailed, navigate, projectId]);
 
killedBy: BibTexEntryShowPage tests shows an error modal and returns to the project page when the entry cannot be fetched
statusReason: Unable to find an element with the text: Citation Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:164:25
   const navigate = useNavigate();
   useEffect(() => {
     if (getEntryFailed) {
-      setShowErrorModal(true);
+      setShowErrorModal(false);
       const timer = setTimeout(() => {
         navigate(`/project/${projectId}`, { replace: true });
killedBy: BibTexEntryShowPage tests shows an error modal and returns to the project page when the entry cannot be fetched
statusReason: Unable to find an element with the text: Citation Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[NoCoverage] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:165:38
   useEffect(() => {
     if (getEntryFailed) {
       setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate(`/project/${projectId}`, { replace: true });
-      }, 3000);
+      const timer = setTimeout(() => {}, 3000);
       // Stryker disable next-line BlockStatement
       return () => {

[NoCoverage] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:166:54
     if (getEntryFailed) {
       setShowErrorModal(true);
       const timer = setTimeout(() => {
-        navigate(`/project/${projectId}`, { replace: true });
+        navigate(`/project/${projectId}`, { replace: false });
       }, 3000);
       // Stryker disable next-line BlockStatement

[NoCoverage] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:166:18
     if (getEntryFailed) {
       setShowErrorModal(true);
       const timer = setTimeout(() => {
-        navigate(`/project/${projectId}`, { replace: true });
+        navigate(``, { replace: true });
       }, 3000);
       // Stryker disable next-line BlockStatement

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:176:6
   }, [getEntryFailed, navigate, projectId]);
 
   const { data: project } = useBackend(
-    [`/api/projects/${projectId}`],
+    [``],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: `/api/projects/${projectId}` },
