[Killed] StringLiteral
main/pages/Admin/AdminsIndexPage.tsx:11:15
 export default function AdminsIndexPage(): React.JSX.Element {
   const { data: admins } = useBackend<RoleEmail[]>(
     ["/api/admin/all"],
-    { method: "GET", url: "/api/admin/all" },
+    { method: "", url: "/api/admin/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: AdminsIndexPage tests renders empty table when backend unavailable
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'

[Killed] BlockStatement
main/pages/Admin/AdminsIndexPage.tsx:16:30
     [],
   );
 
-  const createButton = () => {
-    return (
-      <Link
-        className="btn btn-primary"
-        to="/admin/admins/create"
-        style={{ float: "right" }}
-      >
-        New Admin
-      </Link>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: AdminsIndexPage tests Renders with New Admin Button
statusReason: Unable to find an element with the text: /New Admin/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Admin/AdminsIndexPage.tsx:34:17
         {createButton()}
         <h1>Admins</h1>
         <RoleEmailTable
-          data={admins ?? []}
+          data={admins && []}
           deleteEndpoint="/api/admin/delete"
           getEndpoint="/api/admin/all"
killedBy: AdminsIndexPage tests renders three items correctly
statusReason: Unable to find an element by: [data-testid="AdminsIndexPage-cell-row-0-col-email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
