[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:183:24
     true,
   );
 
-  const tagsQueryKey = `/api/tags/project?projectId=${projectId}`;
+  const tagsQueryKey = ``;
   const { data: allTags } = useBackend(
     [tagsQueryKey],
killedBy: BibTexEntryShowPage tests shows tags as pill badges in the References and Citations read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-0-col-tags-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:187:5
   const { data: allTags } = useBackend(
     [tagsQueryKey],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
-    { method: "GET", url: tagsQueryKey },
+    {},
     [],
     true,
killedBy: BibTexEntryShowPage tests shows tags as pill badges in the References and Citations read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-0-col-tags-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:188:5
     [tagsQueryKey],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: tagsQueryKey },
-    [],
+    ["Stryker was here"],
     true,
   );

[Killed] LogicalOperator
main/pages/Projects/BibTexEntryShowPage.jsx:191:34
     [],
     true,
   );
-  const assignedTagIds = new Set(entry?.tagIds ?? []);
+  const assignedTagIds = new Set(entry?.tagIds && []);
   const assignedTags = allTags.filter((tag) => assignedTagIds.has(tag.id));
 
killedBy: BibTexEntryShowPage tests shows a TagSelector with the project's tags and the entry's assigned tags
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-TagSelector-assigned-tag-1"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:191:34
     [],
     true,
   );
-  const assignedTagIds = new Set(entry?.tagIds ?? []);
+  const assignedTagIds = new Set(entry.tagIds ?? []);
   const assignedTags = allTags.filter((tag) => assignedTagIds.has(tag.id));
 
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'tagIds')

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:192:39
     true,
   );
   const assignedTagIds = new Set(entry?.tagIds ?? []);
-  const assignedTags = allTags.filter((tag) => assignedTagIds.has(tag.id));
+  const assignedTags = allTags.filter(() => undefined);
 
   const addTagMutation = useBackendMutation(
killedBy: BibTexEntryShowPage tests shows a TagSelector with the project's tags and the entry's assigned tags
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-TagSelector-assigned-tag-1"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] MethodExpression
main/pages/Projects/BibTexEntryShowPage.jsx:192:24
     true,
   );
   const assignedTagIds = new Set(entry?.tagIds ?? []);
-  const assignedTags = allTags.filter((tag) => assignedTagIds.has(tag.id));
+  const assignedTags = allTags;
 
   const addTagMutation = useBackendMutation(
killedBy: BibTexEntryShowPage tests shows a TagSelector with the project's tags and the entry's assigned tags
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="d-inline-flex align-items-center"
  data-testid="BibTexEntryShowPage-TagSelector-assigned-tag-2"
>
  <span>
    <span

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:195:5
   const assignedTags = allTags.filter((tag) => assignedTagIds.has(tag.id));
 
   const addTagMutation = useBackendMutation(
-    (tag) => ({
-      url: "/api/bibtexentries/tags",
-      method: "POST",
-      params: { id: entry?.id, projectId, tagId: tag.id },
-    }),
+    () => undefined,
     {},
     [entryQueryKey],
killedBy: BibTexEntryShowPage tests clicking a tag in the Add Tag dropdown POSTs to associate it and refetches the entry
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Survived] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:198:21
     (tag) => ({
       url: "/api/bibtexentries/tags",
       method: "POST",
-      params: { id: entry?.id, projectId, tagId: tag.id },
+      params: { id: entry.id, projectId, tagId: tag.id },
     }),
     {},

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:201:5
       params: { id: entry?.id, projectId, tagId: tag.id },
     }),
     {},
-    [entryQueryKey],
+    [],
   );
 

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:205:5
   );
 
   const removeTagMutation = useBackendMutation(
-    (tag) => ({
-      url: "/api/bibtexentries/tags",
-      method: "DELETE",
-      params: { id: entry?.id, projectId, tagId: tag.id },
-    }),
+    () => undefined,
     {},
     [entryQueryKey],
killedBy: BibTexEntryShowPage tests clicking the remove button on an assigned tag DELETEs to remove it and refetches the entry
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Survived] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:208:21
     (tag) => ({
       url: "/api/bibtexentries/tags",
       method: "DELETE",
-      params: { id: entry?.id, projectId, tagId: tag.id },
+      params: { id: entry.id, projectId, tagId: tag.id },
     }),
     {},

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:214:95
     [entryQueryKey],
   );
 
-  const formattedCitationQueryKey = `/api/bibtexentries/formatted?projectId=${projectId}&id=${entry?.id}`;
+  const formattedCitationQueryKey = `/api/bibtexentries/formatted?projectId=${projectId}&id=${entry.id}`;
   const { data: formattedCitation } = useBackend(
     [formattedCitationQueryKey],
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:214:37
     [entryQueryKey],
   );
 
-  const formattedCitationQueryKey = `/api/bibtexentries/formatted?projectId=${projectId}&id=${entry?.id}`;
+  const formattedCitationQueryKey = ``;
   const { data: formattedCitation } = useBackend(
     [formattedCitationQueryKey],

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:216:5
 
   const formattedCitationQueryKey = `/api/bibtexentries/formatted?projectId=${projectId}&id=${entry?.id}`;
   const { data: formattedCitation } = useBackend(
-    [formattedCitationQueryKey],
+    [],
     {
       method: "GET",

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:219:12
     [formattedCitationQueryKey],
     {
       method: "GET",
-      url: "/api/bibtexentries/formatted",
+      url: "",
       params: { projectId, id: entry?.id },
     },
killedBy: BibTexEntryShowPage tests shows a Formatted Reference card with the project's citation format and the formatted citation
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Smith, J. A Very Long Title.
Received:


Ignored nodes: comments, script, style

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:220:32
     {
       method: "GET",
       url: "/api/bibtexentries/formatted",
-      params: { projectId, id: entry?.id },
+      params: { projectId, id: entry.id },
     },
     "",
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:224:16
     },
     "",
     true,
-    { enabled: !!entry },
+    { enabled: !entry },
   );
 
killedBy: BibTexEntryShowPage tests shows a Formatted Reference card with the project's citation format and the formatted citation
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Smith, J. A Very Long Title.
Received:


Ignored nodes: comments, script, style

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:227:81
     { enabled: !!entry },
   );
 
-  const exportQueryKey = `/api/bibtexentries/export?projectId=${projectId}&id=${entry?.id}`;
+  const exportQueryKey = `/api/bibtexentries/export?projectId=${projectId}&id=${entry.id}`;
   const { data: rawBibtex } = useBackend(
     [exportQueryKey],
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:229:5
 
   const exportQueryKey = `/api/bibtexentries/export?projectId=${projectId}&id=${entry?.id}`;
   const { data: rawBibtex } = useBackend(
-    [exportQueryKey],
+    [],
     {
       method: "GET",

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:233:32
     {
       method: "GET",
       url: "/api/bibtexentries/export",
-      params: { projectId, id: entry?.id },
+      params: { projectId, id: entry.id },
     },
     "",
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:235:5
       url: "/api/bibtexentries/export",
       params: { projectId, id: entry?.id },
     },
-    "",
+    "Stryker was here!",
     true,
     { enabled: !!entry },

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:243:54
   const { strippedBibtex, relevance, preservedFields } =
     extractCitelinesFields(rawBibtex);
 
-  const [cardOpenState, setCardOpenState] = useState(() =>
-    Object.fromEntries(CARD_DEFS.map((c) => [c.key, c.defaultOpen])),
+  const [cardOpenState, setCardOpenState] = useState(() => undefined,
   );
 
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:244:38
     extractCitelinesFields(rawBibtex);
 
   const [cardOpenState, setCardOpenState] = useState(() =>
-    Object.fromEntries(CARD_DEFS.map((c) => [c.key, c.defaultOpen])),
+    Object.fromEntries(CARD_DEFS.map(() => undefined)),
   );
 
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Iterator value undefined is not an entry object

[Survived] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:250:19
   // Once the raw bibtex (and hence preservedFields) has loaded, derive each card's open/closed
   // state from its persisted CITELINES_card_* field, defaulting per CARD_DEFS if the field isn't
   // present (e.g. this entry has never had a card toggled before).
-  useEffect(() => {
-    if (!rawBibtex) return;
-    setCardOpenState(
-      Object.fromEntries(
-        CARD_DEFS.map((c) => [
-          c.key,
-          (preservedFields[`citelines_${c.field}`] ??
-            (c.defaultOpen ? "Open" : "Closed")) === "Open",
-        ]),
-      ),
-    );
-    // eslint-disable-next-line react-hooks/exhaustive-deps
-  }, [rawBibtex]);
+  useEffect(() => {}, [rawBibtex]);
 
   const referencesQueryKey = `/api/citationedges/references?projectId=${projectId}&id=${entry?.id}`;

[Survived] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:251:9
   // state from its persisted CITELINES_card_* field, defaulting per CARD_DEFS if the field isn't
   // present (e.g. this entry has never had a card toggled before).
   useEffect(() => {
-    if (!rawBibtex) return;
+    if (true) return;
     setCardOpenState(
       Object.fromEntries(

[Survived] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:251:9
   // state from its persisted CITELINES_card_* field, defaulting per CARD_DEFS if the field isn't
   // present (e.g. this entry has never had a card toggled before).
   useEffect(() => {
-    if (!rawBibtex) return;
+    if (false) return;
     setCardOpenState(
       Object.fromEntries(

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:254:23
     if (!rawBibtex) return;
     setCardOpenState(
       Object.fromEntries(
-        CARD_DEFS.map((c) => [
-          c.key,
-          (preservedFields[`citelines_${c.field}`] ??
-            (c.defaultOpen ? "Open" : "Closed")) === "Open",
-        ]),
+        CARD_DEFS.map(() => undefined),
       ),
     );
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] EqualityOperator
main/pages/Projects/BibTexEntryShowPage.jsx:256:11
       Object.fromEntries(
         CARD_DEFS.map((c) => [
           c.key,
-          (preservedFields[`citelines_${c.field}`] ??
-            (c.defaultOpen ? "Open" : "Closed")) === "Open",
+          (preservedFields[`citelines_${c.field}`] ?? (c.defaultOpen ? "Open" : "Closed")) !== "Open",
         ]),
       ),
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] LogicalOperator
main/pages/Projects/BibTexEntryShowPage.jsx:256:12
       Object.fromEntries(
         CARD_DEFS.map((c) => [
           c.key,
-          (preservedFields[`citelines_${c.field}`] ??
-            (c.defaultOpen ? "Open" : "Closed")) === "Open",
+          (preservedFields[`citelines_${c.field}`] && (c.defaultOpen ? "Open" : "Closed")) === "Open",
         ]),
       ),
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:262:6
       ),
     );
     // eslint-disable-next-line react-hooks/exhaustive-deps
-  }, [rawBibtex]);
+  }, []);
 
   const referencesQueryKey = `/api/citationedges/references?projectId=${projectId}&id=${entry?.id}`;

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:264:89
     // eslint-disable-next-line react-hooks/exhaustive-deps
   }, [rawBibtex]);
 
-  const referencesQueryKey = `/api/citationedges/references?projectId=${projectId}&id=${entry?.id}`;
+  const referencesQueryKey = `/api/citationedges/references?projectId=${projectId}&id=${entry.id}`;
   const { data: references } = useBackend(
     [referencesQueryKey],
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:269:12
     [referencesQueryKey],
     {
       method: "GET",
-      url: "/api/citationedges/references",
+      url: "",
       params: { projectId, id: entry?.id },
     },
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:270:32
     {
       method: "GET",
       url: "/api/citationedges/references",
-      params: { projectId, id: entry?.id },
+      params: { projectId, id: entry.id },
     },
     [],
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:274:40
     },
     [],
     true,
-    { refetchInterval: 5000, enabled: !!entry },
+    { refetchInterval: 5000, enabled: !entry },
   );
 
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:277:87
     { refetchInterval: 5000, enabled: !!entry },
   );
 
-  const citationsQueryKey = `/api/citationedges/citations?projectId=${projectId}&id=${entry?.id}`;
+  const citationsQueryKey = `/api/citationedges/citations?projectId=${projectId}&id=${entry.id}`;
   const { data: citations } = useBackend(
     [citationsQueryKey],
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:283:32
     {
       method: "GET",
       url: "/api/citationedges/citations",
-      params: { projectId, id: entry?.id },
+      params: { projectId, id: entry.id },
     },
     [],
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:283:15
     {
       method: "GET",
       url: "/api/citationedges/citations",
-      params: { projectId, id: entry?.id },
+      params: {},
     },
     [],
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: expected {} to deeply equal { projectId: '1', …(1) }

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:292:77
 
   const { data: unresolved } = useBackend(
     [
-      `/api/citationedges/unresolved?projectId=${projectId}&sourceEntryId=${entry?.id}`,
+      `/api/citationedges/unresolved?projectId=${projectId}&sourceEntryId=${entry.id}`,
     ],
     {
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:294:5
     [
       `/api/citationedges/unresolved?projectId=${projectId}&sourceEntryId=${entry?.id}`,
     ],
-    {
-      method: "GET",
-      url: "/api/citationedges/unresolved",
-      params: { projectId, sourceEntryId: entry?.id },
-    },
+    {},
     [],
     true,
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-references-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:297:43
     {
       method: "GET",
       url: "/api/citationedges/unresolved",
-      params: { projectId, sourceEntryId: entry?.id },
+      params: { projectId, sourceEntryId: entry.id },
     },
     [],
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Killed] MethodExpression
main/pages/Projects/BibTexEntryShowPage.jsx:303:37
     true,
     { refetchInterval: 5000, enabled: !!entry },
   );
-  const unresolvedReferencesCount = unresolved.filter(
-    (u) => u.direction === "reference",
-  ).length;
+  const unresolvedReferencesCount = unresolved.length;
   const unresolvedCitationsCount = unresolved.filter(
     (u) => u.direction === "citation",
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2 unresolved
Received:
  — 3 unresolved

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:304:12
     { refetchInterval: 5000, enabled: !!entry },
   );
   const unresolvedReferencesCount = unresolved.filter(
-    (u) => u.direction === "reference",
+    (u) => false,
   ).length;
   const unresolvedCitationsCount = unresolved.filter(
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-references-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:304:12
     { refetchInterval: 5000, enabled: !!entry },
   );
   const unresolvedReferencesCount = unresolved.filter(
-    (u) => u.direction === "reference",
+    (u) => true,
   ).length;
   const unresolvedCitationsCount = unresolved.filter(
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2 unresolved
Received:
  — 3 unresolved

Ignored nodes: comments, script, style

[Killed] MethodExpression
main/pages/Projects/BibTexEntryShowPage.jsx:306:36
   const unresolvedReferencesCount = unresolved.filter(
     (u) => u.direction === "reference",
   ).length;
-  const unresolvedCitationsCount = unresolved.filter(
-    (u) => u.direction === "citation",
-  ).length;
+  const unresolvedCitationsCount = unresolved.length;
 
   const abstractText = entry?.keyValuePairs?.abstract ?? "";
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1 unresolved
Received:
  — 3 unresolved

[Killed] EqualityOperator
main/pages/Projects/BibTexEntryShowPage.jsx:307:12
     (u) => u.direction === "reference",
   ).length;
   const unresolvedCitationsCount = unresolved.filter(
-    (u) => u.direction === "citation",
+    (u) => u.direction !== "citation",
   ).length;
 
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1 unresolved
Received:
  — 2 unresolved

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:307:12
     (u) => u.direction === "reference",
   ).length;
   const unresolvedCitationsCount = unresolved.filter(
-    (u) => u.direction === "citation",
+    (u) => true,
   ).length;
 
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1 unresolved
Received:
  — 3 unresolved

[Killed] LogicalOperator
main/pages/Projects/BibTexEntryShowPage.jsx:310:24
     (u) => u.direction === "citation",
   ).length;
 
-  const abstractText = entry?.keyValuePairs?.abstract ?? "";
+  const abstractText = entry?.keyValuePairs?.abstract && "";
   const abstractWordCount = abstractText.trim()
     ? abstractText.trim().split(/\s+/).length
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:310:24
     (u) => u.direction === "citation",
   ).length;
 
-  const abstractText = entry?.keyValuePairs?.abstract ?? "";
+  const abstractText = entry.keyValuePairs?.abstract ?? "";
   const abstractWordCount = abstractText.trim()
     ? abstractText.trim().split(/\s+/).length
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'keyValuePairs')

[Survived] MethodExpression
main/pages/Projects/BibTexEntryShowPage.jsx:311:29
   ).length;
 
   const abstractText = entry?.keyValuePairs?.abstract ?? "";
-  const abstractWordCount = abstractText.trim()
+  const abstractWordCount = abstractText
     ? abstractText.trim().split(/\s+/).length
     : 0;

[Survived] MethodExpression
main/pages/Projects/BibTexEntryShowPage.jsx:312:7
 
   const abstractText = entry?.keyValuePairs?.abstract ?? "";
   const abstractWordCount = abstractText.trim()
-    ? abstractText.trim().split(/\s+/).length
+    ? abstractText.split(/\s+/).length
     : 0;
 

[Killed] Regex
main/pages/Projects/BibTexEntryShowPage.jsx:312:33
 
   const abstractText = entry?.keyValuePairs?.abstract ?? "";
   const abstractWordCount = abstractText.trim()
-    ? abstractText.trim().split(/\s+/).length
+    ? abstractText.trim().split(/\S+/).length
     : 0;
 
killedBy: BibTexEntryShowPage tests the Abstract card shows the word count and text for an entry with an abstract
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Abstract (6 words)
Received:
  Abstract (7 words)Edit▼

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:316:5
     : 0;
 
   const getReferencesMutation = useBackendMutation(
-    () => ({
-      url: "/api/jobs/launch/getReferences",
-      method: "POST",
-      params: { projectId, citeKey: entry?.citeKey },
-    }),
+    () => undefined,
     {
       onSuccess: () =>
killedBy: BibTexEntryShowPage tests clicking Get References launches the job and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Survived] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:319:37
     () => ({
       url: "/api/jobs/launch/getReferences",
       method: "POST",
-      params: { projectId, citeKey: entry?.citeKey },
+      params: { projectId, citeKey: entry.citeKey },
     }),
     {

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:321:5
       method: "POST",
       params: { projectId, citeKey: entry?.citeKey },
     }),
-    {
-      onSuccess: () =>
-        toast("Get References job launched — check the Jobs tab for progress."),
-    },
+    {},
   );
 
killedBy: BibTexEntryShowPage tests clicking Get References launches the job and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:322:18
       params: { projectId, citeKey: entry?.citeKey },
     }),
     {
-      onSuccess: () =>
-        toast("Get References job launched — check the Jobs tab for progress."),
+      onSuccess: () => undefined,
     },
   );
killedBy: BibTexEntryShowPage tests clicking Get References launches the job and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:323:15
     }),
     {
       onSuccess: () =>
-        toast("Get References job launched — check the Jobs tab for progress."),
+        toast(""),
     },
   );
killedBy: BibTexEntryShowPage tests clicking Get References launches the job and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Get References job launched — check the Jobs tab for progress.",

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:328:5
   );
 
   const getCitationsMutation = useBackendMutation(
-    () => ({
-      url: "/api/jobs/launch/getCitations",
-      method: "POST",
-      params: { projectId, citeKey: entry?.citeKey },
-    }),
+    () => undefined,
     {
       onSuccess: () =>
killedBy: BibTexEntryShowPage tests clicking Get Citations launches the job and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"
