[Killed] BooleanLiteral
main/pages/Admin/ResearchersCreatePage.tsx:15:15
 };
 
 export default function ResearchersCreatePage({
-  storybook = false,
+  storybook = true,
 }: ResearchersCreatePageProps): React.JSX.Element {
   const navigation = useNavigate();
killedBy: ResearchersCreatePage tests on submit, makes request to backend, and redirects to /admin/researchers
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/researchers' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/pages/Admin/ResearchersCreatePage.tsx:18:31
   storybook = false,
 }: ResearchersCreatePageProps): React.JSX.Element {
   const navigation = useNavigate();
-  const objectToAxiosParams = (
-    researcher: RoleEmailFormFields,
-  ): AxiosRequestConfig => ({
-    url: "/api/admin/researchers/post",
-    method: "POST",
-    params: {
-      email: researcher.email,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (researcher: RoleEmailFormFields) => {
killedBy: ResearchersCreatePage tests on submit, makes request to backend, and redirects to /admin/researchers
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/Admin/ResearchersCreatePage.tsx:28:58
     },
   });
 
-  const onSuccess = (researcher: RoleEmailFormFields) => {
-    toast(`New researcher added - email: ${researcher.email}`);
-    if (!storybook) navigation("/admin/researchers");
-  };
+  const onSuccess = (researcher: RoleEmailFormFields) => {};
 
   const mutation = useBackendMutation(
killedBy: ResearchersCreatePage tests on submit, makes request to backend, and redirects to /admin/researchers
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BooleanLiteral
main/pages/Admin/ResearchersCreatePage.tsx:30:9
 
   const onSuccess = (researcher: RoleEmailFormFields) => {
     toast(`New researcher added - email: ${researcher.email}`);
-    if (!storybook) navigation("/admin/researchers");
+    if (storybook) navigation("/admin/researchers");
   };
 
killedBy: ResearchersCreatePage tests on submit, makes request to backend, and redirects to /admin/researchers
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/researchers' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/Admin/ResearchersCreatePage.tsx:30:9
 
   const onSuccess = (researcher: RoleEmailFormFields) => {
     toast(`New researcher added - email: ${researcher.email}`);
-    if (!storybook) navigation("/admin/researchers");
+    if (false) navigation("/admin/researchers");
   };
 
killedBy: ResearchersCreatePage tests on submit, makes request to backend, and redirects to /admin/researchers
statusReason: expected "vi.fn()" to be called with arguments: [ '/admin/researchers' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
