[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:330:15
   const getCitationsMutation = useBackendMutation(
     () => ({
       url: "/api/jobs/launch/getCitations",
-      method: "POST",
+      method: "",
       params: { projectId, citeKey: entry?.citeKey },
     }),
killedBy: BibTexEntryShowPage tests clicking Get Citations launches the job and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:333:5
       method: "POST",
       params: { projectId, citeKey: entry?.citeKey },
     }),
-    {
-      onSuccess: () =>
-        toast("Get Citations job launched — check the Jobs tab for progress."),
-    },
+    {},
   );
 
killedBy: BibTexEntryShowPage tests clicking Get Citations launches the job and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:334:18
       params: { projectId, citeKey: entry?.citeKey },
     }),
     {
-      onSuccess: () =>
-        toast("Get Citations job launched — check the Jobs tab for progress."),
+      onSuccess: () => undefined,
     },
   );
killedBy: BibTexEntryShowPage tests clicking Get Citations launches the job and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:340:5
   );
 
   const updateRelevanceMutation = useBackendMutation(
-    (newRelevance) => ({
-      url: "/api/bibtexentries",
-      method: "PUT",
-      params: { id: entry?.id, projectId },
-      data: injectCitelinesFields(rawBibtex, newRelevance, preservedFields),
-      headers: { "Content-Type": "text/plain" },
-    }),
+    () => undefined,
     { onSuccess: () => toast("Relevance updated successfully") },
     [exportQueryKey],
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:340:24
   );
 
   const updateRelevanceMutation = useBackendMutation(
-    (newRelevance) => ({
-      url: "/api/bibtexentries",
-      method: "PUT",
-      params: { id: entry?.id, projectId },
-      data: injectCitelinesFields(rawBibtex, newRelevance, preservedFields),
-      headers: { "Content-Type": "text/plain" },
-    }),
+    (newRelevance) => ({}),
     { onSuccess: () => toast("Relevance updated successfully") },
     [exportQueryKey],
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Survived] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:343:21
     (newRelevance) => ({
       url: "/api/bibtexentries",
       method: "PUT",
-      params: { id: entry?.id, projectId },
+      params: { id: entry.id, projectId },
       data: injectCitelinesFields(rawBibtex, newRelevance, preservedFields),
       headers: { "Content-Type": "text/plain" },

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:347:18
       data: injectCitelinesFields(rawBibtex, newRelevance, preservedFields),
       headers: { "Content-Type": "text/plain" },
     }),
-    { onSuccess: () => toast("Relevance updated successfully") },
+    { onSuccess: () => undefined },
     [exportQueryKey],
   );
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected "vi.fn()" to be called with arguments: [ 'Relevance updated successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:348:5
       headers: { "Content-Type": "text/plain" },
     }),
     { onSuccess: () => toast("Relevance updated successfully") },
-    [exportQueryKey],
+    [],
   );
 

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:352:5
   );
 
   const updateCardStateMutation = useBackendMutation(
-    (newPreservedFields) => ({
-      url: "/api/bibtexentries",
-      method: "PUT",
-      params: { id: entry?.id, projectId },
-      data: injectCitelinesFields(rawBibtex, relevance, newPreservedFields),
-      headers: { "Content-Type": "text/plain" },
-    }),
+    () => undefined,
     {},
     [exportQueryKey],
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expected +0 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:352:30
   );
 
   const updateCardStateMutation = useBackendMutation(
-    (newPreservedFields) => ({
-      url: "/api/bibtexentries",
-      method: "PUT",
-      params: { id: entry?.id, projectId },
-      data: injectCitelinesFields(rawBibtex, relevance, newPreservedFields),
-      headers: { "Content-Type": "text/plain" },
-    }),
+    (newPreservedFields) => ({}),
     {},
     [exportQueryKey],
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expected +0 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:354:15
   const updateCardStateMutation = useBackendMutation(
     (newPreservedFields) => ({
       url: "/api/bibtexentries",
-      method: "PUT",
+      method: "",
       params: { id: entry?.id, projectId },
       data: injectCitelinesFields(rawBibtex, relevance, newPreservedFields),
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expected +0 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:357:34
       method: "PUT",
       params: { id: entry?.id, projectId },
       data: injectCitelinesFields(rawBibtex, relevance, newPreservedFields),
-      headers: { "Content-Type": "text/plain" },
+      headers: { "Content-Type": "" },
     }),
     {},

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:360:5
       headers: { "Content-Type": "text/plain" },
     }),
     {},
-    [exportQueryKey],
+    [],
   );
 

[Killed] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:363:43
     [exportQueryKey],
   );
 
-  function toggleCard(cardKey, fieldName) {
-    setCardOpenState((prev) => {
-      const newIsOpen = !prev[cardKey];
-      // rawBibtex may not have loaded yet; injecting into an empty string would wipe the entry,
-      // so only persist once we actually have the entry's bibtex to merge the new state into.
-      if (rawBibtex) {
-        updateCardStateMutation.mutate({
-          ...preservedFields,
-          [`citelines_${fieldName}`]: newIsOpen ? "Open" : "Closed",
-        });
-      }
-      return { ...prev, [cardKey]: newIsOpen };
-    });
-  }
+  function toggleCard(cardKey, fieldName) {}
 
   const deleteMutation = useBackendMutation(
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:364:32
   );
 
   function toggleCard(cardKey, fieldName) {
-    setCardOpenState((prev) => {
-      const newIsOpen = !prev[cardKey];
-      // rawBibtex may not have loaded yet; injecting into an empty string would wipe the entry,
-      // so only persist once we actually have the entry's bibtex to merge the new state into.
-      if (rawBibtex) {
-        updateCardStateMutation.mutate({
-          ...preservedFields,
-          [`citelines_${fieldName}`]: newIsOpen ? "Open" : "Closed",
-        });
-      }
-      return { ...prev, [cardKey]: newIsOpen };
-    });
+    setCardOpenState((prev) => {});
   }
 
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: Cannot read properties of undefined (reading 'abstract')

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:365:25
 
   function toggleCard(cardKey, fieldName) {
     setCardOpenState((prev) => {
-      const newIsOpen = !prev[cardKey];
+      const newIsOpen = prev[cardKey];
       // rawBibtex may not have loaded yet; injecting into an empty string would wipe the entry,
       // so only persist once we actually have the entry's bibtex to merge the new state into.
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:368:11
       const newIsOpen = !prev[cardKey];
       // rawBibtex may not have loaded yet; injecting into an empty string would wipe the entry,
       // so only persist once we actually have the entry's bibtex to merge the new state into.
-      if (rawBibtex) {
+      if (false) {
         updateCardStateMutation.mutate({
           ...preservedFields,
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expected +0 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:368:22
       const newIsOpen = !prev[cardKey];
       // rawBibtex may not have loaded yet; injecting into an empty string would wipe the entry,
       // so only persist once we actually have the entry's bibtex to merge the new state into.
-      if (rawBibtex) {
-        updateCardStateMutation.mutate({
-          ...preservedFields,
-          [`citelines_${fieldName}`]: newIsOpen ? "Open" : "Closed",
-        });
-      }
+      if (rawBibtex) {}
       return { ...prev, [cardKey]: newIsOpen };
     });
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expected +0 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:371:51
       if (rawBibtex) {
         updateCardStateMutation.mutate({
           ...preservedFields,
-          [`citelines_${fieldName}`]: newIsOpen ? "Open" : "Closed",
+          [`citelines_${fieldName}`]: newIsOpen ? "" : "Closed",
         });
       }
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expected '@article{smith2020,\n  title = {A Ver…' to contain 'CITELINES_card_comments = {Open}'

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:379:5
   }
 
   const deleteMutation = useBackendMutation(
-    () => ({
-      url: "/api/bibtexentries/delete",
-      method: "DELETE",
-      params: { id: entry?.id, projectId },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: BibTexEntryShowPage tests clicking Yes, Delete deletes the entry and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:379:12
   }
 
   const deleteMutation = useBackendMutation(
-    () => ({
-      url: "/api/bibtexentries/delete",
-      method: "DELETE",
-      params: { id: entry?.id, projectId },
-    }),
+    () => ({}),
     {
       onSuccess: () => {
killedBy: BibTexEntryShowPage tests clicking Yes, Delete deletes the entry and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:380:12
 
   const deleteMutation = useBackendMutation(
     () => ({
-      url: "/api/bibtexentries/delete",
+      url: "",
       method: "DELETE",
       params: { id: entry?.id, projectId },
killedBy: BibTexEntryShowPage tests clicking Yes, Delete deletes the entry and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'Entry deleted successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Entry deleted successfully",

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:381:15
   const deleteMutation = useBackendMutation(
     () => ({
       url: "/api/bibtexentries/delete",
-      method: "DELETE",
+      method: "",
       params: { id: entry?.id, projectId },
     }),
killedBy: BibTexEntryShowPage tests clicking Yes, Delete deletes the entry and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Survived] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:382:21
     () => ({
       url: "/api/bibtexentries/delete",
       method: "DELETE",
-      params: { id: entry?.id, projectId },
+      params: { id: entry.id, projectId },
     }),
     {

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:382:15
     () => ({
       url: "/api/bibtexentries/delete",
       method: "DELETE",
-      params: { id: entry?.id, projectId },
+      params: {},
     }),
     {
killedBy: BibTexEntryShowPage tests clicking Yes, Delete deletes the entry and shows a toast
statusReason: expected {} to deeply equal { Object (id, projectId) }

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:384:5
       method: "DELETE",
       params: { id: entry?.id, projectId },
     }),
-    {
-      onSuccess: () => {
-        toast("Entry deleted successfully");
-        navigate(`/project/${projectId}`, { replace: true });
-      },
-    },
+    {},
   );
 
killedBy: BibTexEntryShowPage tests clicking Yes, Delete deletes the entry and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'Entry deleted successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:385:24
       params: { id: entry?.id, projectId },
     }),
     {
-      onSuccess: () => {
-        toast("Entry deleted successfully");
-        navigate(`/project/${projectId}`, { replace: true });
-      },
+      onSuccess: () => {},
     },
   );
killedBy: BibTexEntryShowPage tests clicking Yes, Delete deletes the entry and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'Entry deleted successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Survived] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:387:54
     {
       onSuccess: () => {
         toast("Entry deleted successfully");
-        navigate(`/project/${projectId}`, { replace: true });
+        navigate(`/project/${projectId}`, { replace: false });
       },
     },

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:387:18
     {
       onSuccess: () => {
         toast("Entry deleted successfully");
-        navigate(`/project/${projectId}`, { replace: true });
+        navigate(``, { replace: true });
       },
     },

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:408:8
           </Button>
         </Modal.Footer>
       </Modal>
-      {!entry ? (
+      {entry ? (
         <div data-testid={`${testId}-loading`}>Citation: Loading...</div>
       ) : (
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Cannot read properties of null (reading 'id')

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:409:27
         </Modal.Footer>
       </Modal>
       {!entry ? (
-        <div data-testid={`${testId}-loading`}>Citation: Loading...</div>
+        <div data-testid={``}>Citation: Loading...</div>
       ) : (
         <div className="border rounded-3 p-4 mb-4">
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:434:32
             projectId={projectId}
             citeKey={entry.citeKey}
             keyValuePairs={entry.keyValuePairs}
-            mutationQueryKeys={[citationsQueryKey]}
+            mutationQueryKeys={[]}
           />
           <BulkReferenceUploadModal

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:442:32
             projectId={projectId}
             citeKey={entry.citeKey}
             keyValuePairs={entry.keyValuePairs}
-            mutationQueryKeys={[referencesQueryKey]}
+            mutationQueryKeys={[]}
           />
           <BibTexEntryModal

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:457:21
             projectId={projectId}
             entry={entry}
             mutationQueryKeys={[entryQueryKey]}
-            testId={`${testId}-AbstractEditModal`}
+            testId={``}
           />
           <div className="d-flex justify-content-between align-items-start mb-3">
killedBy: BibTexEntryShowPage tests clicking the Abstract Edit button opens the AbstractEditModal pre-filled with the current abstract
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-AbstractEditModal-base"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:460:30
             testId={`${testId}-AbstractEditModal`}
           />
           <div className="d-flex justify-content-between align-items-start mb-3">
-            <h1 data-testid={`${testId}-title`} className="h3 fw-semibold mb-0">
+            <h1 data-testid={``} className="h3 fw-semibold mb-0">
               {entry.citeKey}
             </h1>
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:466:49
             <Button
               variant="danger"
               size="sm"
-              onClick={() => setShowDeleteModal(true)}
+              onClick={() => setShowDeleteModal(false)}
               data-testid={`${testId}-delete-button`}
             >
killedBy: BibTexEntryShowPage tests shows a Delete button flush right at the top that opens a confirmation modal
statusReason: Unable to find an element with the text: Permanently delete this entry?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:466:24
             <Button
               variant="danger"
               size="sm"
-              onClick={() => setShowDeleteModal(true)}
+              onClick={() => undefined}
               data-testid={`${testId}-delete-button`}
             >
killedBy: BibTexEntryShowPage tests shows a Delete button flush right at the top that opens a confirmation modal
statusReason: Unable to find an element with the text: Permanently delete this entry?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:467:28
               variant="danger"
               size="sm"
               onClick={() => setShowDeleteModal(true)}
-              data-testid={`${testId}-delete-button`}
+              data-testid={``}
             >
               Delete
killedBy: BibTexEntryShowPage tests shows a Delete button flush right at the top that opens a confirmation modal
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-delete-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:482:25
             <TagSelector
               allTags={allTags}
               assignedTags={assignedTags}
-              onAddTag={(tag) => addTagMutation.mutate(tag)}
+              onAddTag={() => undefined}
               onRemoveTag={(tag) => removeTagMutation.mutate(tag)}
               projectId={projectId}
killedBy: BibTexEntryShowPage tests clicking a tag in the Add Tag dropdown POSTs to associate it and refetches the entry
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:483:28
               allTags={allTags}
               assignedTags={assignedTags}
               onAddTag={(tag) => addTagMutation.mutate(tag)}
-              onRemoveTag={(tag) => removeTagMutation.mutate(tag)}
+              onRemoveTag={() => undefined}
               projectId={projectId}
               testId={`${testId}-TagSelector`}
killedBy: BibTexEntryShowPage tests clicking the remove button on an assigned tag DELETEs to remove it and refetches the entry
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:489:59
             />
           </div>
 
-          <Form.Group className="mb-3" style={{ maxWidth: "200px" }}>
+          <Form.Group className="mb-3" style={{ maxWidth: "" }}>
             <Form.Label htmlFor={`${testId}-relevance-select`}>
               Relevance

[Survived] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:489:47
             />
           </div>
 
-          <Form.Group className="mb-3" style={{ maxWidth: "200px" }}>
+          <Form.Group className="mb-3" style={{}}>
             <Form.Label htmlFor={`${testId}-relevance-select`}>
               Relevance

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:495:28
             </Form.Label>
             <Form.Select
               id={`${testId}-relevance-select`}
-              data-testid={`${testId}-relevance-select`}
+              data-testid={``}
               value={relevance}
               onChange={(e) => updateRelevanceMutation.mutate(e.target.value)}
killedBy: BibTexEntryShowPage tests shows a Relevance dropdown defaulting to Unreviewed when no relevance field is present
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-relevance-select"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:497:25
               id={`${testId}-relevance-select`}
               data-testid={`${testId}-relevance-select`}
               value={relevance}
-              onChange={(e) => updateRelevanceMutation.mutate(e.target.value)}
+              onChange={() => undefined}
             >
               {RELEVANCE_OPTIONS.map((option) => (
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:499:38
               value={relevance}
               onChange={(e) => updateRelevanceMutation.mutate(e.target.value)}
             >
-              {RELEVANCE_OPTIONS.map((option) => (
-                <option
-                  key={option}
-                  value={option}
-                  className={relevanceClassName(option)}
-                >
-                  {option}
-                </option>
-              ))}
+              {RELEVANCE_OPTIONS.map(() => undefined)}
             </Form.Select>
           </Form.Group>
killedBy: BibTexEntryShowPage tests shows a Relevance dropdown defaulting to Unreviewed when no relevance field is present
statusReason: expect(element).toHaveValue(Unreviewed)

Expected the element to have value:
  Unreviewed
Received:
  undefined

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:530:28
                 }
               >
                 <Button
-                  onClick={() => getReferencesMutation.mutate({})}
+                  onClick={() => undefined}
                   data-testid={`${testId}-get-references-button`}
                 >
killedBy: BibTexEntryShowPage tests clicking Get References launches the job and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:539:32
               <OverlayTrigger
                 placement="top"
                 overlay={
-                  <Tooltip id={`${testId}-get-citations-tooltip`}>
+                  <Tooltip id={``}>
                     Get all papers that cite this paper
                   </Tooltip>

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:545:28
                 }
               >
                 <Button
-                  onClick={() => getCitationsMutation.mutate({})}
+                  onClick={() => undefined}
                   data-testid={`${testId}-get-citations-button`}
                 >
killedBy: BibTexEntryShowPage tests clicking Get Citations launches the job and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:553:26
               </OverlayTrigger>
               <Button
                 variant="outline-primary"
-                onClick={() => setShowAddReferenceModal(true)}
+                onClick={() => undefined}
                 data-testid={`${testId}-add-reference-button`}
               >
killedBy: BibTexEntryShowPage tests clicking Add Reference opens the modal, and submitting posts with relationship=reference
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
