[Killed] BlockStatement
main/pages/Auth/AccessDeniedPage.tsx:5:63
 import { useNavigate } from "react-router";
 import { Button } from "react-bootstrap";
 
-export default function AccessDeniedPage(): React.JSX.Element {
-  const navigate = useNavigate();
-
-  return (
-    <BasicLayout>
-      <h2>You do not have access to this page.</h2>
-      <Button onClick={() => navigate("/")}>Return</Button>
-    </BasicLayout>
-  );
-}
+export default function AccessDeniedPage(): React.JSX.Element {}
 
killedBy: AccessDeniedPage tests Access Denied Page static checks
statusReason: Unable to find an element with the text: /You do not have access to this page/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/pages/Auth/AccessDeniedPage.tsx:11:24
   return (
     <BasicLayout>
       <h2>You do not have access to this page.</h2>
-      <Button onClick={() => navigate("/")}>Return</Button>
+      <Button onClick={() => undefined}>Return</Button>
     </BasicLayout>
   );
killedBy: AccessDeniedPage tests Clicking navigates to home page
statusReason: expected "vi.fn()" to be called with arguments: [ '/' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
