[Killed] BlockStatement
main/pages/Auth/LoadingPage.tsx:3:58
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function LoadingPage(): React.JSX.Element {
-  return (
-    <div data-testid={"LoadingPage-main-div"}>
-      <BasicLayout>{null}</BasicLayout>
-    </div>
-  );
-}
+export default function LoadingPage(): React.JSX.Element {}
 
killedBy: ProtectedPage tests Renders blank on initialData
statusReason: Unable to find an element by: [data-testid="LoadingPage-main-div"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
