[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:553:57
               </OverlayTrigger>
               <Button
                 variant="outline-primary"
-                onClick={() => setShowAddReferenceModal(true)}
+                onClick={() => setShowAddReferenceModal(false)}
                 data-testid={`${testId}-add-reference-button`}
               >
killedBy: BibTexEntryShowPage tests clicking Add Reference opens the modal, and submitting posts with relationship=reference
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:560:26
               </Button>
               <Button
                 variant="outline-primary"
-                onClick={() => setShowAddCitationModal(true)}
+                onClick={() => undefined}
                 data-testid={`${testId}-add-citation-button`}
               >
killedBy: BibTexEntryShowPage tests clicking Add Citation opens the modal, and submitting posts with relationship=citation
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-base"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:560:56
               </Button>
               <Button
                 variant="outline-primary"
-                onClick={() => setShowAddCitationModal(true)}
+                onClick={() => setShowAddCitationModal(false)}
                 data-testid={`${testId}-add-citation-button`}
               >
killedBy: BibTexEntryShowPage tests clicking Add Citation opens the modal, and submitting posts with relationship=citation
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:572:26
             <div className="d-flex gap-2">
               <Button
                 variant="outline-primary"
-                onClick={() => setShowBulkReferenceUploadModal(true)}
+                onClick={() => undefined}
                 data-testid={`${testId}-bulk-reference-upload-button`}
               >
killedBy: BibTexEntryShowPage tests clicking Bulk References from ACM DL opens the modal, and submitting launches the job with the current entry's citeKey
statusReason: Unable to find an element by: [data-testid="BulkReferenceUploadModal-base"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:572:64
             <div className="d-flex gap-2">
               <Button
                 variant="outline-primary"
-                onClick={() => setShowBulkReferenceUploadModal(true)}
+                onClick={() => setShowBulkReferenceUploadModal(false)}
                 data-testid={`${testId}-bulk-reference-upload-button`}
               >
killedBy: BibTexEntryShowPage tests clicking Bulk References from ACM DL opens the modal, and submitting launches the job with the current entry's citeKey
statusReason: Unable to find an element by: [data-testid="BulkReferenceUploadModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:579:26
               </Button>
               <Button
                 variant="outline-primary"
-                onClick={() => setShowBulkCitationUploadModal(true)}
+                onClick={() => undefined}
                 data-testid={`${testId}-bulk-citation-upload-button`}
               >
killedBy: BibTexEntryShowPage tests clicking Bulk Citations from ACM DL View All opens the modal, and submitting launches the job with the current entry's citeKey
statusReason: Unable to find an element by: [data-testid="BulkCitationUploadModal-base"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:579:63
               </Button>
               <Button
                 variant="outline-primary"
-                onClick={() => setShowBulkCitationUploadModal(true)}
+                onClick={() => setShowBulkCitationUploadModal(false)}
                 data-testid={`${testId}-bulk-citation-upload-button`}
               >
killedBy: BibTexEntryShowPage tests clicking Bulk Citations from ACM DL View All opens the modal, and submitting launches the job with the current entry's citeKey
statusReason: Unable to find an element by: [data-testid="BulkCitationUploadModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:601:51
               <Button
                 variant="secondary"
                 autoFocus
-                onClick={() => setShowDeleteModal(false)}
+                onClick={() => setShowDeleteModal(true)}
                 data-testid={`${testId}-delete-modal-cancel-button`}
               >
killedBy: BibTexEntryShowPage tests clicking No, Retain closes the confirmation modal without deleting
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-body"
>
  Permanently delete this entry?
</div> instead

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:601:26
               <Button
                 variant="secondary"
                 autoFocus
-                onClick={() => setShowDeleteModal(false)}
+                onClick={() => undefined}
                 data-testid={`${testId}-delete-modal-cancel-button`}
               >
killedBy: BibTexEntryShowPage tests clicking No, Retain closes the confirmation modal without deleting
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-body"
>
  Permanently delete this entry?
</div> instead

[Killed] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:608:32
               </Button>
               <Button
                 variant="danger"
-                onClick={() => {
-                  setShowDeleteModal(false);
-                  deleteMutation.mutate({});
-                }}
+                onClick={() => {}}
                 data-testid={`${testId}-delete-modal-confirm-button`}
               >
killedBy: BibTexEntryShowPage tests clicking Yes, Delete deletes the entry and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Survived] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:609:38
               <Button
                 variant="danger"
                 onClick={() => {
-                  setShowDeleteModal(false);
+                  setShowDeleteModal(true);
                   deleteMutation.mutate({});
                 }}

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:612:30
                   setShowDeleteModal(false);
                   deleteMutation.mutate({});
                 }}
-                data-testid={`${testId}-delete-modal-confirm-button`}
+                data-testid={``}
               >
                 Yes, Delete
killedBy: BibTexEntryShowPage tests shows a Delete button flush right at the top that opens a confirmation modal
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-delete-modal-confirm-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:621:23
 
           {hasPossibleDuplicateFlag(entry) && (
             <CollapsibleCard
-              testId={`${testId}-PossibleDuplicatesCard`}
+              testId={``}
               header="Possible Duplicates"
               headerStyle={{ backgroundColor: POSSIBLE_DUPLICATE_HEADER_COLOR }}
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-PossibleDuplicatesCard-header"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:625:67
               header="Possible Duplicates"
               headerStyle={{ backgroundColor: POSSIBLE_DUPLICATE_HEADER_COLOR }}
               isOpen={showPossibleDuplicates}
-              onToggle={() => setShowPossibleDuplicates((prev) => !prev)}
+              onToggle={() => setShowPossibleDuplicates((prev) => prev)}
             >
               {(entry.possibleDuplicateIds ?? []).map((duplicateId) => (
killedBy: BibTexEntryShowPage tests the Possible Duplicates card can be collapsed like the other cards
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:625:25
               header="Possible Duplicates"
               headerStyle={{ backgroundColor: POSSIBLE_DUPLICATE_HEADER_COLOR }}
               isOpen={showPossibleDuplicates}
-              onToggle={() => setShowPossibleDuplicates((prev) => !prev)}
+              onToggle={() => undefined}
             >
               {(entry.possibleDuplicateIds ?? []).map((duplicateId) => (
killedBy: BibTexEntryShowPage tests the Possible Duplicates card can be collapsed like the other cards
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:627:55
               isOpen={showPossibleDuplicates}
               onToggle={() => setShowPossibleDuplicates((prev) => !prev)}
             >
-              {(entry.possibleDuplicateIds ?? []).map((duplicateId) => (
-                <div
-                  key={duplicateId}
-                  className="mb-3"
-                  data-testid={`${testId}-PossibleDuplicatesCard-item-${duplicateId}`}
-                >
-                  <div className="fw-semibold">Possible duplicate:</div>
-                  <PossibleDuplicateCitation
-                    projectId={projectId}
-                    duplicateId={duplicateId}
-                    testId={`${testId}-PossibleDuplicatesCard-citation-${duplicateId}`}
-                  />
-                  <div
-                    data-testid={`${testId}-PossibleDuplicatesCard-reason-${duplicateId}`}
-                  >
-                    Reason:{" "}
-                    {formatDuplicateReason(entry.possibleDuplicateReason)}
-                  </div>
-                </div>
-              ))}
+              {(entry.possibleDuplicateIds ?? []).map(() => undefined)}
             </CollapsibleCard>
           )}
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-PossibleDuplicatesCard-item-64f1b2c3d4e5f6a7b8c9d0e9"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Projects/BibTexEntryShowPage.jsx:627:17
               isOpen={showPossibleDuplicates}
               onToggle={() => setShowPossibleDuplicates((prev) => !prev)}
             >
-              {(entry.possibleDuplicateIds ?? []).map((duplicateId) => (
+              {(entry.possibleDuplicateIds && []).map((duplicateId) => (
                 <div
                   key={duplicateId}
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-PossibleDuplicatesCard-item-64f1b2c3d4e5f6a7b8c9d0e9"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:658:30
             <Card.Body>
               <div
                 className="fw-semibold mb-2"
-                data-testid={`${testId}-formatted-citation-label`}
+                data-testid={``}
               >
                 Formatted Citation ({project?.citationFormat ?? "Loading..."})
killedBy: BibTexEntryShowPage tests shows a Formatted Reference card with the project's citation format and the formatted citation
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-formatted-citation-label"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Projects/BibTexEntryShowPage.jsx:660:38
                 className="fw-semibold mb-2"
                 data-testid={`${testId}-formatted-citation-label`}
               >
-                Formatted Citation ({project?.citationFormat ?? "Loading..."})
+                Formatted Citation ({project?.citationFormat && "Loading..."})
               </div>
               <div data-testid={`${testId}-formatted-citation`}>
killedBy: BibTexEntryShowPage tests shows a Formatted Reference card with the project's citation format and the formatted citation
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Formatted Citation (ACM)
Received:
  Formatted Citation (Loading...)

[Killed] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:660:38
                 className="fw-semibold mb-2"
                 data-testid={`${testId}-formatted-citation-label`}
               >
-                Formatted Citation ({project?.citationFormat ?? "Loading..."})
+                Formatted Citation ({project.citationFormat ?? "Loading..."})
               </div>
               <div data-testid={`${testId}-formatted-citation`}>
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:669:21
           </Card>
 
           <CollapsibleCard
-            testId={`${testId}-AbstractCard`}
+            testId={``}
             header={`Abstract (${abstractWordCount} words)`}
             headerActions={
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-AbstractCard-header"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:675:57
               <Button
                 variant="outline-primary"
                 size="sm"
-                onClick={() => setShowAbstractEditModal(true)}
+                onClick={() => setShowAbstractEditModal(false)}
                 data-testid={`${testId}-abstract-edit-button`}
               >
killedBy: BibTexEntryShowPage tests clicking the Abstract Edit button opens the AbstractEditModal pre-filled with the current abstract
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-AbstractEditModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:675:26
               <Button
                 variant="outline-primary"
                 size="sm"
-                onClick={() => setShowAbstractEditModal(true)}
+                onClick={() => undefined}
                 data-testid={`${testId}-abstract-edit-button`}
               >
killedBy: BibTexEntryShowPage tests clicking the Abstract Edit button opens the AbstractEditModal pre-filled with the current abstract
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-AbstractEditModal-base"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Survived] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:682:23
               </Button>
             }
             isOpen={cardOpenState.abstract}
-            onToggle={() => toggleCard("abstract", "card_abstract")}
+            onToggle={() => undefined}
           >
             <div data-testid={`${testId}-abstract-text`}>{abstractText}</div>

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:682:40
               </Button>
             }
             isOpen={cardOpenState.abstract}
-            onToggle={() => toggleCard("abstract", "card_abstract")}
+            onToggle={() => toggleCard("", "card_abstract")}
           >
             <div data-testid={`${testId}-abstract-text`}>{abstractText}</div>

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:694:26
               <Button
                 variant="outline-primary"
                 size="sm"
-                onClick={() => setShowEditModal(true)}
+                onClick={() => undefined}
                 data-testid={`${testId}-edit-button`}
               >
killedBy: BibTexEntryShowPage tests clicking the Edit button opens the edit modal, and submitting PUTs the updated bibtex
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-base"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:694:49
               <Button
                 variant="outline-primary"
                 size="sm"
-                onClick={() => setShowEditModal(true)}
+                onClick={() => setShowEditModal(false)}
                 data-testid={`${testId}-edit-button`}
               >
killedBy: BibTexEntryShowPage tests clicking the Edit button opens the edit modal, and submitting PUTs the updated bibtex
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:695:30
                 variant="outline-primary"
                 size="sm"
                 onClick={() => setShowEditModal(true)}
-                data-testid={`${testId}-edit-button`}
+                data-testid={``}
               >
                 Edit
killedBy: BibTexEntryShowPage tests shows an Edit button in the BibTex Entry card header formatted like the CitationTable's Edit button
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-edit-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:701:23
               </Button>
             }
             isOpen={cardOpenState.bibtex}
-            onToggle={() => toggleCard("bibtex", "card_bibtex")}
+            onToggle={() => undefined}
           >
             <pre
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:701:40
               </Button>
             }
             isOpen={cardOpenState.bibtex}
-            onToggle={() => toggleCard("bibtex", "card_bibtex")}
+            onToggle={() => toggleCard("", "card_bibtex")}
           >
             <pre
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:712:21
           </CollapsibleCard>
 
           <CollapsibleCard
-            testId={`${testId}-CommentsCard`}
+            testId={``}
             header="Comments"
             isOpen={cardOpenState.comments}
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-CommentsCard-header"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:715:23
             testId={`${testId}-CommentsCard`}
             header="Comments"
             isOpen={cardOpenState.comments}
-            onToggle={() => toggleCard("comments", "card_comments")}
+            onToggle={() => undefined}
           >
             <BibTexEntryComments
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:715:52
             testId={`${testId}-CommentsCard`}
             header="Comments"
             isOpen={cardOpenState.comments}
-            onToggle={() => toggleCard("comments", "card_comments")}
+            onToggle={() => toggleCard("comments", "")}
           >
             <BibTexEntryComments
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expected '@article{smith2020,\n  title = {A Ver…' to contain 'CITELINES_card_comments = {Open}'

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:720:23
             <BibTexEntryComments
               entry={entry}
               projectId={projectId}
-              testId={`${testId}-BibTexEntryComments`}
+              testId={``}
             />
           </CollapsibleCard>
killedBy: BibTexEntryShowPage tests wires up a working BibtexEntryComments instance inside the Comments card
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-BibTexEntryComments-base"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:727:34
           <CollapsibleCard
             testId={`${testId}-ReferencesCard`}
             header={
-              <span data-testid={`${testId}-references-heading`}>
+              <span data-testid={``}>
                 References ({references.length})
                 {unresolvedReferencesCount > 0 && (
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-references-heading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] EqualityOperator
main/pages/Projects/BibTexEntryShowPage.jsx:729:18
             header={
               <span data-testid={`${testId}-references-heading`}>
                 References ({references.length})
-                {unresolvedReferencesCount > 0 && (
+                {unresolvedReferencesCount <= 0 && (
                   <OverlayTrigger
                     placement="top"
killedBy: BibTexEntryShowPage tests shows no unresolved badge when there are no unresolved citations
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-warning ms-2"
  data-testid="BibTexEntryShowPage-references-unresolved-badge"
>
  — 
  0

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:729:18
             header={
               <span data-testid={`${testId}-references-heading`}>
                 References ({references.length})
-                {unresolvedReferencesCount > 0 && (
-                  <OverlayTrigger
-                    placement="top"
-                    overlay={
-                      <Tooltip id={`${testId}-references-unresolved-tooltip`}>
-                        {UNRESOLVED_COUNT_TOOLTIP}
-                      </Tooltip>
-                    }
-                  >
-                    <span
-                      className="text-warning ms-2"
-                      data-testid={`${testId}-references-unresolved-badge`}
-                    >
-                      — {unresolvedReferencesCount} unresolved
-                    </span>
-                  </OverlayTrigger>
-                )}
+                {true}
               </span>
             }
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-references-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:749:23
               </span>
             }
             isOpen={cardOpenState.references}
-            onToggle={() => toggleCard("references", "card_references")}
+            onToggle={() => undefined}
           >
             <CitationTable

[NoCoverage] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:749:54
               </span>
             }
             isOpen={cardOpenState.references}
-            onToggle={() => toggleCard("references", "card_references")}
+            onToggle={() => toggleCard("references", "")}
           >
             <CitationTable

[Killed] EqualityOperator
main/pages/Projects/BibTexEntryShowPage.jsx:765:18
             header={
               <span data-testid={`${testId}-citations-heading`}>
                 Citations ({citations.length})
-                {unresolvedCitationsCount > 0 && (
+                {unresolvedCitationsCount >= 0 && (
                   <OverlayTrigger
                     placement="top"
killedBy: BibTexEntryShowPage tests shows no unresolved badge when there are no unresolved citations
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-warning ms-2"
  data-testid="BibTexEntryShowPage-citations-unresolved-badge"
>
  — 
  0

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:765:18
             header={
               <span data-testid={`${testId}-citations-heading`}>
                 Citations ({citations.length})
-                {unresolvedCitationsCount > 0 && (
-                  <OverlayTrigger
-                    placement="top"
-                    overlay={
-                      <Tooltip id={`${testId}-citations-unresolved-tooltip`}>
-                        {UNRESOLVED_COUNT_TOOLTIP}
-                      </Tooltip>
-                    }
-                  >
-                    <span
-                      className="text-warning ms-2"
-                      data-testid={`${testId}-citations-unresolved-badge`}
-                    >
-                      — {unresolvedCitationsCount} unresolved
-                    </span>
-                  </OverlayTrigger>
-                )}
+                {false}
               </span>
             }
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-citations-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:769:36
                   <OverlayTrigger
                     placement="top"
                     overlay={
-                      <Tooltip id={`${testId}-citations-unresolved-tooltip`}>
+                      <Tooltip id={``}>
                         {UNRESOLVED_COUNT_TOOLTIP}
                       </Tooltip>

[Survived] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:785:23
               </span>
             }
             isOpen={cardOpenState.citations}
-            onToggle={() => toggleCard("citations", "card_citations")}
+            onToggle={() => undefined}
           >
             <CitationTable

[NoCoverage] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:785:53
               </span>
             }
             isOpen={cardOpenState.citations}
-            onToggle={() => toggleCard("citations", "card_citations")}
+            onToggle={() => toggleCard("citations", "")}
           >
             <CitationTable
