[Killed] BlockStatement
main/pages/Auth/NotFoundPage.tsx:5:59
 import { useNavigate } from "react-router";
 import { Button } from "react-bootstrap";
 
-export default function NotFoundPage(): React.JSX.Element {
-  const navigate = useNavigate();
-
-  return (
-    <BasicLayout>
-      <h1>Page Not Found</h1>
-      <p>Let&apos;s get you back on track.</p>
-      <Button onClick={() => navigate("/")}>Click to Return Home</Button>
-    </BasicLayout>
-  );
-}
+export default function NotFoundPage(): React.JSX.Element {}
 
killedBy: NotFoundPage tests Not Found Page static checks
statusReason: Unable to find an element with the text: /Page Not Found/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] ArrowFunction
main/pages/Auth/NotFoundPage.tsx:12:24
     <BasicLayout>
       <h1>Page Not Found</h1>
       <p>Let&apos;s get you back on track.</p>
-      <Button onClick={() => navigate("/")}>Click to Return Home</Button>
+      <Button onClick={() => undefined}>Click to Return Home</Button>
     </BasicLayout>
   );
