[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:800:55
             testId={`${testId}-RawEntryCard`}
             header="Raw BibTeX (debug)"
             isOpen={showRawEntry}
-            onToggle={() => setShowRawEntry((prev) => !prev)}
+            onToggle={() => setShowRawEntry((prev) => prev)}
           >
             <pre
killedBy: BibTexEntryShowPage tests opening the Raw BibTeX (debug) card shows the full entry as JSON, including fields not shown elsewhere on the page
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

Ignored nodes: comments, script, style

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:800:45
             testId={`${testId}-RawEntryCard`}
             header="Raw BibTeX (debug)"
             isOpen={showRawEntry}
-            onToggle={() => setShowRawEntry((prev) => !prev)}
+            onToggle={() => setShowRawEntry(() => undefined)}
           >
             <pre
killedBy: BibTexEntryShowPage tests opening the Raw BibTeX (debug) card shows the full entry as JSON, including fields not shown elsewhere on the page
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  null

Ignored nodes: comments, script, style
