[Killed] StringLiteral
src/main/utils/relevance.js:12:9
   High: "relevance-high",
   Medium: "relevance-medium",
   Low: "relevance-low",
-  None: "relevance-none",
+  None: "",
   Unreviewed: "relevance-unreviewed",
 };
killedBy: BibTexEntryShowPage tests colors each Relevance dropdown option per issue #54's central relevance CSS classes
statusReason: expect(element).toHaveClass("relevance-none")

Expected the element to have class:
  relevance-none
Received:

[Killed] StringLiteral
src/main/utils/relevance.js:13:15
   Medium: "relevance-medium",
   Low: "relevance-low",
   None: "relevance-none",
-  Unreviewed: "relevance-unreviewed",
+  Unreviewed: "",
 };
 
killedBy: CitationTable tests the Relevance column shows the level's label and color class, defaulting to (unreviewed)
statusReason: expect(element).toHaveClass("relevance-badge relevance-unreviewed")

Expected the element to have class:
  relevance-badge relevance-unreviewed
Received:
  relevance-badge

[Killed] BlockStatement
src/main/utils/relevance.js:18:42
 
 // A numeric rank (4 for High, down to 0 for Unreviewed) so a table column can sort by relevance
 // in priority order rather than alphabetically.
-export function relevanceRank(relevance) {
-  return RELEVANCE_RANKS[relevance] ?? RELEVANCE_RANKS[DEFAULT_RELEVANCE];
-}
+export function relevanceRank(relevance) {}
 
 export function relevanceClassName(relevance) {
killedBy: CitationTable tests clicking the Relevance column header sorts by priority, not alphabetically
statusReason: expected [ 'lee2021', 'jones201...', …(1) ] to deeply equal [ 'smith202...', 'jones201...', …(1) ]

[Killed] LogicalOperator
src/main/utils/relevance.js:19:10
 // A numeric rank (4 for High, down to 0 for Unreviewed) so a table column can sort by relevance
 // in priority order rather than alphabetically.
 export function relevanceRank(relevance) {
-  return RELEVANCE_RANKS[relevance] ?? RELEVANCE_RANKS[DEFAULT_RELEVANCE];
+  return RELEVANCE_RANKS[relevance] && RELEVANCE_RANKS[DEFAULT_RELEVANCE];
 }
 
killedBy: CitationTable tests clicking the Relevance column header sorts by priority, not alphabetically
statusReason: expected [ 'lee2021', 'jones201...', …(1) ] to deeply equal [ 'smith202...', 'jones201...', …(1) ]

[Killed] BlockStatement
src/main/utils/relevance.js:22:47
   return RELEVANCE_RANKS[relevance] ?? RELEVANCE_RANKS[DEFAULT_RELEVANCE];
 }
 
-export function relevanceClassName(relevance) {
-  return (
-    RELEVANCE_CLASS_NAMES[relevance] ?? RELEVANCE_CLASS_NAMES[DEFAULT_RELEVANCE]
-  );
-}
+export function relevanceClassName(relevance) {}
 
 // "Unreviewed" displays as "(unreviewed)"; every other level displays as-is.
killedBy: CitationTable tests the Relevance column shows the level's label and color class, defaulting to (unreviewed)
statusReason: expect(element).toHaveClass("relevance-badge relevance-high")

Expected the element to have class:
  relevance-badge relevance-high
Received:
  relevance-badge undefined

[Killed] LogicalOperator
src/main/utils/relevance.js:24:5
 
 export function relevanceClassName(relevance) {
   return (
-    RELEVANCE_CLASS_NAMES[relevance] ?? RELEVANCE_CLASS_NAMES[DEFAULT_RELEVANCE]
+    RELEVANCE_CLASS_NAMES[relevance] && RELEVANCE_CLASS_NAMES[DEFAULT_RELEVANCE]
   );
 }
killedBy: BibTexEntryShowPage tests colors each Relevance dropdown option per issue #54's central relevance CSS classes
statusReason: expect(element).toHaveClass("relevance-high")

Expected the element to have class:
  relevance-high
Received:
  relevance-unreviewed

[Killed] BlockStatement
src/main/utils/relevance.js:29:43
 }
 
 // "Unreviewed" displays as "(unreviewed)"; every other level displays as-is.
-export function relevanceLabel(relevance) {
-  return relevance === "Unreviewed" ? "(unreviewed)" : relevance;
-}
+export function relevanceLabel(relevance) {}
 
killedBy: CitationTable tests the Relevance column shows the level's label and color class, defaulting to (unreviewed)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  High
Received:

[Killed] ConditionalExpression
src/main/utils/relevance.js:30:10
 
 // "Unreviewed" displays as "(unreviewed)"; every other level displays as-is.
 export function relevanceLabel(relevance) {
-  return relevance === "Unreviewed" ? "(unreviewed)" : relevance;
+  return false ? "(unreviewed)" : relevance;
 }
 
killedBy: CitationTable tests the Relevance column shows the level's label and color class, defaulting to (unreviewed)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  (unreviewed)
Received:
  Unreviewed

[Killed] EqualityOperator
src/main/utils/relevance.js:30:10
 
 // "Unreviewed" displays as "(unreviewed)"; every other level displays as-is.
 export function relevanceLabel(relevance) {
-  return relevance === "Unreviewed" ? "(unreviewed)" : relevance;
+  return relevance !== "Unreviewed" ? "(unreviewed)" : relevance;
 }
 
killedBy: CitationTable tests the Relevance column shows the level's label and color class, defaulting to (unreviewed)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  High
Received:
  (unreviewed)
