[Killed] BlockStatement
main/pages/Auth/ProtectedPage.tsx:17:43
   component,
   currentUser,
   enforceRole,
-}: ProtectedPageProps): React.JSX.Element {
-  if (currentUser.initialData) {
-    return <LoadingPage />;
-  }
-  if (hasRole(currentUser, enforceRole)) {
-    return <>{component}</>;
-  } else if (!currentUser.loggedIn) {
-    return <PromptSignInPage />;
-  } else {
-    return <AccessDeniedPage />;
-  }
-}
+}: ProtectedPageProps): React.JSX.Element {}
 
killedBy: ProtectedPage tests Renders blank on initialData
statusReason: Unable to find an element by: [data-testid="LoadingPage-main-div"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
main/pages/Auth/ProtectedPage.tsx:18:7
   currentUser,
   enforceRole,
 }: ProtectedPageProps): React.JSX.Element {
-  if (currentUser.initialData) {
+  if (true) {
     return <LoadingPage />;
   }
killedBy: ProtectedPage tests Renders AccessDenied on missing role
statusReason: Unable to find an element with the text: You do not have access to this page.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="LoadingPage-main-div"
    >

[Killed] ConditionalExpression
main/pages/Auth/ProtectedPage.tsx:18:7
   currentUser,
   enforceRole,
 }: ProtectedPageProps): React.JSX.Element {
-  if (currentUser.initialData) {
+  if (false) {
     return <LoadingPage />;
   }
killedBy: ProtectedPage tests Renders blank on initialData
statusReason: Unable to find an element by: [data-testid="LoadingPage-main-div"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Auth/ProtectedPage.tsx:21:7
   if (currentUser.initialData) {
     return <LoadingPage />;
   }
-  if (hasRole(currentUser, enforceRole)) {
+  if (true) {
     return <>{component}</>;
   } else if (!currentUser.loggedIn) {
killedBy: ProtectedPage tests Renders AccessDenied on missing role
statusReason: Unable to find an element with the text: You do not have access to this page.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/pages/Auth/ProtectedPage.tsx:21:42
   if (currentUser.initialData) {
     return <LoadingPage />;
   }
-  if (hasRole(currentUser, enforceRole)) {
-    return <>{component}</>;
-  } else if (!currentUser.loggedIn) {
+  if (hasRole(currentUser, enforceRole)) {} else if (!currentUser.loggedIn) {
     return <PromptSignInPage />;
   } else {
killedBy: ProtectedPage tests Renders ProtectedPage on correct role
statusReason: Unable to find an element with the text: Renders successfully.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/pages/Auth/ProtectedPage.tsx:23:14
   }
   if (hasRole(currentUser, enforceRole)) {
     return <>{component}</>;
-  } else if (!currentUser.loggedIn) {
+  } else if (false) {
     return <PromptSignInPage />;
   } else {
killedBy: ProtectedPage tests Renders PromptSignInPage on no user
statusReason: Unable to find an element with the text: Please sign in before accessing this page.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Auth/ProtectedPage.tsx:23:14
   }
   if (hasRole(currentUser, enforceRole)) {
     return <>{component}</>;
-  } else if (!currentUser.loggedIn) {
+  } else if (true) {
     return <PromptSignInPage />;
   } else {
killedBy: ProtectedPage tests Renders AccessDenied on missing role
statusReason: Unable to find an element with the text: You do not have access to this page.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BlockStatement
main/pages/Auth/ProtectedPage.tsx:25:10
     return <>{component}</>;
   } else if (!currentUser.loggedIn) {
     return <PromptSignInPage />;
-  } else {
-    return <AccessDeniedPage />;
-  }
+  } else {}
 }
 
killedBy: ProtectedPage tests Renders AccessDenied on missing role
statusReason: Unable to find an element with the text: You do not have access to this page.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
