[Killed] StringLiteral
src/main/utils/citationFilter.js:21:3
   "all",
   "doi",
   "url",
-  "invalid",
+  "",
   "missing",
 ];
killedBy: citationFilter constants CITATION_FILTER_LINK_OPTIONS and CITATION_FILTER_DUPLICATE_OPTIONS have the expected values
statusReason: expected [ 'all', 'doi', 'url', '', 'missing' ] to deeply equal [ Array(5) ]

[Killed] StringLiteral
src/main/utils/citationFilter.js:25:51
   "missing",
 ];
 
-export const CITATION_FILTER_DUPLICATE_OPTIONS = ["all", "dup", "no-dup"];
+export const CITATION_FILTER_DUPLICATE_OPTIONS = ["", "dup", "no-dup"];
 
 // Nothing filtered out by default — every toggle/radio starts in its most permissive state.
killedBy: citationFilter constants CITATION_FILTER_LINK_OPTIONS and CITATION_FILTER_DUPLICATE_OPTIONS have the expected values
statusReason: expected [ '', 'dup', 'no-dup' ] to deeply equal [ 'all', 'dup', 'no-dup' ]

[Killed] ArrayDeclaration
src/main/utils/citationFilter.js:29:14
 
 // Nothing filtered out by default — every toggle/radio starts in its most permissive state.
 export const DEFAULT_CITATION_FILTER = {
-  relevance: [...RELEVANCE_OPTIONS],
+  relevance: [],
   link: "all",
   duplicates: "all",
killedBy: citationFilter constants DEFAULT_CITATION_FILTER starts fully permissive (nothing filtered out)
statusReason: expected [] to deeply equal [ 'High', 'Medium', 'Low', …(2) ]

[Killed] StringLiteral
src/main/utils/citationFilter.js:30:9
 // Nothing filtered out by default — every toggle/radio starts in its most permissive state.
 export const DEFAULT_CITATION_FILTER = {
   relevance: [...RELEVANCE_OPTIONS],
-  link: "all",
+  link: "",
   duplicates: "all",
   search: "",
killedBy: citationFilter constants DEFAULT_CITATION_FILTER starts fully permissive (nothing filtered out)
statusReason: expected '' to be 'all' // Object.is equality

[Killed] StringLiteral
src/main/utils/citationFilter.js:34:12
   duplicates: "all",
   search: "",
   tagIds: [],
-  tagMode: "or",
+  tagMode: "",
 };
 
killedBy: citationFilter constants DEFAULT_CITATION_FILTER starts fully permissive (nothing filtered out)
statusReason: expected '' to be 'or' // Object.is equality

[Killed] BlockStatement
src/main/utils/citationFilter.js:43:42
 // (BibTexConverterService.toBibTexEntry) lowercases every field name, so the key actually
 // persisted is "citelines_relevance". RELEVANCE_FIELD_NAME is the same constant
 // extractCitelinesFields uses when parsing raw BibTeX text, so both stay in sync.
-export function getEntryRelevance(entry) {
-  return entry.keyValuePairs?.[RELEVANCE_FIELD_NAME] ?? DEFAULT_RELEVANCE;
-}
+export function getEntryRelevance(entry) {}
 
 // Matches CitationTable's Link column exactly: a doi takes precedence over a url when an entry
killedBy: CitationTable tests the Relevance column shows the level's label and color class, defaulting to (unreviewed)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  High
Received:

[Killed] LogicalOperator
src/main/utils/citationFilter.js:44:10
 // persisted is "citelines_relevance". RELEVANCE_FIELD_NAME is the same constant
 // extractCitelinesFields uses when parsing raw BibTeX text, so both stay in sync.
 export function getEntryRelevance(entry) {
-  return entry.keyValuePairs?.[RELEVANCE_FIELD_NAME] ?? DEFAULT_RELEVANCE;
+  return entry.keyValuePairs?.[RELEVANCE_FIELD_NAME] && DEFAULT_RELEVANCE;
 }
 
killedBy: CitationTable tests the Relevance column shows the level's label and color class, defaulting to (unreviewed)
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  High
Received:
  (unreviewed)

[Killed] OptionalChaining
src/main/utils/citationFilter.js:44:10
 // persisted is "citelines_relevance". RELEVANCE_FIELD_NAME is the same constant
 // extractCitelinesFields uses when parsing raw BibTeX text, so both stay in sync.
 export function getEntryRelevance(entry) {
-  return entry.keyValuePairs?.[RELEVANCE_FIELD_NAME] ?? DEFAULT_RELEVANCE;
+  return entry.keyValuePairs[RELEVANCE_FIELD_NAME] ?? DEFAULT_RELEVANCE;
 }
 
killedBy: getEntryRelevance does not throw when the entry has no keyValuePairs at all
statusReason: Cannot read properties of undefined (reading 'citelines_relevance')

[Killed] ConditionalExpression
src/main/utils/citationFilter.js:57:14
     case "doi":
       return Boolean(doi) && !invalid;
     case "url":
-      return !doi && Boolean(url) && !invalid;
+      return false;
     case "invalid":
       return invalid;
killedBy: matchesCitationFilter link url matches an entry with only a url and no invalid flag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/main/utils/citationFilter.js:61:14
     case "invalid":
       return invalid;
     case "missing":
-      return !doi && !url;
+      return true;
     default:
       return true;
killedBy: matchesCitationFilter link missing matches an entry with neither a doi nor a url
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/main/utils/citationFilter.js:68:7
 }
 
 function matchesDuplicates(entry, duplicates) {
-  if (duplicates === "dup") return hasPossibleDuplicateFlag(entry);
+  if (false) return hasPossibleDuplicateFlag(entry);
   if (duplicates === "no-dup") return !hasPossibleDuplicateFlag(entry);
   return true;
killedBy: matchesCitationFilter duplicates dup matches only entries with a possible-duplicate flag
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/main/utils/citationFilter.js:69:39
 
 function matchesDuplicates(entry, duplicates) {
   if (duplicates === "dup") return hasPossibleDuplicateFlag(entry);
-  if (duplicates === "no-dup") return !hasPossibleDuplicateFlag(entry);
+  if (duplicates === "no-dup") return hasPossibleDuplicateFlag(entry);
   return true;
 }
killedBy: matchesCitationFilter duplicates no-dup matches only entries without a possible-duplicate flag
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/main/utils/citationFilter.js:78:18
 function matchesSearch(entry, search) {
   const query = search.trim().toLowerCase();
   const author = (entry.keyValuePairs?.author ?? "").toLowerCase();
-  const title = (entry.keyValuePairs?.title ?? "").toLowerCase();
+  const title = (entry.keyValuePairs?.title && "").toLowerCase();
   return author.includes(query) || title.includes(query);
 }
killedBy: matchesCitationFilter relevance matches only entries whose relevance is in the selected list
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/main/utils/citationFilter.js:79:10
   const query = search.trim().toLowerCase();
   const author = (entry.keyValuePairs?.author ?? "").toLowerCase();
   const title = (entry.keyValuePairs?.title ?? "").toLowerCase();
-  return author.includes(query) || title.includes(query);
+  return false;
 }
 
killedBy: matchesCitationFilter the default filter matches everything
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/main/utils/citationFilter.js:83:35
 }
 
 function matchesTags(entry, tagIds, tagMode) {
-  if (tagIds.length === 0) return true;
+  if (tagIds.length === 0) return false;
   const entryTagIds = new Set(entry.tagIds ?? []);
   return tagMode === "and"
killedBy: matchesCitationFilter the default filter matches everything
statusReason: expected false to be true // Object.is equality

[Survived] ArrayDeclaration
src/main/utils/citationFilter.js:84:47
 
 function matchesTags(entry, tagIds, tagMode) {
   if (tagIds.length === 0) return true;
-  const entryTagIds = new Set(entry.tagIds ?? []);
+  const entryTagIds = new Set(entry.tagIds ?? ["Stryker was here"]);
   return tagMode === "and"
     ? tagIds.every((id) => entryTagIds.has(id))

[Killed] EqualityOperator
src/main/utils/citationFilter.js:85:10
 function matchesTags(entry, tagIds, tagMode) {
   if (tagIds.length === 0) return true;
   const entryTagIds = new Set(entry.tagIds ?? []);
-  return tagMode === "and"
+  return tagMode !== "and"
     ? tagIds.every((id) => entryTagIds.has(id))
     : tagIds.some((id) => entryTagIds.has(id));
killedBy: matchesCitationFilter tags or mode matches an entry with at least one selected tag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/main/utils/citationFilter.js:93:5
 // Whether a single BibTexEntry satisfies every dimension of the given filter.
 export function matchesCitationFilter(entry, filter) {
   return (
-    filter.relevance.includes(getEntryRelevance(entry)) &&
-    matchesLink(entry, filter.link) &&
-    matchesDuplicates(entry, filter.duplicates) &&
-    matchesSearch(entry, filter.search) &&
+    true &&
     matchesTags(entry, filter.tagIds, filter.tagMode)
   );
killedBy: matchesCitationFilter relevance matches only entries whose relevance is in the selected list
statusReason: expected true to be false // Object.is equality
