[Survived] StringLiteral
src/main/utils/citelinesFields.js:50:20
 
     if (top === "quote") {
       if (ch === "{") {
-        stack.push("brace");
+        stack.push("");
       } else if (ch === '"') {
         stack.pop();

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:51:18
     if (top === "quote") {
       if (ch === "{") {
         stack.push("brace");
-      } else if (ch === '"') {
+      } else if (false) {
         stack.pop();
       }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Survived] StringLiteral
src/main/utils/citelinesFields.js:69:18
     if (ch === "{") {
       stack.push("brace");
     } else if (ch === '"') {
-      stack.push("quote");
+      stack.push("");
     } else if (ch === splitChar) {
       parts.push(text.slice(start, i));

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:70:16
       stack.push("brace");
     } else if (ch === '"') {
       stack.push("quote");
-    } else if (ch === splitChar) {
+    } else if (ch !== splitChar) {
       parts.push(text.slice(start, i));
       start = i + 1;
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:97:9
     // quote nested inside the entry's outer brace is just literal text as far as finding where
     // the entry ENDS is concerned (splitTopLevel handles quote-vs-brace nesting separately, once
     // we're splitting an already-isolated entry body into individual fields).
-    if (stack.length > 0) {
+    if (false) {
       if (ch === "{") {
         stack.push("brace");
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] BlockStatement
src/main/utils/citelinesFields.js:97:27
     // quote nested inside the entry's outer brace is just literal text as far as finding where
     // the entry ENDS is concerned (splitTopLevel handles quote-vs-brace nesting separately, once
     // we're splitting an already-isolated entry body into individual fields).
-    if (stack.length > 0) {
-      if (ch === "{") {
-        stack.push("brace");
-      } else if (ch === "}") {
-        stack.pop();
-        if (stack.length === 0) {
-          spans.push({ bodyStart, bodyEnd: i });
-          bodyStart = -1;
-        }
-      }
-      continue;
-    }
+    if (stack.length > 0) {}
 
     if (ch === "@") {
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:98:11
     // the entry ENDS is concerned (splitTopLevel handles quote-vs-brace nesting separately, once
     // we're splitting an already-isolated entry body into individual fields).
     if (stack.length > 0) {
-      if (ch === "{") {
+      if (true) {
         stack.push("brace");
       } else if (ch === "}") {
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:98:11
     // the entry ENDS is concerned (splitTopLevel handles quote-vs-brace nesting separately, once
     // we're splitting an already-isolated entry body into individual fields).
     if (stack.length > 0) {
-      if (ch === "{") {
+      if (false) {
         stack.push("brace");
       } else if (ch === "}") {
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020,\n  title = {A Tit…' to contain 'title = {A Title}'

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:102:13
         stack.push("brace");
       } else if (ch === "}") {
         stack.pop();
-        if (stack.length === 0) {
+        if (false) {
           spans.push({ bodyStart, bodyEnd: i });
           bodyStart = -1;
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020, title = {A Title}}' to contain 'CITELINES_relevance = {Unreviewed}'

[Killed] ObjectLiteral
src/main/utils/citelinesFields.js:127:10
   const [citeKeyPart, ...rest] = parts;
   // A trailing comma after the last field produces one empty trailing chunk; drop it.
   const fieldChunks = rest.filter((chunk) => chunk.trim().length > 0);
-  return { citeKeyPart, fieldChunks };
+  return {};
 }
 
killedBy: citelinesFields extractCitelinesFields returns Unreviewed and no preserved fields for a plain entry, unchanged byte-for-byte
statusReason: fieldChunks is not iterable

[Killed] MethodExpression
src/main/utils/citelinesFields.js:136:16
   if (eq === -1) {
     return null;
   }
-  const name = chunk.slice(0, eq).trim().toLowerCase();
+  const name = chunk.trim().toLowerCase();
   let value = chunk.slice(eq + 1).trim();
   if (
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] MethodExpression
src/main/utils/citelinesFields.js:137:15
     return null;
   }
   const name = chunk.slice(0, eq).trim().toLowerCase();
-  let value = chunk.slice(eq + 1).trim();
+  let value = chunk.trim();
   if (
     (value.startsWith("{") && value.endsWith("}")) ||
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] MethodExpression
src/main/utils/citelinesFields.js:139:6
   const name = chunk.slice(0, eq).trim().toLowerCase();
   let value = chunk.slice(eq + 1).trim();
   if (
-    (value.startsWith("{") && value.endsWith("}")) ||
+    (value.endsWith("{") && value.endsWith("}")) ||
     (value.startsWith('"') && value.endsWith('"'))
   ) {
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:139:6
   const name = chunk.slice(0, eq).trim().toLowerCase();
   let value = chunk.slice(eq + 1).trim();
   if (
-    (value.startsWith("{") && value.endsWith("}")) ||
+    (false) ||
     (value.startsWith('"') && value.endsWith('"'))
   ) {
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Survived] MethodExpression
src/main/utils/citelinesFields.js:140:6
   let value = chunk.slice(eq + 1).trim();
   if (
     (value.startsWith("{") && value.endsWith("}")) ||
-    (value.startsWith('"') && value.endsWith('"'))
+    (value.endsWith('"') && value.endsWith('"'))
   ) {
     value = value.slice(1, -1);

[Killed] ObjectLiteral
src/main/utils/citelinesFields.js:144:10
   ) {
     value = value.slice(1, -1);
   }
-  return { name, value };
+  return {};
 }
 
killedBy: CitationTable tests clicking Edit opens the modal pre-filled from the export endpoint
statusReason: expect(element).toHaveValue(@article{smith2020,
  title = {A Title}
}
)

Expected the element to have value:
  @article{smith2020,
    title = {A Title}

[Killed] MethodExpression
src/main/utils/citelinesFields.js:149:17
 
 function normalizeRelevance(rawValue) {
   const match = RELEVANCE_OPTIONS.find(
-    (option) => option.toLowerCase() === rawValue.trim().toLowerCase(),
+    (option) => option.toUpperCase() === rawValue.trim().toLowerCase(),
   );
   return match ?? DEFAULT_RELEVANCE;
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:149:17
 
 function normalizeRelevance(rawValue) {
   const match = RELEVANCE_OPTIONS.find(
-    (option) => option.toLowerCase() === rawValue.trim().toLowerCase(),
+    (option) => false,
   );
   return match ?? DEFAULT_RELEVANCE;
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:193:9
 
   for (const chunk of fieldChunks) {
     const field = parseFieldChunk(chunk);
-    if (!field) {
+    if (false) {
       keptChunks.push(chunk.trim());
       continue;
killedBy: citelinesFields extractCitelinesFields preserves a malformed field chunk with no '=' as-is
statusReason: Cannot read properties of null (reading 'name')

[Killed] MethodExpression
src/main/utils/citelinesFields.js:200:16
     if (field.name === RELEVANCE_FIELD_NAME) {
       relevance = normalizeRelevance(field.value);
       foundCitelinesField = true;
-    } else if (field.name.startsWith(CITELINES_PREFIX)) {
+    } else if (field.name.endsWith(CITELINES_PREFIX)) {
       preservedFields[field.name] = field.value;
       foundCitelinesField = true;
killedBy: BibTexEntryModal tests re-injects the (possibly changed) relevance and any other preserved CITELINES_ fields on submit
statusReason: expected '@article{smith2020,\n  title = "Exist…' to contain 'CITELINES_position = {3}'

[Killed] BooleanLiteral
src/main/utils/citelinesFields.js:210:7
 
   // Nothing to strip: return the original text untouched rather than a reformatted
   // (but equivalent) rebuild, so editing an entry that predates this feature causes no diff.
-  if (!foundCitelinesField) {
+  if (foundCitelinesField) {
     return { strippedBibtex: rawBibtex, relevance, preservedFields };
   }
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: expect(element).toHaveValue(@article{smith2020,
  title = {Existing}
}
)

Expected the element to have value:
  @article{smith2020,
    title = {Existing}

[Killed] ObjectLiteral
src/main/utils/citelinesFields.js:224:10
     ",\n" +
     rawBibtex.slice(bodyEnd);
 
-  return { strippedBibtex, relevance, preservedFields };
+  return {};
 }
 
killedBy: BibTexEntryModal tests when editing an entry with an existing relevance, strips it from the text and pre-fills the dropdown
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:243:7
   relevance,
   preservedFields = {},
 ) {
-  if (!rawBibtex) {
+  if (true) {
     return rawBibtex ?? "";
   }
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020, title = {A Title}}' to contain 'CITELINES_relevance = {Unreviewed}'

[Killed] StringLiteral
src/main/utils/citelinesFields.js:244:25
   preservedFields = {},
 ) {
   if (!rawBibtex) {
-    return rawBibtex ?? "";
+    return rawBibtex ?? "Stryker was here!";
   }
 
killedBy: citelinesFields injectCitelinesFields is a no-op for empty or unrecognizable input
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] StringLiteral
src/main/utils/citelinesFields.js:255:7
   const extraFields = { [RELEVANCE_FIELD_NAME]: relevance, ...preservedFields };
   const extraChunks = Object.entries(extraFields).map(
     ([name, value]) =>
-      `\n  CITELINES_${name.slice(CITELINES_PREFIX.length)} = {${value}}`,
+      ``,
   );
 
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected '@article{smith2020,\n  title = "A Ver…' to contain 'CITELINES_relevance = {Low}'

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:266:18
     const keptChunks = fieldChunks
       .filter((chunk) => {
         const field = parseFieldChunk(chunk);
-        return !(field && field.name.startsWith(CITELINES_PREFIX));
+        return !(false);
       })
       .map((chunk) => chunk.trim());
killedBy: citelinesFields injectCitelinesFields does not duplicate a CITELINES_ field the user left in the edited text
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/main/utils/citelinesFields.js:270:25
       })
       .map((chunk) => chunk.trim());
 
-    const rebuiltBody = [
-      citeKeyPart.trim(),
-      ...keptChunks.map((c) => `\n  ${c}`),
-      ...extraChunks,
-    ].join(",");
+    const rebuiltBody = [].join(",");
 
     result += rawBibtex.slice(cursor, bodyStart) + rebuiltBody + ",\n";
killedBy: citelinesFields injectCitelinesFields adds a CITELINES_relevance field to a plain entry
statusReason: expected '@article{,\n}\n' to contain 'CITELINES_relevance = {High}'

[Killed] ArithmeticOperator
src/main/utils/citelinesFields.js:276:15
       ...extraChunks,
     ].join(",");
 
-    result += rawBibtex.slice(cursor, bodyStart) + rebuiltBody + ",\n";
+    result += rawBibtex.slice(cursor, bodyStart) - rebuiltBody + ",\n";
     cursor = bodyEnd;
   }
killedBy: citelinesFields injectCitelinesFields adds a CITELINES_relevance field to a plain entry
statusReason: expected 'NaN,\n}\n' to contain 'CITELINES_relevance = {High}'
