[Killed] ArrowFunction
components/Projects/TabComponent/JobsTabComponent.jsx:41:5
   };
 
   const improveBibTexEntriesMutation = useBackendMutation(
-    () => ({
-      url: "/api/jobs/launch/improveBibTexEntries",
-      method: "POST",
-      params: { projectId, scope: "PROJECT" },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: JobsTabComponent tests clicking the Improve BibTeX Entries Start button launches the job and refetches the job list
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
components/Projects/TabComponent/JobsTabComponent.jsx:41:12
   };
 
   const improveBibTexEntriesMutation = useBackendMutation(
-    () => ({
-      url: "/api/jobs/launch/improveBibTexEntries",
-      method: "POST",
-      params: { projectId, scope: "PROJECT" },
-    }),
+    () => ({}),
     {
       onSuccess: () => {
killedBy: JobsTabComponent tests clicking the Improve BibTeX Entries Start button launches the job and refetches the job list
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] ObjectLiteral
components/Projects/TabComponent/JobsTabComponent.jsx:44:15
     () => ({
       url: "/api/jobs/launch/improveBibTexEntries",
       method: "POST",
-      params: { projectId, scope: "PROJECT" },
+      params: {},
     }),
     {

[Killed] ObjectLiteral
components/Projects/TabComponent/JobsTabComponent.jsx:46:5
       method: "POST",
       params: { projectId, scope: "PROJECT" },
     }),
-    {
-      onSuccess: () => {
-        toast(
-          "Improve BibTeX Entries job launched — check below for progress.",
-        );
-        refetch();
-      },
-    },
+    {},
   );
 
killedBy: JobsTabComponent tests clicking the Improve BibTeX Entries Start button launches the job and refetches the job list
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
components/Projects/TabComponent/JobsTabComponent.jsx:47:24
       params: { projectId, scope: "PROJECT" },
     }),
     {
-      onSuccess: () => {
-        toast(
-          "Improve BibTeX Entries job launched — check below for progress.",
-        );
-        refetch();
-      },
+      onSuccess: () => {},
     },
   );
killedBy: JobsTabComponent tests clicking the Improve BibTeX Entries Start button launches the job and refetches the job list
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
components/Projects/TabComponent/JobsTabComponent.jsx:56:50
     },
   );
 
-  const submitImproveBibTexEntries = async () => {
-    improveBibTexEntriesMutation.mutate({});
-  };
+  const submitImproveBibTexEntries = async () => {};
 
   const detectDuplicatesMutation = useBackendMutation(
killedBy: JobsTabComponent tests clicking the Improve BibTeX Entries Start button launches the job and refetches the job list
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
