[Killed] BooleanLiteral
main/components/Citations/CitationFilter.jsx:23:14
 export default function CitationFilter({
   filter = DEFAULT_CITATION_FILTER,
   onChange = () => {},
-  expanded = false,
+  expanded = true,
   onExpandedChange = () => {},
   allTags = [],
killedBy: CitationFilter tests renders closed by default, showing lowercase 'citation filters' and a ▼ toggle icon
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  citation filters
Received:
  Citation Filters▲

[Killed] ArrayDeclaration
main/components/Citations/CitationFilter.jsx:25:13
   onChange = () => {},
   expanded = false,
   onExpandedChange = () => {},
-  allTags = [],
+  allTags = ["Stryker was here"],
   testId = "CitationFilter",
 }) {
killedBy: CitationFilter tests defaults allTags to an empty list, so the Add Tag dropdown has nothing to offer
statusReason: Unable to find an element by: [data-testid="CitationFilter-no-available-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:26:12
   expanded = false,
   onExpandedChange = () => {},
   allTags = [],
-  testId = "CitationFilter",
+  testId = "",
 }) {
   const update = (patch) => onChange({ ...filter, ...patch });
killedBy: CitationFilter tests renders closed by default, showing lowercase 'citation filters' and a ▼ toggle icon
statusReason: Unable to find an element by: [data-testid="CitationFilter-header"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid=""
    >

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:28:18
   allTags = [],
   testId = "CitationFilter",
 }) {
-  const update = (patch) => onChange({ ...filter, ...patch });
+  const update = () => undefined;
 
   const toggleRelevance = (option) => {
killedBy: BibTexEntryShowPage tests filtering the References table does not affect the Citations table, and vice versa
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  data-discover="true"
  data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-1-col-citeKey-link"
  href="/project/1/bibtex/64f1b2c3d4e5f6a7b8c9d0e3"
>
  lee2021

[Killed] ObjectLiteral
main/components/Citations/CitationFilter.jsx:28:38
   allTags = [],
   testId = "CitationFilter",
 }) {
-  const update = (patch) => onChange({ ...filter, ...patch });
+  const update = (patch) => onChange({});
 
   const toggleRelevance = (option) => {
killedBy: BibTexEntryShowPage tests filtering the References table does not affect the Citations table, and vice versa
statusReason: Cannot read properties of undefined (reading 'includes')

[Killed] ObjectLiteral
main/components/Citations/CitationFilter.jsx:31:12
   const update = (patch) => onChange({ ...filter, ...patch });
 
   const toggleRelevance = (option) => {
-    update({
-      relevance: filter.relevance.includes(option)
-        ? filter.relevance.filter((r) => r !== option)
-        : [...filter.relevance, option],
-    });
+    update({});
   };
 
killedBy: CitationsTabComponent tests deselecting Unreviewed relevance hides every fixture entry (none have a relevance set)
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-testid="CitationsTabComponent-CitationTable-cell-row-0-col-citeKey"
>
  <a
    data-discover="true"
    data-testid="CitationsTabComponent-CitationTable-cell-row-0-col-citeKey-link"

[Killed] MethodExpression
main/components/Citations/CitationFilter.jsx:33:11
   const toggleRelevance = (option) => {
     update({
       relevance: filter.relevance.includes(option)
-        ? filter.relevance.filter((r) => r !== option)
+        ? filter.relevance
         : [...filter.relevance, option],
     });
killedBy: CitationFilter tests clicking a relevance button toggles it on and off via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,11 @@
  [

[Killed] BooleanLiteral
main/components/Citations/CitationFilter.jsx:40:49
 
   const selectedTagIds = new Set(filter.tagIds);
   const selectedTags = allTags.filter((tag) => selectedTagIds.has(tag.id));
-  const availableTags = allTags.filter((tag) => !selectedTagIds.has(tag.id));
+  const availableTags = allTags.filter((tag) => selectedTagIds.has(tag.id));
 
   const addTag = (tag) => {
killedBy: CitationFilter tests shows a pill for each selected tag, and only unselected tags in the Add Tag dropdown
statusReason: Unable to find an element by: [data-testid="CitationFilter-available-tag-2-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] BlockStatement
main/components/Citations/CitationFilter.jsx:43:38
   const availableTags = allTags.filter((tag) => !selectedTagIds.has(tag.id));
 
   const addTag = (tag) => {
-    if (!selectedTagIds.has(tag.id)) {
-      update({ tagIds: [...filter.tagIds, tag.id] });
-    }
+    if (!selectedTagIds.has(tag.id)) {}
   };
 
killedBy: CitationFilter tests clicking an available tag in the dropdown adds it to tagIds via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:49:51
   };
 
   const removeTag = (tag) => {
-    update({ tagIds: filter.tagIds.filter((id) => id !== tag.id) });
+    update({ tagIds: filter.tagIds.filter((id) => true) });
   };
 
killedBy: CitationFilter tests clicking the remove button on a selected tag removes it from tagIds via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

@@ -9,10 +9,11 @@
        "None",

[Killed] BooleanLiteral
main/components/Citations/CitationFilter.jsx:56:41
     <div data-testid={testId}>
       <div
         role="button"
-        onClick={() => onExpandedChange(!expanded)}
+        onClick={() => onExpandedChange(expanded)}
         data-testid={`${testId}-header`}
         className="d-flex justify-content-between align-items-center border rounded-3 p-2 mb-2"
killedBy: CitationFilter tests clicking the header while closed calls onExpandedChange(true)
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Received:

  1st vi.fn() call:

  [
-   true,

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:56:18
     <div data-testid={testId}>
       <div
         role="button"
-        onClick={() => onExpandedChange(!expanded)}
+        onClick={() => undefined}
         data-testid={`${testId}-header`}
         className="d-flex justify-content-between align-items-center border rounded-3 p-2 mb-2"
killedBy: CitationFilter tests clicking the header while closed calls onExpandedChange(true)
statusReason: expected "vi.fn()" to be called with arguments: [ true ]

Number of calls: 0

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:63:29
       >
         <strong>{expanded ? "Citation Filters" : "citation filters"}</strong>
         <span data-testid={`${testId}-toggle-icon`}>
-          {expanded ? "▲" : "▼"}
+          {expanded ? "▲" : ""}
         </span>
       </div>
killedBy: CitationFilter tests renders closed by default, showing lowercase 'citation filters' and a ▼ toggle icon
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ▼
Received:

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:96:25
                   key={option}
                   inline
                   type="radio"
-                  name={`${testId}-link`}
+                  name={``}
                   id={`${testId}-link-${option}`}
                   label={option}
killedBy: CitationFilter tests each Links radio has the correct name/id and reflects the current filter value
statusReason: expect(element).toHaveAttribute("name", "CitationFilter-link") // element.getAttribute("name") === "CitationFilter-link"

Expected the element to have attribute:
  name="CitationFilter-link"
Received:
  name=""

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:97:23
                   inline
                   type="radio"
                   name={`${testId}-link`}
-                  id={`${testId}-link-${option}`}
+                  id={``}
                   label={option}
                   checked={filter.link === option}
killedBy: CitationFilter tests each Links radio has the correct name/id and reflects the current filter value
statusReason: expect(element).toHaveAttribute("id", "CitationFilter-link-all") // element.getAttribute("id") === "CitationFilter-link-all"

Expected the element to have attribute:
  id="CitationFilter-link-all"
Received:
  null

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:99:28
                   name={`${testId}-link`}
                   id={`${testId}-link-${option}`}
                   label={option}
-                  checked={filter.link === option}
+                  checked={false}
                   onChange={() => update({ link: option })}
                   data-testid={`${testId}-link-${option}`}
killedBy: CitationFilter tests each Links radio has the correct name/id and reflects the current filter value
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="CitationFilter-link-doi"
  id="CitationFilter-link-doi"
  name="CitationFilter-link"

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:101:32
                   label={option}
                   checked={filter.link === option}
                   onChange={() => update({ link: option })}
-                  data-testid={`${testId}-link-${option}`}
+                  data-testid={``}
                 />
               ))}
killedBy: CitationFilter tests selecting a link radio option calls onChange with the new link value
statusReason: Unable to find an element by: [data-testid="CitationFilter-link-doi"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:116:28
                   name={`${testId}-duplicates`}
                   id={`${testId}-duplicates-${option}`}
                   label={option}
-                  checked={filter.duplicates === option}
+                  checked={true}
                   onChange={() => update({ duplicates: option })}
                   data-testid={`${testId}-duplicates-${option}`}
killedBy: CitationFilter tests each Duplicates radio has the correct name/id and reflects the current filter value
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CitationFilter-duplicates-all"
  id="CitationFilter-duplicates-all"

[Killed] ObjectLiteral
main/components/Citations/CitationFilter.jsx:117:42
                   id={`${testId}-duplicates-${option}`}
                   label={option}
                   checked={filter.duplicates === option}
-                  onChange={() => update({ duplicates: option })}
+                  onChange={() => update({})}
                   data-testid={`${testId}-duplicates-${option}`}
                 />
killedBy: CitationFilter tests selecting a duplicates radio option calls onChange with the new duplicates value
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

@@ -1,8 +1,8 @@
  [

[Killed] EqualityOperator
main/components/Citations/CitationFilter.jsx:145:28
                   name={`${testId}-tagMode`}
                   id={`${testId}-tagMode-and`}
                   label="and"
-                  checked={filter.tagMode === "and"}
+                  checked={filter.tagMode !== "and"}
                   onChange={() => update({ tagMode: "and" })}
                   data-testid={`${testId}-tagMode-and`}
killedBy: CitationFilter tests each tagMode radio has the correct name/id and reflects the current filter value, and 'or' can be re-selected
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="CitationFilter-tagMode-and"
  id="CitationFilter-tagMode-and"
  name="CitationFilter-tagMode"

[NoCoverage] ObjectLiteral
main/components/Citations/CitationFilter.jsx:146:42
                   id={`${testId}-tagMode-and`}
                   label="and"
                   checked={filter.tagMode === "and"}
-                  onChange={() => update({ tagMode: "and" })}
+                  onChange={() => update({})}
                   data-testid={`${testId}-tagMode-and`}
                 />

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:147:32
                   label="and"
                   checked={filter.tagMode === "and"}
                   onChange={() => update({ tagMode: "and" })}
-                  data-testid={`${testId}-tagMode-and`}
+                  data-testid={``}
                 />
                 <Form.Check
killedBy: CitationFilter tests each tagMode radio has the correct name/id and reflects the current filter value, and 'or' can be re-selected
statusReason: Unable to find an element by: [data-testid="CitationFilter-tagMode-and"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:157:32
                   label="or"
                   checked={filter.tagMode === "or"}
                   onChange={() => update({ tagMode: "or" })}
-                  data-testid={`${testId}-tagMode-or`}
+                  data-testid={``}
                 />
               </div>
killedBy: CitationFilter tests each tagMode radio has the correct name/id and reflects the current filter value, and 'or' can be re-selected
statusReason: Unable to find an element by: [data-testid="CitationFilter-tagMode-or"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:164:18
                 className="d-flex flex-wrap align-items-center gap-2 mb-2"
                 data-testid={`${testId}-selected-tags`}
               >
-                {selectedTags.length === 0 && (
-                  <span
-                    className="text-muted"
-                    data-testid={`${testId}-no-tags`}
-                  >
-                    No tags selected
-                  </span>
-                )}
+                {true}
                 {selectedTags.map((tag) => (
                   <span
killedBy: CitationFilter tests shows 'No tags selected' when no tags are in the filter
statusReason: Unable to find an element by: [data-testid="CitationFilter-no-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:164:18
                 className="d-flex flex-wrap align-items-center gap-2 mb-2"
                 data-testid={`${testId}-selected-tags`}
               >
-                {selectedTags.length === 0 && (
+                {true && (
                   <span
                     className="text-muted"
killedBy: CitationFilter tests shows a pill for each selected tag, and only unselected tags in the Add Tag dropdown
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-muted"
  data-testid="CitationFilter-no-tags"
>
  No tags selected
</span> instead

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:167:34
                 {selectedTags.length === 0 && (
                   <span
                     className="text-muted"
-                    data-testid={`${testId}-no-tags`}
+                    data-testid={``}
                   >
                     No tags selected
killedBy: CitationFilter tests shows 'No tags selected' when no tags are in the filter
statusReason: Unable to find an element by: [data-testid="CitationFilter-no-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >
