[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:43:3
 const POSSIBLE_DUPLICATE_HEADER_COLOR = "#f8d7da";
 
 const UNRESOLVED_COUNT_TOOLTIP =
-  `Whenever "Get References"/"Get Citations" learns a related paper exists ` +
+  `` +
   `but can't fully identify it, that gap is recorded rather than silently ` +
   `dropped, so this count doesn't quietly hide references we know about but ` +

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:48:3
   `dropped, so this count doesn't quietly hide references we know about but ` +
   `couldn't add. This can happen when: a resolver names a related work but ` +
   `it doesn't actually resolve to anything when fetched; a related work ` +
-  `resolves but no title could be found for it from any provider; or a ` +
+  `` +
   `related work was added successfully but has no DOI, so it can't itself ` +
   `be used to keep expanding the citation graph further.`;

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:62:10
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },
   { key: "references", field: "card_references", defaultOpen: false },
-  { key: "citations", field: "card_citations", defaultOpen: false },
+  { key: "", field: "card_citations", defaultOpen: false },
 ];
 
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  null

[Killed] BlockStatement
main/pages/Projects/BibTexEntryShowPage.jsx:85:19
   // that, rather than unmounting again on re-close — avoids the eager cost while still preserving
   // in-progress state (e.g. an unsaved comment draft) across a collapse/expand.
   const [hasOpened, setHasOpened] = useState(isOpen);
-  useEffect(() => {
-    if (isOpen) setHasOpened(true);
-  }, [isOpen]);
+  useEffect(() => {}, [isOpen]);
 
   return (
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:86:9
   // in-progress state (e.g. an unsaved comment draft) across a collapse/expand.
   const [hasOpened, setHasOpened] = useState(isOpen);
   useEffect(() => {
-    if (isOpen) setHasOpened(true);
+    if (false) setHasOpened(true);
   }, [isOpen]);
 
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:86:30
   // in-progress state (e.g. an unsaved comment draft) across a collapse/expand.
   const [hasOpened, setHasOpened] = useState(isOpen);
   useEffect(() => {
-    if (isOpen) setHasOpened(true);
+    if (isOpen) setHasOpened(false);
   }, [isOpen]);
 
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:108:27
         <span data-testid={`${testId}-toggle-icon`}>{isOpen ? "▲" : "▼"}</span>
       </Card.Header>
       <Collapse in={isOpen}>
-        <div data-testid={`${testId}-body`}>
+        <div data-testid={``}>
           <Card.Body>{hasOpened ? children : null}</Card.Body>
         </div>

[Survived] EqualityOperator
main/pages/Projects/BibTexEntryShowPage.jsx:174:26
     true,
   );
 
-  const getEntryFailed = entryBackendFailureCount > 0;
+  const getEntryFailed = entryBackendFailureCount <= 0;
 
   const navigate = useNavigate();

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:232:5
   const formattedCitationQueryKey = `/api/bibtexentries/formatted?projectId=${projectId}&id=${entry?.id}`;
   const { data: formattedCitation } = useBackend(
     [formattedCitationQueryKey],
-    {
-      method: "GET",
-      url: "/api/bibtexentries/formatted",
-      params: { projectId, id: entry?.id },
-    },
+    {},
     "",
     true,
killedBy: BibTexEntryShowPage tests shows a Formatted Reference card with the project's citation format and the formatted citation
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Smith, J. A Very Long Title.
Received:


Ignored nodes: comments, script, style

[Survived] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:248:15
     {
       method: "GET",
       url: "/api/bibtexentries/export",
-      params: { projectId, id: entry?.id },
+      params: {},
     },
     "",

[Survived] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:266:9
   // state from its persisted CITELINES_card_* field, defaulting per CARD_DEFS if the field isn't
   // present (e.g. this entry has never had a card toggled before).
   useEffect(() => {
-    if (!rawBibtex) return;
+    if (rawBibtex) return;
     setCardOpenState(
       Object.fromEntries(

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:271:11
       Object.fromEntries(
         CARD_DEFS.map((c) => [
           c.key,
-          (preservedFields[`citelines_${c.field}`] ??
-            (c.defaultOpen ? "Open" : "Closed")) === "Open",
+          false,
         ]),
       ),
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:272:39
         CARD_DEFS.map((c) => [
           c.key,
           (preservedFields[`citelines_${c.field}`] ??
-            (c.defaultOpen ? "Open" : "Closed")) === "Open",
+            (c.defaultOpen ? "Open" : "")) === "Open",
         ]),
       ),

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:297:12
     [citationsQueryKey],
     {
       method: "GET",
-      url: "/api/citationedges/citations",
+      url: "",
       params: { projectId, id: entry?.id },
     },
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-CitationsTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:311:12
     ],
     {
       method: "GET",
-      url: "/api/citationedges/unresolved",
+      url: "",
       params: { projectId, sourceEntryId: entry?.id },
     },
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-references-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:337:12
     : 0;
 
   const getReferencesMutation = useBackendMutation(
-    () => ({
-      url: "/api/jobs/launch/getReferences",
-      method: "POST",
-      params: { projectId, citeKey: entry?.citeKey },
-    }),
+    () => ({}),
     {
       onSuccess: () =>
killedBy: BibTexEntryShowPage tests clicking Get References launches the job and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:339:15
   const getReferencesMutation = useBackendMutation(
     () => ({
       url: "/api/jobs/launch/getReferences",
-      method: "POST",
+      method: "",
       params: { projectId, citeKey: entry?.citeKey },
     }),
killedBy: BibTexEntryShowPage tests clicking Get References launches the job and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:361:5
   );
 
   const improveEntryMutation = useBackendMutation(
-    () => ({
-      url: "/api/jobs/launch/improveBibTexEntries",
-      method: "POST",
-      params: { projectId, scope: "ENTRY", entryId: entry?.id },
-    }),
+    () => undefined,
     {
       onSuccess: () =>
killedBy: BibTexEntryShowPage tests clicking Improve This Entry launches the job and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Survived] OptionalChaining
main/pages/Projects/BibTexEntryShowPage.jsx:364:53
     () => ({
       url: "/api/jobs/launch/improveBibTexEntries",
       method: "POST",
-      params: { projectId, scope: "ENTRY", entryId: entry?.id },
+      params: { projectId, scope: "ENTRY", entryId: entry.id },
     }),
     {

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:364:15
     () => ({
       url: "/api/jobs/launch/improveBibTexEntries",
       method: "POST",
-      params: { projectId, scope: "ENTRY", entryId: entry?.id },
+      params: {},
     }),
     {
killedBy: BibTexEntryShowPage tests clicking Improve This Entry launches the job and shows a toast
statusReason: expected {} to deeply equal { Object (projectId, scope, ...) }

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:367:18
       params: { projectId, scope: "ENTRY", entryId: entry?.id },
     }),
     {
-      onSuccess: () =>
-        toast(
-          "Improve BibTeX Entries job launched — check the Jobs tab for progress.",
-        ),
+      onSuccess: () => undefined,
     },
   );
killedBy: BibTexEntryShowPage tests clicking Improve This Entry launches the job and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:369:11
     {
       onSuccess: () =>
         toast(
-          "Improve BibTeX Entries job launched — check the Jobs tab for progress.",
+          "",
         ),
     },
killedBy: BibTexEntryShowPage tests clicking Improve This Entry launches the job and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Improve BibTeX Entries job launched — check the Jobs tab for progress.",

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:378:15
     (newRelevance) => ({
       url: "/api/bibtexentries",
       method: "PUT",
-      params: { id: entry?.id, projectId },
+      params: {},
       data: injectCitelinesFields(rawBibtex, newRelevance, preservedFields),
       headers: { "Content-Type": "text/plain" },
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected {} to deeply equal { Object (id, projectId) }

[Survived] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:380:16
       method: "PUT",
       params: { id: entry?.id, projectId },
       data: injectCitelinesFields(rawBibtex, newRelevance, preservedFields),
-      headers: { "Content-Type": "text/plain" },
+      headers: {},
     }),
     { onSuccess: () => toast("Relevance updated successfully") },

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:382:30
       data: injectCitelinesFields(rawBibtex, newRelevance, preservedFields),
       headers: { "Content-Type": "text/plain" },
     }),
-    { onSuccess: () => toast("Relevance updated successfully") },
+    { onSuccess: () => toast("") },
     [exportQueryKey],
   );
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected "vi.fn()" to be called with arguments: [ 'Relevance updated successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Relevance updated successfully",

[Survived] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:392:16
       method: "PUT",
       params: { id: entry?.id, projectId },
       data: injectCitelinesFields(rawBibtex, relevance, newPreservedFields),
-      headers: { "Content-Type": "text/plain" },
+      headers: {},
     }),
     {},

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:404:40
       // rawBibtex may not have loaded yet; injecting into an empty string would wipe the entry,
       // so only persist once we actually have the entry's bibtex to merge the new state into.
       if (rawBibtex) {
-        updateCardStateMutation.mutate({
-          ...preservedFields,
-          [`citelines_${fieldName}`]: newIsOpen ? "Open" : "Closed",
-        });
+        updateCardStateMutation.mutate({});
       }
       return { ...prev, [cardKey]: newIsOpen };
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expected '@article{smith2020,\n  title = {A Ver…' to contain 'CITELINES_card_bibtex = {Closed}'

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:453:32
             projectId={projectId}
             relatedEntryId={entry.id}
             relationship="reference"
-            mutationQueryKeys={[referencesQueryKey]}
+            mutationQueryKeys={[]}
           />
           <BibTexEntryModal

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:502:26
               <Button
                 variant="outline-primary"
                 size="sm"
-                onClick={() => improveEntryMutation.mutate({})}
+                onClick={() => undefined}
                 data-testid={`${testId}-improve-entry-button`}
               >
killedBy: BibTexEntryShowPage tests clicking Improve This Entry launches the job and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:560:21
             <div className="d-flex gap-2">
               <Button
                 as={Link}
-                to={`/project/${projectId}`}
+                to={``}
                 variant="outline-secondary"
                 data-testid={`${testId}-go-to-project-button`}
killedBy: BibTexEntryShowPage tests shows a Go to Project button linking back to the project page
statusReason: expect(element).toHaveAttribute("href", "/project/1") // element.getAttribute("href") === "/project/1"

Expected the element to have attribute:
  href="/project/1"
Received:
  href="/project/1/bibtex/64f1b2c3d4e5f6a7b8c9d0e1"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:591:32
               >
                 <Button
                   onClick={() => getCitationsMutation.mutate({})}
-                  data-testid={`${testId}-get-citations-button`}
+                  data-testid={``}
                 >
                   Get Citations
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-get-citations-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:606:30
               <Button
                 variant="outline-primary"
                 onClick={() => setShowAddCitationModal(true)}
-                data-testid={`${testId}-add-citation-button`}
+                data-testid={``}
               >
                 Add Citation
killedBy: BibTexEntryShowPage tests clicking Add Citation opens the modal, and submitting posts with relationship=citation
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-add-citation-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:625:30
               <Button
                 variant="outline-primary"
                 onClick={() => setShowBulkCitationUploadModal(true)}
-                data-testid={`${testId}-bulk-citation-upload-button`}
+                data-testid={``}
               >
                 Bulk Citations from ACM DL
killedBy: BibTexEntryShowPage tests clicking Bulk Citations from ACM DL opens the modal, and submitting launches the job with the current entry's citeKey
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-bulk-citation-upload-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:670:57
               header="Possible Duplicates"
               headerStyle={{ backgroundColor: POSSIBLE_DUPLICATE_HEADER_COLOR }}
               isOpen={showPossibleDuplicates}
-              onToggle={() => setShowPossibleDuplicates((prev) => !prev)}
+              onToggle={() => setShowPossibleDuplicates(() => undefined)}
             >
               {(entry.possibleDuplicateIds ?? []).map((duplicateId) => (
killedBy: BibTexEntryShowPage tests the Possible Duplicates card can be collapsed like the other cards
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  null

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:685:34
                     testId={`${testId}-PossibleDuplicatesCard-citation-${duplicateId}`}
                   />
                   <div
-                    data-testid={`${testId}-PossibleDuplicatesCard-reason-${duplicateId}`}
+                    data-testid={``}
                   >
                     Reason:{" "}
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-PossibleDuplicatesCard-reason-64f1b2c3d4e5f6a7b8c9d0e9"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:697:26
 
           <Card
             className="mb-3"
-            data-testid={`${testId}-FormattedReferenceCard`}
+            data-testid={``}
           >
             <Card.Header>Formatted Reference</Card.Header>
killedBy: BibTexEntryShowPage tests shows a Formatted Reference card with the project's citation format and the formatted citation
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-FormattedReferenceCard"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:707:33
               >
                 Formatted Citation ({project?.citationFormat ?? "Loading..."})
               </div>
-              <div data-testid={`${testId}-formatted-citation`}>
+              <div data-testid={``}>
                 {formattedCitation}
               </div>
killedBy: BibTexEntryShowPage tests shows a Formatted Reference card with the project's citation format and the formatted citation
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-formatted-citation"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Projects/BibTexEntryShowPage.jsx:774:18
             header={
               <span data-testid={`${testId}-references-heading`}>
                 References ({references.length})
-                {unresolvedReferencesCount > 0 && (
-                  <OverlayTrigger
-                    placement="top"
-                    overlay={
-                      <Tooltip id={`${testId}-references-unresolved-tooltip`}>
-                        {UNRESOLVED_COUNT_TOOLTIP}
-                      </Tooltip>
-                    }
-                  >
-                    <span
-                      className="text-warning ms-2"
-                      data-testid={`${testId}-references-unresolved-badge`}
-                    >
-                      — {unresolvedReferencesCount} unresolved
-                    </span>
-                  </OverlayTrigger>
-                )}
+                {unresolvedReferencesCount > 0 || <OverlayTrigger placement="top" overlay={<Tooltip id={`${testId}-references-unresolved-tooltip`}>
+                        {UNRESOLVED_COUNT_TOOLTIP}
+                      </Tooltip>}>
+                    <span className="text-warning ms-2" data-testid={`${testId}-references-unresolved-badge`}>
+                      — {unresolvedReferencesCount} unresolved
+                    </span>
+                  </OverlayTrigger>}
               </span>
             }
killedBy: BibTexEntryShowPage tests shows no unresolved badge when there are no unresolved citations
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-warning ms-2"
  data-testid="BibTexEntryShowPage-references-unresolved-badge"
>
  — 
  0

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:785:36
                   >
                     <span
                       className="text-warning ms-2"
-                      data-testid={`${testId}-references-unresolved-badge`}
+                      data-testid={``}
                     >
                       — {unresolvedReferencesCount} unresolved
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-references-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Projects/BibTexEntryShowPage.jsx:824:18
             header={
               <span data-testid={`${testId}-citations-heading`}>
                 Citations ({citations.length})
-                {unresolvedCitationsCount > 0 && (
-                  <OverlayTrigger
-                    placement="top"
-                    overlay={
-                      <Tooltip id={`${testId}-citations-unresolved-tooltip`}>
-                        {UNRESOLVED_COUNT_TOOLTIP}
-                      </Tooltip>
-                    }
-                  >
-                    <span
-                      className="text-warning ms-2"
-                      data-testid={`${testId}-citations-unresolved-badge`}
-                    >
-                      — {unresolvedCitationsCount} unresolved
-                    </span>
-                  </OverlayTrigger>
-                )}
+                {unresolvedCitationsCount > 0 || <OverlayTrigger placement="top" overlay={<Tooltip id={`${testId}-citations-unresolved-tooltip`}>
+                        {UNRESOLVED_COUNT_TOOLTIP}
+                      </Tooltip>}>
+                    <span className="text-warning ms-2" data-testid={`${testId}-citations-unresolved-badge`}>
+                      — {unresolvedCitationsCount} unresolved
+                    </span>
+                  </OverlayTrigger>}
               </span>
             }
killedBy: BibTexEntryShowPage tests shows no unresolved badge when there are no unresolved citations
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-warning ms-2"
  data-testid="BibTexEntryShowPage-citations-unresolved-badge"
>
  — 
  0

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:824:18
             header={
               <span data-testid={`${testId}-citations-heading`}>
                 Citations ({citations.length})
-                {unresolvedCitationsCount > 0 && (
-                  <OverlayTrigger
-                    placement="top"
-                    overlay={
-                      <Tooltip id={`${testId}-citations-unresolved-tooltip`}>
-                        {UNRESOLVED_COUNT_TOOLTIP}
-                      </Tooltip>
-                    }
-                  >
-                    <span
-                      className="text-warning ms-2"
-                      data-testid={`${testId}-citations-unresolved-badge`}
-                    >
-                      — {unresolvedCitationsCount} unresolved
-                    </span>
-                  </OverlayTrigger>
-                )}
+                {true}
               </span>
             }
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-citations-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
