[Killed] StringLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:13:18
 
 export default function CitationsTabComponent({
   projectId,
-  testIdPrefix = "CitationsTabComponent",
+  testIdPrefix = "",
 }) {
   const [postModal, showPostModal] = useState(false);
killedBy: CitationsTabComponent tests renders the Add Citation via BibTex and Add Citation via DOI buttons, and the citation table
statusReason: Unable to find an element by: [data-testid="CitationsTabComponent-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="-CitationsTabComponent"

[Killed] StringLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:18:20
   const [postModal, showPostModal] = useState(false);
   const [doiModal, showDoiModal] = useState(false);
 
-  const queryKey = `/api/bibtexentries/project?projectId=${projectId}`;
+  const queryKey = ``;
 
   const { data: citations } = useBackend(
killedBy: CitationsTabComponent tests renders the Add Citation via BibTex and Add Citation via DOI buttons, and the citation table
statusReason: Unable to find an element by: [data-testid="CitationsTabComponent-CitationTable-cell-row-0-col-citeKey"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="CitationsTabComponent-CitationsTabComponent"

[Killed] StringLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:81:26
           </Button>
           <Button
             onClick={() => showDoiModal(true)}
-            data-testid={`${testIdPrefix}-doi-button`}
+            data-testid={``}
           >
             Add Citation via DOI
killedBy: CitationsTabComponent tests renders the Add Citation via BibTex and Add Citation via DOI buttons, and the citation table
statusReason: Unable to find an element by: [data-testid="CitationsTabComponent-doi-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="CitationsTabComponent-CitationsTabComponent"
