[Killed] ObjectLiteral
src/main/utils/citationFilter.js:28:40
 export const CITATION_FILTER_DUPLICATE_OPTIONS = ["all", "dup", "no-dup"];
 
 // Nothing filtered out by default — every toggle/radio starts in its most permissive state.
-export const DEFAULT_CITATION_FILTER = {
-  relevance: [...RELEVANCE_OPTIONS],
-  link: "all",
-  duplicates: "all",
-  search: "",
-  tagIds: [],
-  tagMode: "and",
-};
+export const DEFAULT_CITATION_FILTER = {};
 
 // Relevance is stored directly on keyValuePairs, but — unlike CITELINES_invalid_doi/url, which
killedBy: citationFilter constants DEFAULT_CITATION_FILTER starts fully permissive (nothing filtered out)
statusReason: expected undefined to deeply equal [ 'High', 'Medium', 'Low', …(2) ]

[Killed] StringLiteral
src/main/utils/citationFilter.js:34:12
   duplicates: "all",
   search: "",
   tagIds: [],
-  tagMode: "and",
+  tagMode: "",
 };
 
killedBy: citationFilter constants DEFAULT_CITATION_FILTER starts fully permissive (nothing filtered out)
statusReason: expected '' to be 'and' // Object.is equality
