[Killed] BlockStatement
src/main/utils/useFilteredSortedCitations.js:33:53
  *   enableColumnSort: boolean,
  * }}
  */
-export function useFilteredSortedCitations(entries) {
-  const [filter, setFilter] = useState(DEFAULT_CITATION_FILTER);
-  const [sortCriteria, setSortCriteria] = useState(DEFAULT_CITATION_SORT);
-  // The CitationFilter panel's own open/closed state (issue #122) — closed by default, owned
-  // here (rather than inside CitationFilter itself) so it's available alongside filter/sort for
-  // whatever persists this state per scope later (issue #121).
-  const [expanded, setExpanded] = useState(false);
-
-  const visibleCitations = entries
-    .filter((entry) => matchesCitationFilter(entry, filter))
-    .sort(sortCriteriaComparator(sortCriteria));
-
-  return {
-    filter,
-    setFilter,
-    sortCriteria,
-    setSortCriteria,
-    expanded,
-    setExpanded,
-    visibleCitations,
-    // A stray CitationTable column-header click can't silently desync the table from what
-    // CitationSort's own ordering shows — see CitationTable's enableColumnSort doc comment.
-    enableColumnSort: sortCriteria.length === 0,
-  };
-}
+export function useFilteredSortedCitations(entries) {}
 
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BooleanLiteral
src/main/utils/useFilteredSortedCitations.js:39:44
   // The CitationFilter panel's own open/closed state (issue #122) — closed by default, owned
   // here (rather than inside CitationFilter itself) so it's available alongside filter/sort for
   // whatever persists this state per scope later (issue #121).
-  const [expanded, setExpanded] = useState(false);
+  const [expanded, setExpanded] = useState(true);
 
   const visibleCitations = entries
killedBy: CitationsTabComponent tests renders a CitationFilter panel above the table, closed by default
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  citation filters
Received:
  Citation Filters▲

[Killed] MethodExpression
src/main/utils/useFilteredSortedCitations.js:41:28
   // whatever persists this state per scope later (issue #121).
   const [expanded, setExpanded] = useState(false);
 
-  const visibleCitations = entries
-    .filter((entry) => matchesCitationFilter(entry, filter))
-    .sort(sortCriteriaComparator(sortCriteria));
+  const visibleCitations = entries.filter(entry => matchesCitationFilter(entry, filter));
 
   return {
killedBy: CitationsTabComponent tests adding Author as a sort criterion re-sorts the table by author
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  lee2021
Received:
  smith202...

Ignored nodes: comments, script, style

[Killed] MethodExpression
src/main/utils/useFilteredSortedCitations.js:41:28
   // whatever persists this state per scope later (issue #121).
   const [expanded, setExpanded] = useState(false);
 
-  const visibleCitations = entries
-    .filter((entry) => matchesCitationFilter(entry, filter))
+  const visibleCitations = entries
     .sort(sortCriteriaComparator(sortCriteria));
 
killedBy: BibTexEntryShowPage tests filtering the References table does not affect the Citations table, and vice versa
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  data-discover="true"
  data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-1-col-citeKey-link"
  href="/project/1/bibtex/64f1b2c3d4e5f6a7b8c9d0e3"
>
  lee2021

[Killed] ArrowFunction
src/main/utils/useFilteredSortedCitations.js:42:13
   const [expanded, setExpanded] = useState(false);
 
   const visibleCitations = entries
-    .filter((entry) => matchesCitationFilter(entry, filter))
+    .filter(() => undefined)
     .sort(sortCriteriaComparator(sortCriteria));
 
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ObjectLiteral
src/main/utils/useFilteredSortedCitations.js:45:10
     .filter((entry) => matchesCitationFilter(entry, filter))
     .sort(sortCriteriaComparator(sortCriteria));
 
-  return {
-    filter,
-    setFilter,
-    sortCriteria,
-    setSortCriteria,
-    expanded,
-    setExpanded,
-    visibleCitations,
-    // A stray CitationTable column-header click can't silently desync the table from what
-    // CitationSort's own ordering shows — see CitationTable's enableColumnSort doc comment.
-    enableColumnSort: sortCriteria.length === 0,
-  };
+  return {};
 }
 
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] EqualityOperator
src/main/utils/useFilteredSortedCitations.js:55:23
     visibleCitations,
     // A stray CitationTable column-header click can't silently desync the table from what
     // CitationSort's own ordering shows — see CitationTable's enableColumnSort doc comment.
-    enableColumnSort: sortCriteria.length === 0,
+    enableColumnSort: sortCriteria.length !== 0,
   };
 }
killedBy: BibTexEntryShowPage tests while a References sort criterion is selected, its column-header click is disabled, but Citations' is unaffected
statusReason: expected [ 'jones201...', 'lee2021' ] to deeply equal [ 'lee2021', 'jones201...' ]

[Killed] ConditionalExpression
src/main/utils/useFilteredSortedCitations.js:55:23
     visibleCitations,
     // A stray CitationTable column-header click can't silently desync the table from what
     // CitationSort's own ordering shows — see CitationTable's enableColumnSort doc comment.
-    enableColumnSort: sortCriteria.length === 0,
+    enableColumnSort: true,
   };
 }
killedBy: BibTexEntryShowPage tests while a References sort criterion is selected, its column-header click is disabled, but Citations' is unaffected
statusReason: expected [ 'jones201...', 'lee2021' ] to deeply equal [ 'lee2021', 'jones201...' ]
