[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:40:35
   const toggleRelevance = (option) => {
     update({
       relevance: filter.relevance.includes(option)
-        ? filter.relevance.filter((r) => r !== option)
+        ? filter.relevance.filter(() => undefined)
         : [...filter.relevance, option],
     });
killedBy: CitationFilter tests clicking a relevance button toggles it on and off via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

  [
    {

[Survived] StringLiteral
main/components/Citations/CitationFilter.jsx:64:24
       <OverlayTrigger
         placement="top"
         overlay={
-          <Tooltip id={`${testId}-header-tooltip`}>
+          <Tooltip id={``}>
             {expanded ? "Click to close" : "Click to open"}
           </Tooltip>

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:83:27
         </div>
       </OverlayTrigger>
       <Collapse in={expanded}>
-        <div data-testid={`${testId}-body`}>
+        <div data-testid={``}>
           <div className="border rounded-3 p-3 mb-3">
             <div className="mb-3">
killedBy: CitationFilter tests renders closed by default, showing 'Citation Filters' (title case) and a ▼ toggle icon
statusReason: Unable to find an element by: [data-testid="CitationFilter-body"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:93:41
                   <Button
                     key={option}
                     size="sm"
-                    variant={selected ? "primary" : "outline-primary"}
+                    variant={selected ? "" : "outline-primary"}
                     aria-pressed={selected}
                     className="me-1"
killedBy: CitationFilter tests a selected relevance button is styled 'primary'; an unselected one is 'outline-primary'
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  me-1 btn btn-sm

[Killed] ObjectLiteral
main/components/Citations/CitationFilter.jsx:116:42
                   id={`${testId}-link-${option}`}
                   label={option}
                   checked={filter.link === option}
-                  onChange={() => update({ link: option })}
+                  onChange={() => update({})}
                   data-testid={`${testId}-link-${option}`}
                 />
killedBy: CitationFilter tests selecting a link radio option calls onChange with the new link value
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

@@ -1,9 +1,9 @@
  [

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:130:23
                   inline
                   type="radio"
                   name={`${testId}-duplicates`}
-                  id={`${testId}-duplicates-${option}`}
+                  id={``}
                   label={option}
                   checked={filter.duplicates === option}
killedBy: CitationFilter tests each Duplicates radio has the correct name/id and reflects the current filter value
statusReason: expect(element).toHaveAttribute("id", "CitationFilter-duplicates-all") // element.getAttribute("id") === "CitationFilter-duplicates-all"

Expected the element to have attribute:
  id="CitationFilter-duplicates-all"
Received:
  null

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:144:21
                 Search (author/title)
               </Form.Label>
               <Form.Control
-                id={`${testId}-search`}
+                id={``}
                 data-testid={`${testId}-search`}
                 type="text"
killedBy: CitationFilter tests the search field's label is correctly associated with the input
statusReason: Found a label with the text of: Search (author/title), however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] ObjectLiteral
main/components/Citations/CitationFilter.jsx:172:42
                   id={`${testId}-tagMode-or`}
                   label="or"
                   checked={filter.tagMode === "or"}
-                  onChange={() => update({ tagMode: "or" })}
+                  onChange={() => update({})}
                   data-testid={`${testId}-tagMode-or`}
                 />
killedBy: CitationFilter tests each tagMode radio has the correct name/id and reflects the current filter value, and 'or' can be re-selected
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

@@ -9,8 +9,8 @@
        "None",

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:196:31
                   >
                     <TagPill
                       tag={tag}
-                      testId={`${testId}-selected-tag-${tag.id}-badge`}
+                      testId={``}
                     />
                     <button
killedBy: CitationFilter tests shows a pill for each selected tag, and only unselected tags in the Add Tag dropdown
statusReason: Unable to find an element by: [data-testid="CitationFilter-selected-tag-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] LogicalOperator
main/components/Citations/CitationFilter.jsx:219:20
                   Add Tag
                 </Dropdown.Toggle>
                 <Dropdown.Menu>
-                  {availableTags.length === 0 && (
-                    <Dropdown.Item
-                      disabled
-                      data-testid={`${testId}-no-available-tags`}
-                    >
-                      No more tags available
-                    </Dropdown.Item>
-                  )}
+                  {availableTags.length === 0 || <Dropdown.Item disabled data-testid={`${testId}-no-available-tags`}>
+                      No more tags available
+                    </Dropdown.Item>}
                   {availableTags.map((tag) => (
                     <Dropdown.Item
killedBy: CitationFilter tests defaults allTags to an empty list, so the Add Tag dropdown has nothing to offer
statusReason: Unable to find an element by: [data-testid="CitationFilter-no-available-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >
