[Survived] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:328:71
   // Each card gets its own independent filter/sort state (issue #108) — narrowing/sorting
   // References must not affect Citations, and vice versa. The heading counts above still show
   // the raw, unfiltered totals; only the table itself reflects the filter/sort.
-  const referencesFilterSort = useFilteredSortedCitations(references, {
-    projectId,
-    scope: "REFERENCES",
-    entryId,
-  });
+  const referencesFilterSort = useFilteredSortedCitations(references, {});
   const citationsFilterSort = useFilteredSortedCitations(citations, {
     projectId,

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:358:12
 
   const getCitationsMutation = useBackendMutation(
     () => ({
-      url: "/api/jobs/launch/getCitations",
+      url: "",
       method: "POST",
       params: { projectId, citeKey: entry?.citeKey },
killedBy: BibTexEntryShowPage tests clicking Get Citations launches the job and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Get Citations job launched — check the Jobs tab for progress.",

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:370:12
 
   const improveEntryMutation = useBackendMutation(
     () => ({
-      url: "/api/jobs/launch/improveBibTexEntries",
+      url: "",
       method: "POST",
       params: { projectId, scope: "ENTRY", entryId: entry?.id },
killedBy: BibTexEntryShowPage tests clicking Improve This Entry launches the job and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Improve BibTeX Entries job launched — check the Jobs tab for progress.",

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:371:15
   const improveEntryMutation = useBackendMutation(
     () => ({
       url: "/api/jobs/launch/improveBibTexEntries",
-      method: "POST",
+      method: "",
       params: { projectId, scope: "ENTRY", entryId: entry?.id },
     }),
killedBy: BibTexEntryShowPage tests clicking Improve This Entry launches the job and shows a toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:374:5
       method: "POST",
       params: { projectId, scope: "ENTRY", entryId: entry?.id },
     }),
-    {
-      onSuccess: () =>
-        toast(
-          "Improve BibTeX Entries job launched — check the Jobs tab for progress.",
-        ),
-    },
+    {},
   );
 
killedBy: BibTexEntryShowPage tests clicking Improve This Entry launches the job and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:384:12
 
   const updateRelevanceMutation = useBackendMutation(
     (newRelevance) => ({
-      url: "/api/bibtexentries",
+      url: "",
       method: "PUT",
       params: { id: entry?.id, projectId },
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected "vi.fn()" to be called with arguments: [ 'Relevance updated successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Relevance updated successfully",

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:390:5
       data: injectCitelinesFields(rawBibtex, newRelevance, preservedFields),
       headers: { "Content-Type": "text/plain" },
     }),
-    { onSuccess: () => toast("Relevance updated successfully") },
+    {},
     [exportQueryKey],
   );
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected "vi.fn()" to be called with arguments: [ 'Relevance updated successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:417:14
           [`citelines_${fieldName}`]: newIsOpen ? "Open" : "Closed",
         });
       }
-      return { ...prev, [cardKey]: newIsOpen };
+      return {};
     });
   }
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:429:15
     }),
     {
       onSuccess: () => {
-        toast("Entry deleted successfully");
+        toast("");
         navigate(`/project/${projectId}`, { replace: true });
       },
killedBy: BibTexEntryShowPage tests clicking Yes, Delete deletes the entry and shows a toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'Entry deleted successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Entry deleted successfully",

[Survived] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:430:43
     {
       onSuccess: () => {
         toast("Entry deleted successfully");
-        navigate(`/project/${projectId}`, { replace: true });
+        navigate(`/project/${projectId}`, {});
       },
     },

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:538:23
               onAddTag={(tag) => addTagMutation.mutate(tag)}
               onRemoveTag={(tag) => removeTagMutation.mutate(tag)}
               projectId={projectId}
-              testId={`${testId}-TagSelector`}
+              testId={``}
             />
           </div>
killedBy: BibTexEntryShowPage tests shows a TagSelector with the project's tags and the entry's assigned tags
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-TagSelector-assigned-tag-1"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:584:32
               >
                 <Button
                   onClick={() => getReferencesMutation.mutate({})}
-                  data-testid={`${testId}-get-references-button`}
+                  data-testid={``}
                 >
                   Get References
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-get-references-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:607:30
               <Button
                 variant="outline-primary"
                 onClick={() => setShowAddReferenceModal(true)}
-                data-testid={`${testId}-add-reference-button`}
+                data-testid={``}
               >
                 Add Reference
killedBy: BibTexEntryShowPage tests clicking Add Reference opens the modal, and submitting posts with relationship=reference
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-add-reference-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:723:21
 
           <CollapsibleCard
             testId={`${testId}-AbstractCard`}
-            header={`Abstract (${abstractWordCount} words)`}
+            header={``}
             headerActions={
               <Button
killedBy: BibTexEntryShowPage tests the Abstract card shows a word count of 0 when the entry has no abstract
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Abstract (0 words)
Received:
  Edit▼

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:757:28
             onToggle={() => toggleCard("bibtex", "card_bibtex")}
           >
             <pre
-              data-testid={`${testId}-bibtex`}
+              data-testid={``}
               className="border rounded-3 p-3"
             >
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:786:36
                   <OverlayTrigger
                     placement="top"
                     overlay={
-                      <Tooltip id={`${testId}-references-unresolved-tooltip`}>
+                      <Tooltip id={``}>
                         {UNRESOLVED_COUNT_TOOLTIP}
                       </Tooltip>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:810:23
               expanded={referencesFilterSort.expanded}
               onExpandedChange={referencesFilterSort.setExpanded}
               allTags={allTags}
-              testId={`${testId}-ReferencesFilter`}
+              testId={``}
             />
             <CitationSort
killedBy: BibTexEntryShowPage tests renders independent CitationFilter/CitationSort panels above the References and Citations tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesFilter-header"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
