[Survived] StringLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:54:65
     setSortExpanded,
     visibleCitations,
     enableColumnSort,
-  } = useFilteredSortedCitations(citations, { projectId, scope: "PROJECT" });
+  } = useFilteredSortedCitations(citations, { projectId, scope: "" });
 
   return (

[Killed] StringLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:96:19
           expanded={expanded}
           onExpandedChange={setExpanded}
           allTags={allTags}
-          testId={`${testIdPrefix}-CitationFilter`}
+          testId={``}
         />
       </Row>
killedBy: CitationsTabComponent tests renders a CitationFilter panel above the table, closed by default
statusReason: Unable to find an element by: [data-testid="CitationsTabComponent-CitationFilter-header"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="CitationsTabComponent-CitationsTabComponent"
