[Killed] BooleanLiteral
src/main/utils/useFilteredSortedCitations.js:56:49
   // The CitationFilter panel's own open/closed state (issue #122) — closed by default, owned
   // here (rather than inside CitationFilter itself) so it's available alongside filter for
   // persistence below.
-  const [expanded, setExpandedState] = useState(false);
+  const [expanded, setExpandedState] = useState(true);
   // CitationSort's own open/closed state (issue #126, mirroring #122) — closed by default.
   // Not yet persisted (that's #126's follow-up PR, mirroring #121); plain local state for now,
killedBy: useFilteredSortedCitations defaults to the full entry list, unfiltered and unsorted
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/main/utils/useFilteredSortedCitations.js:60:52
   // CitationSort's own open/closed state (issue #126, mirroring #122) — closed by default.
   // Not yet persisted (that's #126's follow-up PR, mirroring #121); plain local state for now,
   // same as `expanded` was here before #121 wired its persistence up.
-  const [sortExpanded, setSortExpanded] = useState(false);
+  const [sortExpanded, setSortExpanded] = useState(true);
 
   const hasPersistence = Boolean(persistence);
killedBy: CitationsTabComponent tests renders a CitationSort panel above the table, closed by default
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ▼
Received:
  ▲

[Killed] LogicalOperator
src/main/utils/useFilteredSortedCitations.js:68:7
     scope,
     entryId,
     autosaveIntervalMs = CITELINES_AUTOSAVE_INTERVAL_MS,
-  } = persistence ?? {};
+  } = persistence && {};
 
   // Mirrors filter/expanded outside React state so the autosave heartbeat (set up once, not
killedBy: useFilteredSortedCitations defaults to the full entry list, unfiltered and unsorted
statusReason: Cannot destructure property 'projectId' of '(intermediate value)(intermediate value)(intermediate value)' as it is undefined.

[Timeout] ObjectLiteral
src/main/utils/useFilteredSortedCitations.js:73:28
   // Mirrors filter/expanded outside React state so the autosave heartbeat (set up once, not
   // recreated per keystroke) always reads the latest values rather than closing over stale ones
   // — same reasoning as BibTexEntryComments' draftTextRef.
-  const latestRef = useRef({ filter, expanded });
+  const latestRef = useRef({});
   // Set once real saved/default state has been loaded and applied, so that initial load doesn't
   // immediately mark itself dirty and re-save the exact data it just fetched.

[Killed] BooleanLiteral
src/main/utils/useFilteredSortedCitations.js:76:28
   const latestRef = useRef({ filter, expanded });
   // Set once real saved/default state has been loaded and applied, so that initial load doesn't
   // immediately mark itself dirty and re-save the exact data it just fetched.
-  const seededRef = useRef(!hasPersistence);
+  const seededRef = useRef(hasPersistence);
   const dirtyRef = useRef(false);
 
killedBy: useFilteredSortedCitations with persistence loads the saved state on mount and seeds filter/expanded from it
statusReason: expected false to be true // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/main/utils/useFilteredSortedCitations.js:77:27
   // Set once real saved/default state has been loaded and applied, so that initial load doesn't
   // immediately mark itself dirty and re-save the exact data it just fetched.
   const seededRef = useRef(!hasPersistence);
-  const dirtyRef = useRef(false);
+  const dirtyRef = useRef(true);
 
   const setFilter = (newFilter) => {
killedBy: useFilteredSortedCitations with persistence does not autosave right after loading -- only a real change marks it dirty
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/main/utils/useFilteredSortedCitations.js:79:36
   const seededRef = useRef(!hasPersistence);
   const dirtyRef = useRef(false);
 
-  const setFilter = (newFilter) => {
-    setFilterState(newFilter);
-    latestRef.current = { ...latestRef.current, filter: newFilter };
-    if (hasPersistence && seededRef.current) dirtyRef.current = true;
-  };
+  const setFilter = (newFilter) => {};
 
   const setExpanded = (newExpanded) => {
killedBy: useFilteredSortedCitations setFilter narrows visibleCitations via matchesCitationFilter
statusReason: expected [ Array(2) ] to deeply equal [ Array(1) ]

[Killed] ObjectLiteral
src/main/utils/useFilteredSortedCitations.js:81:25
 
   const setFilter = (newFilter) => {
     setFilterState(newFilter);
-    latestRef.current = { ...latestRef.current, filter: newFilter };
+    latestRef.current = {};
     if (hasPersistence && seededRef.current) dirtyRef.current = true;
   };
killedBy: useFilteredSortedCitations with persistence autosaves the current filter/expanded on the next heartbeat after a change
statusReason: expected {} to deeply equal { relevance: [ 'High' ], …(6) }

[Killed] ConditionalExpression
src/main/utils/useFilteredSortedCitations.js:82:9
   const setFilter = (newFilter) => {
     setFilterState(newFilter);
     latestRef.current = { ...latestRef.current, filter: newFilter };
-    if (hasPersistence && seededRef.current) dirtyRef.current = true;
+    if (false) dirtyRef.current = true;
   };
 
killedBy: useFilteredSortedCitations with persistence autosaves the current filter/expanded on the next heartbeat after a change
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/main/utils/useFilteredSortedCitations.js:82:65
   const setFilter = (newFilter) => {
     setFilterState(newFilter);
     latestRef.current = { ...latestRef.current, filter: newFilter };
-    if (hasPersistence && seededRef.current) dirtyRef.current = true;
+    if (hasPersistence && seededRef.current) dirtyRef.current = false;
   };
 
killedBy: useFilteredSortedCitations with persistence autosaves the current filter/expanded on the next heartbeat after a change
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/useFilteredSortedCitations.js:85:40
     if (hasPersistence && seededRef.current) dirtyRef.current = true;
   };
 
-  const setExpanded = (newExpanded) => {
-    setExpandedState(newExpanded);
-    latestRef.current = { ...latestRef.current, expanded: newExpanded };
-    if (hasPersistence && seededRef.current) dirtyRef.current = true;
-  };
+  const setExpanded = (newExpanded) => {};
 
   const { data: savedState } = useBackend(
killedBy: useFilteredSortedCitations setExpanded toggles the expanded flag
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/main/utils/useFilteredSortedCitations.js:88:9
   const setExpanded = (newExpanded) => {
     setExpandedState(newExpanded);
     latestRef.current = { ...latestRef.current, expanded: newExpanded };
-    if (hasPersistence && seededRef.current) dirtyRef.current = true;
+    if (false) dirtyRef.current = true;
   };
 
killedBy: useFilteredSortedCitations with persistence a second heartbeat with no further change does not autosave again
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/main/utils/useFilteredSortedCitations.js:88:65
   const setExpanded = (newExpanded) => {
     setExpandedState(newExpanded);
     latestRef.current = { ...latestRef.current, expanded: newExpanded };
-    if (hasPersistence && seededRef.current) dirtyRef.current = true;
+    if (hasPersistence && seededRef.current) dirtyRef.current = false;
   };
 
killedBy: useFilteredSortedCitations with persistence a second heartbeat with no further change does not autosave again
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Timeout] ArrayDeclaration
src/main/utils/useFilteredSortedCitations.js:92:5
   };
 
   const { data: savedState } = useBackend(
-    [
-      "/api/citationfilterstate",
-      String(projectId),
-      String(scope),
-      String(entryId),
-    ],
+    [],
     {
       method: "GET",

[Timeout] BlockStatement
src/main/utils/useFilteredSortedCitations.js:108:19
     { enabled: hasPersistence },
   );
 
-  useEffect(() => {
-    if (!savedState || seededRef.current) return;
-    seededRef.current = true;
-    const seededFilter = {
-      relevance: savedState.relevance,
-      link: savedState.link,
-      duplicates: savedState.duplicates,
-      search: savedState.search,
-      tagIds: savedState.tagIds,
-      tagMode: savedState.tagMode,
-    };
-    setFilterState(seededFilter);
-    setExpandedState(savedState.expanded);
-    latestRef.current = { filter: seededFilter, expanded: savedState.expanded };
-  }, [savedState]);
+  useEffect(() => {}, [savedState]);
 
   const saveMutation = useBackendMutation(

[Killed] ConditionalExpression
src/main/utils/useFilteredSortedCitations.js:109:9
   );
 
   useEffect(() => {
-    if (!savedState || seededRef.current) return;
+    if (false) return;
     seededRef.current = true;
     const seededFilter = {
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] LogicalOperator
src/main/utils/useFilteredSortedCitations.js:109:9
   );
 
   useEffect(() => {
-    if (!savedState || seededRef.current) return;
+    if (!savedState && seededRef.current) return;
     seededRef.current = true;
     const seededFilter = {
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Timeout] BooleanLiteral
src/main/utils/useFilteredSortedCitations.js:110:25
 
   useEffect(() => {
     if (!savedState || seededRef.current) return;
-    seededRef.current = true;
+    seededRef.current = false;
     const seededFilter = {
       relevance: savedState.relevance,

[Timeout] ArrayDeclaration
src/main/utils/useFilteredSortedCitations.js:122:6
     setFilterState(seededFilter);
     setExpandedState(savedState.expanded);
     latestRef.current = { filter: seededFilter, expanded: savedState.expanded };
-  }, [savedState]);
+  }, []);
 
   const saveMutation = useBackendMutation(

[Timeout] ArrowFunction
src/main/utils/useFilteredSortedCitations.js:125:5
   }, [savedState]);
 
   const saveMutation = useBackendMutation(
-    ({ filter: f, expanded: e }) => ({
-      method: "POST",
-      url: "/api/citationfilterstate",
-      params: { projectId, scope, entryId },
-      data: { ...f, expanded: e },
-    }),
+    () => undefined,
     {},
   );

[Killed] ObjectLiteral
src/main/utils/useFilteredSortedCitations.js:125:38
   }, [savedState]);
 
   const saveMutation = useBackendMutation(
-    ({ filter: f, expanded: e }) => ({
-      method: "POST",
-      url: "/api/citationfilterstate",
-      params: { projectId, scope, entryId },
-      data: { ...f, expanded: e },
-    }),
+    ({ filter: f, expanded: e }) => ({}),
     {},
   );
killedBy: useFilteredSortedCitations with persistence autosaves the current filter/expanded on the next heartbeat after a change
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
src/main/utils/useFilteredSortedCitations.js:126:15
 
   const saveMutation = useBackendMutation(
     ({ filter: f, expanded: e }) => ({
-      method: "POST",
+      method: "",
       url: "/api/citationfilterstate",
       params: { projectId, scope, entryId },
killedBy: useFilteredSortedCitations with persistence autosaves the current filter/expanded on the next heartbeat after a change
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Timeout] BlockStatement
src/main/utils/useFilteredSortedCitations.js:134:19
     {},
   );
 
-  useEffect(() => {
-    if (!hasPersistence) return undefined;
-    const id = setInterval(() => {
-      if (dirtyRef.current) {
-        dirtyRef.current = false;
-        saveMutation.mutate(latestRef.current);
-      }
-      // Stryker disable next-line ArrayDeclaration : the interval must persist across
-      // re-renders, not reset on every filter/expanded change
-    }, autosaveIntervalMs);
-    return () => clearInterval(id);
-  }, [hasPersistence, autosaveIntervalMs, saveMutation]);
+  useEffect(() => {}, [hasPersistence, autosaveIntervalMs, saveMutation]);
 
   const visibleCitations = entries

[Killed] BooleanLiteral
src/main/utils/useFilteredSortedCitations.js:135:9
   );
 
   useEffect(() => {
-    if (!hasPersistence) return undefined;
+    if (hasPersistence) return undefined;
     const id = setInterval(() => {
       if (dirtyRef.current) {
killedBy: useFilteredSortedCitations with persistence autosaves the current filter/expanded on the next heartbeat after a change
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/main/utils/useFilteredSortedCitations.js:135:9
   );
 
   useEffect(() => {
-    if (!hasPersistence) return undefined;
+    if (true) return undefined;
     const id = setInterval(() => {
       if (dirtyRef.current) {
killedBy: useFilteredSortedCitations with persistence autosaves the current filter/expanded on the next heartbeat after a change
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/useFilteredSortedCitations.js:136:34
 
   useEffect(() => {
     if (!hasPersistence) return undefined;
-    const id = setInterval(() => {
-      if (dirtyRef.current) {
-        dirtyRef.current = false;
-        saveMutation.mutate(latestRef.current);
-      }
-      // Stryker disable next-line ArrayDeclaration : the interval must persist across
-      // re-renders, not reset on every filter/expanded change
-    }, autosaveIntervalMs);
+    const id = setInterval(() => {}, autosaveIntervalMs);
     return () => clearInterval(id);
   }, [hasPersistence, autosaveIntervalMs, saveMutation]);
killedBy: useFilteredSortedCitations with persistence autosaves the current filter/expanded on the next heartbeat after a change
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/main/utils/useFilteredSortedCitations.js:137:11
   useEffect(() => {
     if (!hasPersistence) return undefined;
     const id = setInterval(() => {
-      if (dirtyRef.current) {
+      if (false) {
         dirtyRef.current = false;
         saveMutation.mutate(latestRef.current);
killedBy: useFilteredSortedCitations with persistence autosaves the current filter/expanded on the next heartbeat after a change
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Timeout] ArrayDeclaration
src/main/utils/useFilteredSortedCitations.js:145:6
       // re-renders, not reset on every filter/expanded change
     }, autosaveIntervalMs);
     return () => clearInterval(id);
-  }, [hasPersistence, autosaveIntervalMs, saveMutation]);
+  }, []);
 
   const visibleCitations = entries
