[Killed] BooleanLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:40:55
 // preserved CITELINES_ field name used to persist each card's state onto the entry itself, e.g.
 // "card_bibtex" <-> CITELINES_card_bibtex = {Open|Closed}.
 const CARD_DEFS = [
-  { key: "bibtex", field: "card_bibtex", defaultOpen: true },
+  { key: "bibtex", field: "card_bibtex", defaultOpen: false },
   { key: "comments", field: "card_comments", defaultOpen: false },
   { key: "references", field: "card_references", defaultOpen: false },
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:40:10
 // preserved CITELINES_ field name used to persist each card's state onto the entry itself, e.g.
 // "card_bibtex" <-> CITELINES_card_bibtex = {Open|Closed}.
 const CARD_DEFS = [
-  { key: "bibtex", field: "card_bibtex", defaultOpen: true },
+  { key: "", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },
   { key: "references", field: "card_references", defaultOpen: false },
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  null

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:41:10
 // "card_bibtex" <-> CITELINES_card_bibtex = {Open|Closed}.
 const CARD_DEFS = [
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
-  { key: "comments", field: "card_comments", defaultOpen: false },
+  { key: "", field: "card_comments", defaultOpen: false },
   { key: "references", field: "card_references", defaultOpen: false },
   { key: "citations", field: "card_citations", defaultOpen: false },
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other three cards are closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  null

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:43:30
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },
   { key: "references", field: "card_references", defaultOpen: false },
-  { key: "citations", field: "card_citations", defaultOpen: false },
+  { key: "citations", field: "", defaultOpen: false },
 ];
 

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:64:22
         onClick={onToggle}
         role="button"
         aria-expanded={isOpen}
-        data-testid={`${testId}-header`}
+        data-testid={``}
         className="d-flex justify-content-between align-items-center"
         style={{ cursor: "pointer", ...headerStyle }}
killedBy: BibTexEntryShowPage tests shows an Edit button in the BibTex Entry card header formatted like the CitationTable's Edit button
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-BibtexCard-header"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:74:69
             {headerActions}
           </div>
         )}
-        <span data-testid={`${testId}-toggle-icon`}>{isOpen ? "▲" : "▼"}</span>
+        <span data-testid={`${testId}-toggle-icon`}>{isOpen ? "▲" : ""}</span>
       </Card.Header>
       <Collapse in={isOpen}>

[Killed] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:154:6
         clearTimeout(timer);
       };
     }
-  }, [getEntryFailed, navigate, projectId]);
+  }, []);
 
   const { data: project } = useBackend(
killedBy: BibTexEntryShowPage tests shows an error modal and returns to the project page when the entry cannot be fetched
statusReason: Unable to find an element with the text: Citation Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:194:45
     extractCitelinesFields(rawBibtex);
 
   const [cardOpenState, setCardOpenState] = useState(() =>
-    Object.fromEntries(CARD_DEFS.map((c) => [c.key, c.defaultOpen])),
+    Object.fromEntries(CARD_DEFS.map((c) => [])),
   );
 
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  null

[Killed] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:204:30
     if (!rawBibtex) return;
     setCardOpenState(
       Object.fromEntries(
-        CARD_DEFS.map((c) => [
-          c.key,
-          (preservedFields[`citelines_${c.field}`] ??
-            (c.defaultOpen ? "Open" : "Closed")) === "Open",
-        ]),
+        CARD_DEFS.map((c) => []),
       ),
     );
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  null

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:206:11
       Object.fromEntries(
         CARD_DEFS.map((c) => [
           c.key,
-          (preservedFields[`citelines_${c.field}`] ??
-            (c.defaultOpen ? "Open" : "Closed")) === "Open",
+          true,
         ]),
       ),
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  aria-expanded="true"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:207:54
         CARD_DEFS.map((c) => [
           c.key,
           (preservedFields[`citelines_${c.field}`] ??
-            (c.defaultOpen ? "Open" : "Closed")) === "Open",
+            (c.defaultOpen ? "Open" : "Closed")) === "",
         ]),
       ),
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:216:5
 
   const referencesQueryKey = `/api/citationedges/references?projectId=${projectId}&id=${entry?.id}`;
   const { data: references } = useBackend(
-    [referencesQueryKey],
+    [],
     {
       method: "GET",

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:227:29
     { refetchInterval: 5000, enabled: !!entry },
   );
 
-  const citationsQueryKey = `/api/citationedges/citations?projectId=${projectId}&id=${entry?.id}`;
+  const citationsQueryKey = ``;
   const { data: citations } = useBackend(
     [citationsQueryKey],

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:254:5
     { refetchInterval: 5000, enabled: !!entry },
   );
   const unresolvedReferencesCount = unresolved.filter(
-    (u) => u.direction === "reference",
+    () => undefined,
   ).length;
   const unresolvedCitationsCount = unresolved.filter(
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-references-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:371:32
             projectId={projectId}
             relatedEntryId={entry.id}
             relationship="citation"
-            mutationQueryKeys={[citationsQueryKey]}
+            mutationQueryKeys={[]}
           />
           <BulkCitationUploadModal

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:438:32
               <OverlayTrigger
                 placement="top"
                 overlay={
-                  <Tooltip id={`${testId}-get-references-tooltip`}>
+                  <Tooltip id={``}>
                     Get all papers that this paper cites
                   </Tooltip>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:509:30
                 variant="secondary"
                 autoFocus
                 onClick={() => setShowDeleteModal(false)}
-                data-testid={`${testId}-delete-modal-cancel-button`}
+                data-testid={``}
               >
                 No, Retain
killedBy: BibTexEntryShowPage tests shows a Delete button flush right at the top that opens a confirmation modal
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-delete-modal-cancel-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:549:29
                   <div
                     data-testid={`${testId}-PossibleDuplicatesCard-reason-${duplicateId}`}
                   >
-                    Reason:{" "}
+                    Reason:{""}
                     {formatDuplicateReason(entry.possibleDuplicateReason)}
                   </div>
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Reason: Similar Title
Received:
  Reason:Similar Title

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:617:18
             header={
               <span data-testid={`${testId}-references-heading`}>
                 References ({references.length})
-                {unresolvedReferencesCount > 0 && (
-                  <span
-                    className="text-warning ms-2"
-                    data-testid={`${testId}-references-unresolved-badge`}
-                  >
-                    — {unresolvedReferencesCount} unresolved
-                  </span>
-                )}
+                {true}
               </span>
             }
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-references-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:617:18
             header={
               <span data-testid={`${testId}-references-heading`}>
                 References ({references.length})
-                {unresolvedReferencesCount > 0 && (
+                {true && (
                   <span
                     className="text-warning ms-2"
killedBy: BibTexEntryShowPage tests shows no unresolved badge when there are no unresolved citations
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-warning ms-2"
  data-testid="BibTexEntryShowPage-references-unresolved-badge"
>
  — 
  0

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:665:21
           </CollapsibleCard>
 
           <CollapsibleCard
-            testId={`${testId}-RawEntryCard`}
+            testId={``}
             header="Raw BibTeX (debug)"
             isOpen={showRawEntry}
killedBy: BibTexEntryShowPage tests the Raw BibTeX (debug) card is closed by default
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-RawEntryCard-header"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
