[Killed] EqualityOperator
src/main/utils/duplicateFlags.js:25:5
 export function hasInvalidLinkFlag(entry) {
   return (
     entry.keyValuePairs?.CITELINES_invalid_doi === "True" ||
-    entry.keyValuePairs?.CITELINES_invalid_url === "True"
+    entry.keyValuePairs?.CITELINES_invalid_url !== "True"
   );
 }
killedBy: CitationTable tests the Flags column is empty for an entry with no flagged fields set
statusReason: expect(element).toHaveTextContent()

Checking with empty string will always match, use .toBeEmptyDOMElement() instead:

Received:
  link?
