[Killed] EqualityOperator
main/pages/Projects/BibTexEntryShowPage.jsx:741:18
             header={
               <span data-testid={`${testId}-citations-heading`}>
                 Citations ({citations.length})
-                {unresolvedCitationsCount > 0 && (
+                {unresolvedCitationsCount <= 0 && (
                   <span
                     className="text-warning ms-2"
killedBy: BibTexEntryShowPage tests shows no unresolved badge when there are no unresolved citations
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-warning ms-2"
  data-testid="BibTexEntryShowPage-citations-unresolved-badge"
>
  — 
  0

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:741:18
             header={
               <span data-testid={`${testId}-citations-heading`}>
                 Citations ({citations.length})
-                {unresolvedCitationsCount > 0 && (
-                  <span
-                    className="text-warning ms-2"
-                    data-testid={`${testId}-citations-unresolved-badge`}
-                  >
-                    — {unresolvedCitationsCount} unresolved
-                  </span>
-                )}
+                {true}
               </span>
             }
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-citations-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:758:23
               readOnly
               citations={citations}
               projectId={projectId}
-              testId={`${testId}-CitationsTable`}
+              testId={``}
               allTags={allTags}
             />
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-CitationsTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
