[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:19:41
 // The tab names used both as react-bootstrap's Tab eventKeys and as the ?tab= query
 // parameter's value, e.g. /project/4?tab=Tags (see issue #86) — using the same string for both
 // means no separate name<->key mapping is needed.
-const TAB_NAMES = ["Citations", "Jobs", "Collaborators", "Tags"];
+const TAB_NAMES = ["Citations", "Jobs", "", "Tags"];
 const DEFAULT_TAB = "Citations";
 
killedBy: ResearcherProjectShowPage tests opening the page with ?tab=Collaborators shows the Collaborators tab as active
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:19:33
 // The tab names used both as react-bootstrap's Tab eventKeys and as the ?tab= query
 // parameter's value, e.g. /project/4?tab=Tags (see issue #86) — using the same string for both
 // means no separate name<->key mapping is needed.
-const TAB_NAMES = ["Citations", "Jobs", "Collaborators", "Tags"];
+const TAB_NAMES = ["Citations", "", "Collaborators", "Tags"];
 const DEFAULT_TAB = "Citations";
 
killedBy: ResearcherProjectShowPage tests opening the page with ?tab=Jobs shows the Jobs tab as active
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:23:12
 const DEFAULT_TAB = "Citations";
 
 export default function ResearcherProjectShowPage({
-  testId = "ResearcherProjectShowPage",
+  testId = "",
 }) {
   const currentUser = useCurrentUser();
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] ConditionalExpression
main/pages/Projects/ResearcherProjectShowPage.jsx:48:28
     true,
   );
 
-  const getProjectFailed = projectBackendFailureCount > 0;
+  const getProjectFailed = true;
 
   // Stryker disable OptionalChaining -- project?.owner is more readable than project && project.owner

[Killed] ConditionalExpression
main/pages/Projects/ResearcherProjectShowPage.jsx:52:5
 
   // Stryker disable OptionalChaining -- project?.owner is more readable than project && project.owner
   const isOwner =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    currentUser?.root?.user?.email === project?.owner;
+    false;
   // Stryker enable OptionalChaining
 
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:86:27
         </Modal.Footer>
       </Modal>
       {!project ? (
-        <div data-testid={`${testId}-loading`}>Project: Loading...</div>
+        <div data-testid={``}>Project: Loading...</div>
       ) : (
         <div className="border rounded-3 p-4 mb-4 tabsGroup">
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BlockStatement
main/pages/Projects/ResearcherProjectShowPage.jsx:106:32
 
           <Tabs
             activeKey={activeTab}
-            onSelect={(tab) => {
-              if (tab) {
-                setSearchParams({ tab }, { replace: true });
-              }
-            }}
+            onSelect={(tab) => {}}
           >
             <Tab eventKey={"Citations"} title={"Citations"} className="pt-2">
killedBy: ResearcherProjectShowPage tests clicking a tab makes it active (and, per issue #86, updates the ?tab= query parameter)
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/pages/Projects/ResearcherProjectShowPage.jsx:107:24
           <Tabs
             activeKey={activeTab}
             onSelect={(tab) => {
-              if (tab) {
-                setSearchParams({ tab }, { replace: true });
-              }
+              if (tab) {}
             }}
           >
killedBy: ResearcherProjectShowPage tests clicking a tab makes it active (and, per issue #86, updates the ?tab= query parameter)
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/pages/Projects/ResearcherProjectShowPage.jsx:107:19
           <Tabs
             activeKey={activeTab}
             onSelect={(tab) => {
-              if (tab) {
+              if (false) {
                 setSearchParams({ tab }, { replace: true });
               }
killedBy: ResearcherProjectShowPage tests clicking a tab makes it active (and, per issue #86, updates the ?tab= query parameter)
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

Ignored nodes: comments, script, style

[Survived] BooleanLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:108:53
             activeKey={activeTab}
             onSelect={(tab) => {
               if (tab) {
-                setSearchParams({ tab }, { replace: true });
+                setSearchParams({ tab }, { replace: false });
               }
             }}

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:112:28
               }
             }}
           >
-            <Tab eventKey={"Citations"} title={"Citations"} className="pt-2">
+            <Tab eventKey={""} title={"Citations"} className="pt-2">
               <CitationsTabComponent
                 projectId={projectId}
killedBy: ResearcherProjectShowPage tests an unrecognized ?tab= value falls back to the default Citations tab
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:118:28
                 testIdPrefix={`${testId}-Citations`}
               />
             </Tab>
-            <Tab eventKey={"Jobs"} title={"Jobs"} className="pt-2">
+            <Tab eventKey={""} title={"Jobs"} className="pt-2">
               <JobsTabComponent
                 projectId={projectId}
killedBy: ResearcherProjectShowPage tests opening the page with ?tab=Jobs shows the Jobs tab as active
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:125:25
               />
             </Tab>
             <Tab
-              eventKey={"Collaborators"}
+              eventKey={""}
               title={"Collaborators"}
               className="pt-2"
killedBy: ResearcherProjectShowPage tests opening the page with ?tab=Collaborators shows the Collaborators tab as active
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:126:22
             </Tab>
             <Tab
               eventKey={"Collaborators"}
-              title={"Collaborators"}
+              title={""}
               className="pt-2"
             >
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element with the text: Collaborators. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:135:28
                 isOwner={isOwner}
               />
             </Tab>
-            <Tab eventKey={"Tags"} title={"Tags"} className="pt-2">
+            <Tab eventKey={""} title={"Tags"} className="pt-2">
               <TagsTabComponent
                 projectId={projectId}
killedBy: ResearcherProjectShowPage tests opening the page with ?tab=Tags shows the Tags tab as active
statusReason: expect(element).toHaveAttribute("aria-selected", "true") // element.getAttribute("aria-selected") === "true"

Expected the element to have attribute:
  aria-selected="true"
Received:
  aria-selected="false"

Ignored nodes: comments, script, style
