[Survived] ArrayDeclaration
components/Citations/TabComponent/CitationsTabComponent.jsx:27:5
 
   const tagsQueryKey = `/api/tags/project?projectId=${projectId}`;
   const { data: allTags } = useBackend(
-    [tagsQueryKey],
+    [],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: tagsQueryKey },

[Survived] ArrayDeclaration
components/Citations/TabComponent/CitationsTabComponent.jsx:49:28
         showModal={doiModal}
         toggleShowModal={showDoiModal}
         projectId={projectId}
-        mutationQueryKeys={[queryKey]}
+        mutationQueryKeys={[]}
       />
       <Row className="p-2">
