[NoCoverage] StringLiteral
main/components/Citations/CitationTable.jsx:69:16
     // Stryker disable next-line OptionalChaining : defensive coding for error shape
     if (error.response?.data?.message)
       toast(`Could not delete citation:\n${error.response.data.message}`);
-    else toast(`Could not delete citation:\n${error.message}`);
+    else toast(``);
   };
 

[Survived] StringLiteral
main/components/Citations/CitationTable.jsx:159:15
       },
     },
     {
-      header: "Link",
+      header: "",
       id: "link",
       accessorFn: (row) =>

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:171:28
               href={`https://doi.org/${doi}`}
               target="_blank"
               rel="noopener noreferrer"
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-doi-link`}
+              data-testid={``}
             >
               doi
killedBy: CitationTable tests renders expected columns, truncated citekey/author/title, year, and a doi link
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-doi-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:184:28
               href={url}
               target="_blank"
               rel="noopener noreferrer"
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-url-link`}
+              data-testid={``}
             >
               url
killedBy: CitationTable tests renders no doi link when the entry has no doi field but shows a url link when url is present
statusReason: Unable to find an element by: [data-testid="CitationTable-cell-row-0-col-url-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="CitationTable"

[Killed] ObjectLiteral
main/components/Citations/CitationTable.jsx:198:5
       id: "year",
       accessorFn: (row) => row.keyValuePairs?.year ?? "",
     },
-    {
-      header: "Author",
-      id: "author",
-      accessorFn: (row) =>
-        truncate(row.keyValuePairs?.author, AUTHOR_MAX_LENGTH),
-    },
+    {},
     {
       header: "Title",
killedBy: CitationTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Citations/CitationTable.jsx:206:11
     },
     {
       header: "Title",
-      id: "title",
+      id: "",
       accessorFn: (row) => truncate(row.keyValuePairs?.title, TITLE_MAX_LENGTH),
     },
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Survived] StringLiteral
main/components/Citations/CitationTable.jsx:272:78
             <Modal.Body>
               {entryToDelete && (
                 <p>
-                  Please confirm that you really want to delete the citation{" "}
+                  Please confirm that you really want to delete the citation{""}
                   <strong>{entryToDelete.citeKey}</strong>. This action cannot
                   be undone.
