[Killed] ArrayDeclaration
main/components/Tags/TagSelector.jsx:9:13
 import TagPill from "main/components/Tags/TagPill";
 
 export default function TagSelector({
-  allTags = [],
+  allTags = ["Stryker was here"],
   assignedTags = [],
   onAddTag = () => {},
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-no-available-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:24:24
 
   // Same query key TagsTabComponent uses for the project's tag list, so creating a tag here
   // invalidates/refreshes it too, regardless of which page's useBackend call owns that query.
-  const tagsQueryKey = `/api/tags/project?projectId=${projectId}`;
+  const tagsQueryKey = ``;
 
   const createTagMutation = useBackendMutation(
killedBy: TagSelector tests submitting the New Tag modal POSTs the new tag, toasts, closes the modal, and refreshes the tag list
statusReason: expected 1 to be 2 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class=""
    style=""

[Killed] LogicalOperator
main/components/Tags/TagSelector.jsx:64:10
         className="d-flex flex-wrap align-items-center gap-2"
         data-testid={`${testId}-assigned-tags`}
       >
-        {assignedTags.length === 0 && (
-          <span data-testid={`${testId}-no-tags`} className="text-muted">
-            No tags assigned
-          </span>
-        )}
+        {assignedTags.length === 0 || <span data-testid={`${testId}-no-tags`} className="text-muted">
+            No tags assigned
+          </span>}
         {assignedTags.map((tag) => (
           <span
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-no-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:64:10
         className="d-flex flex-wrap align-items-center gap-2"
         data-testid={`${testId}-assigned-tags`}
       >
-        {assignedTags.length === 0 && (
-          <span data-testid={`${testId}-no-tags`} className="text-muted">
-            No tags assigned
-          </span>
-        )}
+        {false}
         {assignedTags.map((tag) => (
           <span
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-no-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:69:27
             No tags assigned
           </span>
         )}
-        {assignedTags.map((tag) => (
-          <span
-            key={tag.id}
-            className="d-inline-flex align-items-center"
-            data-testid={`${testId}-assigned-tag-${tag.id}`}
-          >
-            <TagPill
-              tag={tag}
-              testId={`${testId}-assigned-tag-${tag.id}-badge`}
-            />
-            {canEdit && (
-              <button
-                type="button"
-                className="btn btn-link btn-sm p-0 ms-1 text-decoration-none"
-                aria-label={`Remove tag ${tag.tag}`}
-                data-testid={`${testId}-remove-tag-${tag.id}`}
-                onClick={() => onRemoveTag(tag)}
-              >
-                &times;
-              </button>
-            )}
-          </span>
-        ))}
+        {assignedTags.map(() => undefined)}
       </div>
       <div className="d-flex align-items-center gap-3 mt-2">
killedBy: TagSelector tests renders assigned tags as colored pill badges with contrast text
statusReason: Unable to find an element by: [data-testid="TagSelector-assigned-tag-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:73:26
           <span
             key={tag.id}
             className="d-inline-flex align-items-center"
-            data-testid={`${testId}-assigned-tag-${tag.id}`}
+            data-testid={``}
           >
             <TagPill
killedBy: BibTexEntryShowPage tests shows a TagSelector with the project's tags and the entry's assigned tags
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-TagSelector-assigned-tag-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:83:29
               <button
                 type="button"
                 className="btn btn-link btn-sm p-0 ms-1 text-decoration-none"
-                aria-label={`Remove tag ${tag.tag}`}
+                aria-label={``}
                 data-testid={`${testId}-remove-tag-${tag.id}`}
                 onClick={() => onRemoveTag(tag)}
killedBy: TagSelector tests clicking the remove button calls onRemoveTag with the tag
statusReason: expect(element).toHaveAttribute("aria-label", "Remove tag background") // element.getAttribute("aria-label") === "Remove tag background"

Expected the element to have attribute:
  aria-label="Remove tag background"
Received:
  aria-label=""

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:104:16
               Add Tag
             </Dropdown.Toggle>
             <Dropdown.Menu>
-              {availableTags.length === 0 && (
-                <Dropdown.Item
-                  disabled
-                  data-testid={`${testId}-no-available-tags`}
-                >
-                  No more tags available
-                </Dropdown.Item>
-              )}
+              {true}
               {availableTags.map((tag) => (
                 <Dropdown.Item
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-no-available-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:112:34
                   No more tags available
                 </Dropdown.Item>
               )}
-              {availableTags.map((tag) => (
-                <Dropdown.Item
-                  key={tag.id}
-                  as="button"
-                  type="button"
-                  data-testid={`${testId}-available-tag-${tag.id}`}
-                  onClick={() => onAddTag(tag)}
-                >
-                  <TagPill
-                    tag={tag}
-                    testId={`${testId}-available-tag-${tag.id}-badge`}
-                  />
-                  {tag.explanation && (
-                    <span className="ms-2 small text-muted">
-                      {tag.explanation}
-                    </span>
-                  )}
-                </Dropdown.Item>
-              ))}
+              {availableTags.map(() => undefined)}
             </Dropdown.Menu>
           </Dropdown>
killedBy: TagSelector tests dropdown lists only unassigned tags, with pill and explanation
statusReason: Unable to find an element by: [data-testid="TagSelector-available-tag-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] LogicalOperator
main/components/Tags/TagSelector.jsx:124:20
                     tag={tag}
                     testId={`${testId}-available-tag-${tag.id}-badge`}
                   />
-                  {tag.explanation && (
-                    <span className="ms-2 small text-muted">
-                      {tag.explanation}
-                    </span>
-                  )}
+                  {tag.explanation || <span className="ms-2 small text-muted">
+                      {tag.explanation}
+                    </span>}
                 </Dropdown.Item>
               ))}
killedBy: TagSelector tests an available tag with no explanation shows no tooltip and no muted description text in the dropdown
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="ms-2 small text-muted"
/> instead

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:124:20
                     tag={tag}
                     testId={`${testId}-available-tag-${tag.id}-badge`}
                   />
-                  {tag.explanation && (
-                    <span className="ms-2 small text-muted">
-                      {tag.explanation}
-                    </span>
-                  )}
+                  {true}
                 </Dropdown.Item>
               ))}
killedBy: TagSelector tests dropdown lists only unassigned tags, with pill and explanation
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Provides background/related work for the topic.
Received:
  background

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:134:10
             </Dropdown.Menu>
           </Dropdown>
         )}
-        {canEdit && (
-          <Button
-            variant="outline-secondary"
-            size="sm"
-            onClick={() => setShowNewTagModal(true)}
-            data-testid={`${testId}-new-tag-button`}
-          >
-            New Tag
-          </Button>
-        )}
+        {false}
         <a
           href={`/project/${projectId}?tab=Tags`}
killedBy: TagSelector tests clicking New Tag opens the create-tag modal
statusReason: Unable to find an element by: [data-testid="TagSelector-new-tag-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:139:26
             variant="outline-secondary"
             size="sm"
             onClick={() => setShowNewTagModal(true)}
-            data-testid={`${testId}-new-tag-button`}
+            data-testid={``}
           >
             New Tag
killedBy: TagSelector tests clicking New Tag opens the create-tag modal
statusReason: Unable to find an element by: [data-testid="TagSelector-new-tag-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:148:24
           href={`/project/${projectId}?tab=Tags`}
           target="_blank"
           rel="noopener noreferrer"
-          data-testid={`${testId}-manage-tags-link`}
+          data-testid={``}
         >
           Manage Tags
killedBy: TagSelector tests manage tags link points to the project page's Tags tab and opens in a new tab
statusReason: Unable to find an element by: [data-testid="TagSelector-manage-tags-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >
