[Killed] BooleanLiteral
main/components/Citations/CitationFilter.jsx:24:44
   allTags = [],
   testId = "CitationFilter",
 }) {
-  const [expanded, setExpanded] = useState(true);
+  const [expanded, setExpanded] = useState(false);
 
   const update = (patch) => onChange({ ...filter, ...patch });
killedBy: CitationFilter tests renders expanded by default, showing 'Citation Filters' and a ▲ toggle icon
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Citation Filters
Received:
  citation filters▼

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:26:18
 }) {
   const [expanded, setExpanded] = useState(true);
 
-  const update = (patch) => onChange({ ...filter, ...patch });
+  const update = () => undefined;
 
   const toggleRelevance = (option) => {
killedBy: CitationFilter tests clicking a relevance button toggles it on and off via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] ObjectLiteral
main/components/Citations/CitationFilter.jsx:26:38
 }) {
   const [expanded, setExpanded] = useState(true);
 
-  const update = (patch) => onChange({ ...filter, ...patch });
+  const update = (patch) => onChange({});
 
   const toggleRelevance = (option) => {
killedBy: CitationFilter tests clicking a relevance button toggles it on and off via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

  [
-   {

[Killed] BlockStatement
main/components/Citations/CitationFilter.jsx:28:39
 
   const update = (patch) => onChange({ ...filter, ...patch });
 
-  const toggleRelevance = (option) => {
-    update({
-      relevance: filter.relevance.includes(option)
-        ? filter.relevance.filter((r) => r !== option)
-        : [...filter.relevance, option],
-    });
-  };
+  const toggleRelevance = (option) => {};
 
   const selectedTagIds = new Set(filter.tagIds);
killedBy: CitationFilter tests clicking a relevance button toggles it on and off via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:31:42
   const toggleRelevance = (option) => {
     update({
       relevance: filter.relevance.includes(option)
-        ? filter.relevance.filter((r) => r !== option)
+        ? filter.relevance.filter((r) => true)
         : [...filter.relevance, option],
     });
killedBy: CitationFilter tests clicking a relevance button toggles it on and off via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

@@ -1,10 +1,11 @@
  [

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:31:42
   const toggleRelevance = (option) => {
     update({
       relevance: filter.relevance.includes(option)
-        ? filter.relevance.filter((r) => r !== option)
+        ? filter.relevance.filter((r) => false)
         : [...filter.relevance, option],
     });
killedBy: CitationFilter tests clicking a relevance button toggles it on and off via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

  [
    {

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:37:39
   };
 
   const selectedTagIds = new Set(filter.tagIds);
-  const selectedTags = allTags.filter((tag) => selectedTagIds.has(tag.id));
+  const selectedTags = allTags.filter(() => undefined);
   const availableTags = allTags.filter((tag) => !selectedTagIds.has(tag.id));
 
killedBy: CitationFilter tests shows a pill for each selected tag, and only unselected tags in the Add Tag dropdown
statusReason: Unable to find an element by: [data-testid="CitationFilter-selected-tag-1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] MethodExpression
main/components/Citations/CitationFilter.jsx:37:24
   };
 
   const selectedTagIds = new Set(filter.tagIds);
-  const selectedTags = allTags.filter((tag) => selectedTagIds.has(tag.id));
+  const selectedTags = allTags;
   const availableTags = allTags.filter((tag) => !selectedTagIds.has(tag.id));
 
killedBy: CitationFilter tests shows 'No tags selected' when no tags are in the filter
statusReason: Unable to find an element by: [data-testid="CitationFilter-no-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:38:40
 
   const selectedTagIds = new Set(filter.tagIds);
   const selectedTags = allTags.filter((tag) => selectedTagIds.has(tag.id));
-  const availableTags = allTags.filter((tag) => !selectedTagIds.has(tag.id));
+  const availableTags = allTags.filter(() => undefined);
 
   const addTag = (tag) => {
killedBy: CitationFilter tests shows a pill for each selected tag, and only unselected tags in the Add Tag dropdown
statusReason: Unable to find an element by: [data-testid="CitationFilter-available-tag-2-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] MethodExpression
main/components/Citations/CitationFilter.jsx:38:25
 
   const selectedTagIds = new Set(filter.tagIds);
   const selectedTags = allTags.filter((tag) => selectedTagIds.has(tag.id));
-  const availableTags = allTags.filter((tag) => !selectedTagIds.has(tag.id));
+  const availableTags = allTags;
 
   const addTag = (tag) => {
killedBy: CitationFilter tests shows a pill for each selected tag, and only unselected tags in the Add Tag dropdown
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="dropdown-item"
  data-rr-ui-dropdown-item=""
  data-testid="CitationFilter-available-tag-1"
  type="button"
>

[Killed] BlockStatement
main/components/Citations/CitationFilter.jsx:40:27
   const selectedTags = allTags.filter((tag) => selectedTagIds.has(tag.id));
   const availableTags = allTags.filter((tag) => !selectedTagIds.has(tag.id));
 
-  const addTag = (tag) => {
-    if (!selectedTagIds.has(tag.id)) {
-      update({ tagIds: [...filter.tagIds, tag.id] });
-    }
-  };
+  const addTag = (tag) => {};
 
   const removeTag = (tag) => {
killedBy: CitationFilter tests clicking an available tag in the dropdown adds it to tagIds via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:41:9
   const availableTags = allTags.filter((tag) => !selectedTagIds.has(tag.id));
 
   const addTag = (tag) => {
-    if (!selectedTagIds.has(tag.id)) {
+    if (false) {
       update({ tagIds: [...filter.tagIds, tag.id] });
     }
killedBy: CitationFilter tests clicking an available tag in the dropdown adds it to tagIds via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] BooleanLiteral
main/components/Citations/CitationFilter.jsx:41:9
   const availableTags = allTags.filter((tag) => !selectedTagIds.has(tag.id));
 
   const addTag = (tag) => {
-    if (!selectedTagIds.has(tag.id)) {
+    if (selectedTagIds.has(tag.id)) {
       update({ tagIds: [...filter.tagIds, tag.id] });
     }
killedBy: CitationFilter tests clicking an available tag in the dropdown adds it to tagIds via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] BlockStatement
main/components/Citations/CitationFilter.jsx:46:30
     }
   };
 
-  const removeTag = (tag) => {
-    update({ tagIds: filter.tagIds.filter((id) => id !== tag.id) });
-  };
+  const removeTag = (tag) => {};
 
   return (
killedBy: CitationFilter tests clicking the remove button on a selected tag removes it from tagIds via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:47:51
   };
 
   const removeTag = (tag) => {
-    update({ tagIds: filter.tagIds.filter((id) => id !== tag.id) });
+    update({ tagIds: filter.tagIds.filter((id) => false) });
   };
 
killedBy: CitationFilter tests clicking the remove button on a selected tag removes it from tagIds via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

@@ -8,11 +8,9 @@
        "Low",

[Killed] EqualityOperator
main/components/Citations/CitationFilter.jsx:47:51
   };
 
   const removeTag = (tag) => {
-    update({ tagIds: filter.tagIds.filter((id) => id !== tag.id) });
+    update({ tagIds: filter.tagIds.filter((id) => id === tag.id) });
   };
 
killedBy: CitationFilter tests clicking the remove button on a selected tag removes it from tagIds via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Received:

  1st vi.fn() call:

@@ -9,10 +9,10 @@
        "None",

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:54:18
     <div data-testid={testId}>
       <div
         role="button"
-        onClick={() => setExpanded((prev) => !prev)}
+        onClick={() => undefined}
         data-testid={`${testId}-header`}
         className="d-flex justify-content-between align-items-center border rounded-3 p-2 mb-2"
killedBy: CitationFilter tests clicking the header twice collapses then re-expands the panel, updating the label and icon each time
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  citation filters
Received:
  Citation Filters▲

[Killed] BooleanLiteral
main/components/Citations/CitationFilter.jsx:54:46
     <div data-testid={testId}>
       <div
         role="button"
-        onClick={() => setExpanded((prev) => !prev)}
+        onClick={() => setExpanded((prev) => prev)}
         data-testid={`${testId}-header`}
         className="d-flex justify-content-between align-items-center border rounded-3 p-2 mb-2"
killedBy: CitationFilter tests clicking the header twice collapses then re-expands the panel, updating the label and icon each time
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  citation filters
Received:
  Citation Filters▲

[Survived] StringLiteral
main/components/Citations/CitationFilter.jsx:57:26
         onClick={() => setExpanded((prev) => !prev)}
         data-testid={`${testId}-header`}
         className="d-flex justify-content-between align-items-center border rounded-3 p-2 mb-2"
-        style={{ cursor: "pointer" }}
+        style={{ cursor: "" }}
       >
         <strong>{expanded ? "Citation Filters" : "citation filters"}</strong>

[Survived] ObjectLiteral
main/components/Citations/CitationFilter.jsx:57:16
         onClick={() => setExpanded((prev) => !prev)}
         data-testid={`${testId}-header`}
         className="d-flex justify-content-between align-items-center border rounded-3 p-2 mb-2"
-        style={{ cursor: "pointer" }}
+        style={{}}
       >
         <strong>{expanded ? "Citation Filters" : "citation filters"}</strong>

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:60:28
         style={{ cursor: "pointer" }}
       >
         <strong>{expanded ? "Citation Filters" : "citation filters"}</strong>
-        <span data-testid={`${testId}-toggle-icon`}>
+        <span data-testid={``}>
           {expanded ? "▲" : "▼"}
         </span>
killedBy: CitationFilter tests renders expanded by default, showing 'Citation Filters' and a ▲ toggle icon
statusReason: Unable to find an element by: [data-testid="CitationFilter-toggle-icon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:61:23
       >
         <strong>{expanded ? "Citation Filters" : "citation filters"}</strong>
         <span data-testid={`${testId}-toggle-icon`}>
-          {expanded ? "▲" : "▼"}
+          {expanded ? "" : "▼"}
         </span>
       </div>
killedBy: CitationFilter tests renders expanded by default, showing 'Citation Filters' and a ▲ toggle icon
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  ▲
Received:

[Killed] BlockStatement
main/components/Citations/CitationFilter.jsx:69:50
           <div className="border rounded-3 p-3 mb-3">
             <div className="mb-3">
               <div className="fw-semibold mb-1">Relevance</div>
-              {RELEVANCE_OPTIONS.map((option) => {
-                const selected = filter.relevance.includes(option);
-                return (
-                  <Button
-                    key={option}
-                    size="sm"
-                    variant={selected ? "primary" : "outline-primary"}
-                    aria-pressed={selected}
-                    className="me-1"
-                    onClick={() => toggleRelevance(option)}
-                    data-testid={`${testId}-relevance-${option}`}
-                  >
-                    {option}
-                  </Button>
-                );
-              })}
+              {RELEVANCE_OPTIONS.map((option) => {})}
             </div>
 
killedBy: CitationFilter tests clicking a relevance button toggles it on and off via onChange
statusReason: Unable to find an element by: [data-testid="CitationFilter-relevance-High"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:78:30
                     variant={selected ? "primary" : "outline-primary"}
                     aria-pressed={selected}
                     className="me-1"
-                    onClick={() => toggleRelevance(option)}
+                    onClick={() => undefined}
                     data-testid={`${testId}-relevance-${option}`}
                   >
killedBy: CitationFilter tests clicking a relevance button toggles it on and off via onChange
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:89:49
 
             <div className="mb-3">
               <div className="fw-semibold mb-1">Links</div>
-              {CITATION_FILTER_LINK_OPTIONS.map((option) => (
-                <Form.Check
-                  key={option}
-                  inline
-                  type="radio"
-                  name={`${testId}-link`}
-                  id={`${testId}-link-${option}`}
-                  label={option}
-                  checked={filter.link === option}
-                  onChange={() => update({ link: option })}
-                  data-testid={`${testId}-link-${option}`}
-                />
-              ))}
+              {CITATION_FILTER_LINK_OPTIONS.map(() => undefined)}
             </div>
 
killedBy: CitationFilter tests selecting a link radio option calls onChange with the new link value
statusReason: Unable to find an element by: [data-testid="CitationFilter-link-doi"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:97:28
                   name={`${testId}-link`}
                   id={`${testId}-link-${option}`}
                   label={option}
-                  checked={filter.link === option}
+                  checked={true}
                   onChange={() => update({ link: option })}
                   data-testid={`${testId}-link-${option}`}
killedBy: CitationFilter tests selecting a link radio option calls onChange with the new link value
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] EqualityOperator
main/components/Citations/CitationFilter.jsx:97:28
                   name={`${testId}-link`}
                   id={`${testId}-link-${option}`}
                   label={option}
-                  checked={filter.link === option}
+                  checked={filter.link !== option}
                   onChange={() => update({ link: option })}
                   data-testid={`${testId}-link-${option}`}
killedBy: CitationFilter tests selecting a link radio option calls onChange with the new link value
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:98:29
                   id={`${testId}-link-${option}`}
                   label={option}
                   checked={filter.link === option}
-                  onChange={() => update({ link: option })}
+                  onChange={() => undefined}
                   data-testid={`${testId}-link-${option}`}
                 />
killedBy: CitationFilter tests selecting a link radio option calls onChange with the new link value
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:106:54
 
             <div className="mb-3">
               <div className="fw-semibold mb-1">Duplicates</div>
-              {CITATION_FILTER_DUPLICATE_OPTIONS.map((option) => (
-                <Form.Check
-                  key={option}
-                  inline
-                  type="radio"
-                  name={`${testId}-duplicates`}
-                  id={`${testId}-duplicates-${option}`}
-                  label={option}
-                  checked={filter.duplicates === option}
-                  onChange={() => update({ duplicates: option })}
-                  data-testid={`${testId}-duplicates-${option}`}
-                />
-              ))}
+              {CITATION_FILTER_DUPLICATE_OPTIONS.map(() => undefined)}
             </div>
 
killedBy: CitationFilter tests each Duplicates radio has the correct name/id and reflects the current filter value
statusReason: Unable to find an element by: [data-testid="CitationFilter-duplicates-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] EqualityOperator
main/components/Citations/CitationFilter.jsx:114:28
                   name={`${testId}-duplicates`}
                   id={`${testId}-duplicates-${option}`}
                   label={option}
-                  checked={filter.duplicates === option}
+                  checked={filter.duplicates !== option}
                   onChange={() => update({ duplicates: option })}
                   data-testid={`${testId}-duplicates-${option}`}
killedBy: CitationFilter tests each Duplicates radio has the correct name/id and reflects the current filter value
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CitationFilter-duplicates-all"
  id="CitationFilter-duplicates-all"

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:114:28
                   name={`${testId}-duplicates`}
                   id={`${testId}-duplicates-${option}`}
                   label={option}
-                  checked={filter.duplicates === option}
+                  checked={false}
                   onChange={() => update({ duplicates: option })}
                   data-testid={`${testId}-duplicates-${option}`}
killedBy: CitationFilter tests each Duplicates radio has the correct name/id and reflects the current filter value
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="CitationFilter-duplicates-dup"
  id="CitationFilter-duplicates-dup"
  name="CitationFilter-duplicates"

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:115:29
                   id={`${testId}-duplicates-${option}`}
                   label={option}
                   checked={filter.duplicates === option}
-                  onChange={() => update({ duplicates: option })}
+                  onChange={() => undefined}
                   data-testid={`${testId}-duplicates-${option}`}
                 />
killedBy: CitationFilter tests selecting a duplicates radio option calls onChange with the new duplicates value
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:116:32
                   label={option}
                   checked={filter.duplicates === option}
                   onChange={() => update({ duplicates: option })}
-                  data-testid={`${testId}-duplicates-${option}`}
+                  data-testid={``}
                 />
               ))}
killedBy: CitationFilter tests each Duplicates radio has the correct name/id and reflects the current filter value
statusReason: Unable to find an element by: [data-testid="CitationFilter-duplicates-all"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:122:36
             </div>
 
             <div className="mb-3">
-              <Form.Label htmlFor={`${testId}-search`}>
+              <Form.Label htmlFor={``}>
                 Search (author/title)
               </Form.Label>
killedBy: CitationFilter tests the search field's label is correctly associated with the input
statusReason: Found a label with the text of: Search (author/title), however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:127:30
               </Form.Label>
               <Form.Control
                 id={`${testId}-search`}
-                data-testid={`${testId}-search`}
+                data-testid={``}
                 type="text"
                 value={filter.search}
killedBy: CitationFilter tests the search field's label is correctly associated with the input
statusReason: Unable to find an element by: [data-testid="CitationFilter-search"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:130:27
                 data-testid={`${testId}-search`}
                 type="text"
                 value={filter.search}
-                onChange={(e) => update({ search: e.target.value })}
+                onChange={() => undefined}
               />
             </div>
killedBy: CitationFilter tests typing in the search field calls onChange with the new search text
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:140:25
                 <Form.Check
                   inline
                   type="radio"
-                  name={`${testId}-tagMode`}
+                  name={``}
                   id={`${testId}-tagMode-and`}
                   label="and"
killedBy: CitationFilter tests each tagMode radio has the correct name/id and reflects the current filter value, and 'or' can be re-selected
statusReason: expect(element).toHaveAttribute("name", "CitationFilter-tagMode") // element.getAttribute("name") === "CitationFilter-tagMode"

Expected the element to have attribute:
  name="CitationFilter-tagMode"
Received:
  name=""

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:143:28
                   name={`${testId}-tagMode`}
                   id={`${testId}-tagMode-and`}
                   label="and"
-                  checked={filter.tagMode === "and"}
+                  checked={false}
                   onChange={() => update({ tagMode: "and" })}
                   data-testid={`${testId}-tagMode-and`}
killedBy: CitationFilter tests each tagMode radio has the correct name/id and reflects the current filter value, and 'or' can be re-selected
statusReason: expect(element).toBeChecked()

Received element is not checked:
  <input
  class="form-check-input"
  data-testid="CitationFilter-tagMode-and"
  id="CitationFilter-tagMode-and"
  name="CitationFilter-tagMode"

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:143:28
                   name={`${testId}-tagMode`}
                   id={`${testId}-tagMode-and`}
                   label="and"
-                  checked={filter.tagMode === "and"}
+                  checked={true}
                   onChange={() => update({ tagMode: "and" })}
                   data-testid={`${testId}-tagMode-and`}
killedBy: CitationFilter tests selecting the tag 'and'/'or' mode calls onChange with the new tagMode
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:144:29
                   id={`${testId}-tagMode-and`}
                   label="and"
                   checked={filter.tagMode === "and"}
-                  onChange={() => update({ tagMode: "and" })}
+                  onChange={() => undefined}
                   data-testid={`${testId}-tagMode-and`}
                 />
killedBy: CitationFilter tests selecting the tag 'and'/'or' mode calls onChange with the new tagMode
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:151:23
                   inline
                   type="radio"
                   name={`${testId}-tagMode`}
-                  id={`${testId}-tagMode-or`}
+                  id={``}
                   label="or"
                   checked={filter.tagMode === "or"}
killedBy: CitationFilter tests each tagMode radio has the correct name/id and reflects the current filter value, and 'or' can be re-selected
statusReason: expect(element).toHaveAttribute("id", "CitationFilter-tagMode-or") // element.getAttribute("id") === "CitationFilter-tagMode-or"

Expected the element to have attribute:
  id="CitationFilter-tagMode-or"
Received:
  null

[Killed] ConditionalExpression
main/components/Citations/CitationFilter.jsx:153:28
                   name={`${testId}-tagMode`}
                   id={`${testId}-tagMode-or`}
                   label="or"
-                  checked={filter.tagMode === "or"}
+                  checked={true}
                   onChange={() => update({ tagMode: "or" })}
                   data-testid={`${testId}-tagMode-or`}
killedBy: CitationFilter tests each tagMode radio has the correct name/id and reflects the current filter value, and 'or' can be re-selected
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CitationFilter-tagMode-or"
  id="CitationFilter-tagMode-or"

[Killed] EqualityOperator
main/components/Citations/CitationFilter.jsx:153:28
                   name={`${testId}-tagMode`}
                   id={`${testId}-tagMode-or`}
                   label="or"
-                  checked={filter.tagMode === "or"}
+                  checked={filter.tagMode !== "or"}
                   onChange={() => update({ tagMode: "or" })}
                   data-testid={`${testId}-tagMode-or`}
killedBy: CitationFilter tests each tagMode radio has the correct name/id and reflects the current filter value, and 'or' can be re-selected
statusReason: expect(element).not.toBeChecked()

Received element is checked:
  <input
  checked=""
  class="form-check-input"
  data-testid="CitationFilter-tagMode-or"
  id="CitationFilter-tagMode-or"

[Killed] ArrowFunction
main/components/Citations/CitationFilter.jsx:154:29
                   id={`${testId}-tagMode-or`}
                   label="or"
                   checked={filter.tagMode === "or"}
-                  onChange={() => update({ tagMode: "or" })}
+                  onChange={() => undefined}
                   data-testid={`${testId}-tagMode-or`}
                 />
killedBy: CitationFilter tests each tagMode radio has the correct name/id and reflects the current filter value, and 'or' can be re-selected
statusReason: expected "vi.fn()" to be called with arguments: [ { …(6) } ]

Number of calls: 0

[Killed] StringLiteral
main/components/Citations/CitationFilter.jsx:160:30
               </div>
               <div
                 className="d-flex flex-wrap align-items-center gap-2 mb-2"
-                data-testid={`${testId}-selected-tags`}
+                data-testid={``}
               >
                 {selectedTags.length === 0 && (
killedBy: CitationFilter tests shows a pill for each selected tag, and only unselected tags in the Add Tag dropdown
statusReason: Unable to find an element by: [data-testid="CitationFilter-selected-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >

[Killed] EqualityOperator
main/components/Citations/CitationFilter.jsx:162:18
                 className="d-flex flex-wrap align-items-center gap-2 mb-2"
                 data-testid={`${testId}-selected-tags`}
               >
-                {selectedTags.length === 0 && (
+                {selectedTags.length !== 0 && (
                   <span
                     className="text-muted"
killedBy: CitationFilter tests shows 'No tags selected' when no tags are in the filter
statusReason: Unable to find an element by: [data-testid="CitationFilter-no-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="CitationFilter"
    >
