[Killed] StringLiteral
main/components/Tags/TagModal.jsx:72:28
               Explanation (optional)
             </Form.Label>
             <Form.Control
-              data-testid={`${testId}-explanation`}
+              data-testid={``}
               id="explanation"
               as="textarea"
killedBy: TagModal tests submits with entered values
statusReason: Unable to find an element by: [data-testid="TagModal-explanation"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Tags/TagModal.jsx:76:28
               id="explanation"
               as="textarea"
               rows={3}
-              {...register("explanation")}
+              {...register("")}
             />
           </Form.Group>
killedBy: TagSelector tests clicking New Tag opens the create-tag modal
statusReason: Cannot read properties of undefined (reading '_f')
