[Killed] ConditionalExpression
main/components/Tags/TagPill.jsx:11:17
 // actually present (explanation is optional), so hovering a description-less tag never pops up
 // an empty tooltip bubble.
 export default function TagPill({ tag, testId }) {
-  const color = tag.color || DEFAULT_TAG_COLOR;
+  const color = true;
   const badge = (
     <Badge
killedBy: CitationTable tests the Tags column shows a pill badge, in the assigned color, for each assigned tag
statusReason: expect(element).toHaveStyle()

- Expected

- background-color: rgb(30, 136, 229);

[Killed] ConditionalExpression
main/components/Tags/TagPill.jsx:11:17
 // actually present (explanation is optional), so hovering a description-less tag never pops up
 // an empty tooltip bubble.
 export default function TagPill({ tag, testId }) {
-  const color = tag.color || DEFAULT_TAG_COLOR;
+  const color = false;
   const badge = (
     <Badge
killedBy: CitationTable tests the Tags column shows a pill badge, in the assigned color, for each assigned tag
statusReason: expect(element).toHaveStyle()

- Expected

- background-color: rgb(30, 136, 229);

[Killed] BooleanLiteral
main/components/Tags/TagPill.jsx:27:7
     </Badge>
   );
 
-  if (!tag.explanation) {
+  if (tag.explanation) {
     return badge;
   }
killedBy: TagSelector tests shows explanation tooltip when hovering over an assigned tag
statusReason: Unable to find an element with the text: Describes the research methodology used in the paper.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] BlockStatement
main/components/Tags/TagPill.jsx:27:25
     </Badge>
   );
 
-  if (!tag.explanation) {
-    return badge;
-  }
+  if (!tag.explanation) {}
 
   return (
killedBy: TagSelector tests an assigned tag with no explanation shows no tooltip
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="fade show tooltip bs-tooltip-top"
  id="TagSelector-assigned-tag-9-badge-tooltip"
  role="tooltip"
  x-placement="top"
>

[Killed] StringLiteral
main/components/Tags/TagPill.jsx:34:29
   return (
     <OverlayTrigger
       placement="top"
-      overlay={<Tooltip id={`${testId}-tooltip`}>{tag.explanation}</Tooltip>}
+      overlay={<Tooltip id={``}>{tag.explanation}</Tooltip>}
     >
       <span>{badge}</span>
killedBy: TagSelector tests shows explanation tooltip when hovering over an assigned tag
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null
