[Survived] ArrayDeclaration
main/components/Citations/AbstractEditModal.jsx:12:23
   toggleShowModal,
   projectId,
   entry,
-  mutationQueryKeys = [],
+  mutationQueryKeys = ["Stryker was here"],
   testId = "AbstractEditModal",
 }) {

[Killed] StringLiteral
main/components/Citations/AbstractEditModal.jsx:13:12
   projectId,
   entry,
   mutationQueryKeys = [],
-  testId = "AbstractEditModal",
+  testId = "",
 }) {
   const [abstractText, setAbstractText] = useState("");
killedBy: AbstractEditModal tests pre-fills the textarea with the entry's existing abstract
statusReason: Unable to find an element by: [data-testid="AbstractEditModal-abstract"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] BlockStatement
main/components/Citations/AbstractEditModal.jsx:17:19
 }) {
   const [abstractText, setAbstractText] = useState("");
 
-  useEffect(() => {
-    if (showModal) {
-      setAbstractText(entry?.keyValuePairs?.abstract ?? "");
-    }
-  }, [showModal, entry]);
+  useEffect(() => {}, [showModal, entry]);
 
   const closeModal = () => toggleShowModal(false);
killedBy: BibTexEntryShowPage tests clicking the Abstract Edit button opens the AbstractEditModal pre-filled with the current abstract
statusReason: expect(element).toHaveValue(Existing abstract text.)

Expected the element to have value:
  Existing abstract text.
Received:

[Killed] BlockStatement
main/components/Citations/AbstractEditModal.jsx:18:20
   const [abstractText, setAbstractText] = useState("");
 
   useEffect(() => {
-    if (showModal) {
-      setAbstractText(entry?.keyValuePairs?.abstract ?? "");
-    }
+    if (showModal) {}
   }, [showModal, entry]);
 
killedBy: BibTexEntryShowPage tests clicking the Abstract Edit button opens the AbstractEditModal pre-filled with the current abstract
statusReason: expect(element).toHaveValue(Existing abstract text.)

Expected the element to have value:
  Existing abstract text.
Received:

[Killed] ConditionalExpression
main/components/Citations/AbstractEditModal.jsx:18:9
   const [abstractText, setAbstractText] = useState("");
 
   useEffect(() => {
-    if (showModal) {
+    if (false) {
       setAbstractText(entry?.keyValuePairs?.abstract ?? "");
     }
killedBy: BibTexEntryShowPage tests clicking the Abstract Edit button opens the AbstractEditModal pre-filled with the current abstract
statusReason: expect(element).toHaveValue(Existing abstract text.)

Expected the element to have value:
  Existing abstract text.
Received:

[Killed] LogicalOperator
main/components/Citations/AbstractEditModal.jsx:19:23
 
   useEffect(() => {
     if (showModal) {
-      setAbstractText(entry?.keyValuePairs?.abstract ?? "");
+      setAbstractText(entry?.keyValuePairs?.abstract && "");
     }
   }, [showModal, entry]);
killedBy: BibTexEntryShowPage tests clicking the Abstract Edit button opens the AbstractEditModal pre-filled with the current abstract
statusReason: expect(element).toHaveValue(Existing abstract text.)

Expected the element to have value:
  Existing abstract text.
Received:

[Survived] OptionalChaining
main/components/Citations/AbstractEditModal.jsx:19:23
 
   useEffect(() => {
     if (showModal) {
-      setAbstractText(entry?.keyValuePairs?.abstract ?? "");
+      setAbstractText(entry.keyValuePairs?.abstract ?? "");
     }
   }, [showModal, entry]);

[Killed] ArrayDeclaration
main/components/Citations/AbstractEditModal.jsx:21:6
     if (showModal) {
       setAbstractText(entry?.keyValuePairs?.abstract ?? "");
     }
-  }, [showModal, entry]);
+  }, []);
 
   const closeModal = () => toggleShowModal(false);
killedBy: BibTexEntryShowPage tests clicking the Abstract Edit button opens the AbstractEditModal pre-filled with the current abstract
statusReason: expect(element).toHaveValue(Existing abstract text.)

Expected the element to have value:
  Existing abstract text.
Received:

[Killed] BooleanLiteral
main/components/Citations/AbstractEditModal.jsx:23:44
     }
   }, [showModal, entry]);
 
-  const closeModal = () => toggleShowModal(false);
+  const closeModal = () => toggleShowModal(true);
 
   const updateAbstractMutation = useBackendMutation(
killedBy: AbstractEditModal tests clicking Cancel closes the modal without saving
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received:

  1st vi.fn() call:

  [
-   false,

[Killed] ArrowFunction
main/components/Citations/AbstractEditModal.jsx:23:22
     }
   }, [showModal, entry]);
 
-  const closeModal = () => toggleShowModal(false);
+  const closeModal = () => undefined;
 
   const updateAbstractMutation = useBackendMutation(
killedBy: AbstractEditModal tests clicking Cancel closes the modal without saving
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Number of calls: 0

[Killed] ArrowFunction
main/components/Citations/AbstractEditModal.jsx:26:5
   const closeModal = () => toggleShowModal(false);
 
   const updateAbstractMutation = useBackendMutation(
-    () => ({
-      url: "/api/bibtexentries/abstract",
-      method: "PATCH",
-      params: { id: entry?.id, projectId },
-      data: abstractText,
-      headers: { "Content-Type": "text/plain" },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: BibTexEntryShowPage tests saving a new abstract via the modal PATCHes it and refetches the entry
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ObjectLiteral
main/components/Citations/AbstractEditModal.jsx:26:12
   const closeModal = () => toggleShowModal(false);
 
   const updateAbstractMutation = useBackendMutation(
-    () => ({
-      url: "/api/bibtexentries/abstract",
-      method: "PATCH",
-      params: { id: entry?.id, projectId },
-      data: abstractText,
-      headers: { "Content-Type": "text/plain" },
-    }),
+    () => ({}),
     {
       onSuccess: () => {
killedBy: AbstractEditModal tests editing and clicking Save PATCHes the new abstract text and closes the modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Survived] OptionalChaining
main/components/Citations/AbstractEditModal.jsx:29:21
     () => ({
       url: "/api/bibtexentries/abstract",
       method: "PATCH",
-      params: { id: entry?.id, projectId },
+      params: { id: entry.id, projectId },
       data: abstractText,
       headers: { "Content-Type": "text/plain" },

[Killed] ObjectLiteral
main/components/Citations/AbstractEditModal.jsx:29:15
     () => ({
       url: "/api/bibtexentries/abstract",
       method: "PATCH",
-      params: { id: entry?.id, projectId },
+      params: {},
       data: abstractText,
       headers: { "Content-Type": "text/plain" },
killedBy: AbstractEditModal tests editing and clicking Save PATCHes the new abstract text and closes the modal
statusReason: expected {} to deeply equal { Object (id, projectId) }

[Survived] ObjectLiteral
main/components/Citations/AbstractEditModal.jsx:31:16
       method: "PATCH",
       params: { id: entry?.id, projectId },
       data: abstractText,
-      headers: { "Content-Type": "text/plain" },
+      headers: {},
     }),
     {

[Killed] ObjectLiteral
main/components/Citations/AbstractEditModal.jsx:33:5
       data: abstractText,
       headers: { "Content-Type": "text/plain" },
     }),
-    {
-      onSuccess: () => {
-        toast("Abstract updated successfully");
-        closeModal();
-      },
-    },
+    {},
     mutationQueryKeys,
   );
killedBy: AbstractEditModal tests editing and clicking Save PATCHes the new abstract text and closes the modal
statusReason: expected "vi.fn()" to be called with arguments: [ 'Abstract updated successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Citations/AbstractEditModal.jsx:34:24
       headers: { "Content-Type": "text/plain" },
     }),
     {
-      onSuccess: () => {
-        toast("Abstract updated successfully");
-        closeModal();
-      },
+      onSuccess: () => {},
     },
     mutationQueryKeys,
killedBy: AbstractEditModal tests editing and clicking Save PATCHes the new abstract text and closes the modal
statusReason: expected "vi.fn()" to be called with arguments: [ 'Abstract updated successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Citations/AbstractEditModal.jsx:35:15
     }),
     {
       onSuccess: () => {
-        toast("Abstract updated successfully");
+        toast("");
         closeModal();
       },
killedBy: AbstractEditModal tests editing and clicking Save PATCHes the new abstract text and closes the modal
statusReason: expected "vi.fn()" to be called with arguments: [ 'Abstract updated successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Abstract updated successfully",

[Survived] StringLiteral
main/components/Citations/AbstractEditModal.jsx:49:32
       </Modal.Header>
       <Modal.Body>
         <Form.Group>
-          <Form.Label htmlFor={`${testId}-abstract`}>Abstract</Form.Label>
+          <Form.Label htmlFor={``}>Abstract</Form.Label>
           <Form.Control
             id={`${testId}-abstract`}

[Survived] StringLiteral
main/components/Citations/AbstractEditModal.jsx:55:45
             data-testid={`${testId}-abstract`}
             as="textarea"
             rows={10}
-            style={{ width: "100%", resize: "vertical" }}
+            style={{ width: "100%", resize: "" }}
             value={abstractText}
             onChange={(e) => setAbstractText(e.target.value)}

[Killed] ArrowFunction
main/components/Citations/AbstractEditModal.jsx:57:23
             rows={10}
             style={{ width: "100%", resize: "vertical" }}
             value={abstractText}
-            onChange={(e) => setAbstractText(e.target.value)}
+            onChange={() => undefined}
           />
         </Form.Group>
killedBy: BibTexEntryShowPage tests saving a new abstract via the modal PATCHes it and refetches the entry
statusReason: expected '' to be 'A brand new abstract.' // Object.is equality

[Killed] StringLiteral
main/components/Citations/AbstractEditModal.jsx:65:24
         <Button
           variant="secondary"
           onClick={closeModal}
-          data-testid={`${testId}-cancel`}
+          data-testid={``}
         >
           Cancel
killedBy: AbstractEditModal tests clicking Cancel closes the modal without saving
statusReason: Unable to find an element by: [data-testid="AbstractEditModal-cancel"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ArrowFunction
main/components/Citations/AbstractEditModal.jsx:71:20
         </Button>
         <Button
           variant="primary"
-          onClick={() => updateAbstractMutation.mutate({})}
+          onClick={() => undefined}
           data-testid={`${testId}-submit`}
         >
killedBy: BibTexEntryShowPage tests saving a new abstract via the modal PATCHes it and refetches the entry
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"
