[Killed] BlockStatement
main/components/Citations/BibTexEntryComments.jsx:162:31
 
   const handleRestoreClick = () => {
     restoreMutation.mutate(undefined, {
-      onSuccess: (updated) => {
-        finishEditing(updated);
-        setShowPreviousVersionModal(false);
-      },
+      onSuccess: (updated) => {},
     });
   };
killedBy: BibTexEntryComments tests Restore this Version discards the draft and returns to view mode showing the published comments
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-rendered"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Survived] BooleanLiteral
main/components/Citations/BibTexEntryComments.jsx:164:37
     restoreMutation.mutate(undefined, {
       onSuccess: (updated) => {
         finishEditing(updated);
-        setShowPreviousVersionModal(false);
+        setShowPreviousVersionModal(true);
       },
     });

[Killed] BlockStatement
main/components/Citations/BibTexEntryComments.jsx:169:35
     });
   };
 
-  function finishEditing(updated) {
-    setLocalEntry(updated);
-    setForceEdit(false);
-  }
+  function finishEditing(updated) {}
 
   const canCancel = mode === "edit" && !hasDraft && hasComments;
killedBy: BibTexEntryComments tests clicking Save when not dirty saves directly, without an autosave PUT first
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-rendered"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] BooleanLiteral
main/components/Citations/BibTexEntryComments.jsx:171:18
 
   function finishEditing(updated) {
     setLocalEntry(updated);
-    setForceEdit(false);
+    setForceEdit(true);
   }
 
killedBy: BibTexEntryComments tests clicking Save when not dirty saves directly, without an autosave PUT first
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-rendered"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] EqualityOperator
main/components/Citations/BibTexEntryComments.jsx:174:21
     setForceEdit(false);
   }
 
-  const canCancel = mode === "edit" && !hasDraft && hasComments;
+  const canCancel = mode !== "edit" && !hasDraft && hasComments;
   const canSeePreviousVersion = mode === "edit" && hasComments && hasDraft;
 
killedBy: BibTexEntryComments tests clicking Edit switches to edit mode, pre-filled with the existing comments, with a Cancel button and no Draft badge
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-cancel-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryComments.jsx:174:21
     setForceEdit(false);
   }
 
-  const canCancel = mode === "edit" && !hasDraft && hasComments;
+  const canCancel = false;
   const canSeePreviousVersion = mode === "edit" && hasComments && hasDraft;
 
killedBy: BibTexEntryComments tests clicking Edit switches to edit mode, pre-filled with the existing comments, with a Cancel button and no Draft badge
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-cancel-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryComments.jsx:175:33
   }
 
   const canCancel = mode === "edit" && !hasDraft && hasComments;
-  const canSeePreviousVersion = mode === "edit" && hasComments && hasDraft;
+  const canSeePreviousVersion = true;
 
   if (mode === "view") {
killedBy: BibTexEntryComments tests shows an empty editor, no Draft badge, and no See-previous-version button when neither comments nor draft exist
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-outline-secondary btn-sm"
  data-testid="BibTexEntryComments-see-previous-version-button"
  type="button"
>
  See previous version

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryComments.jsx:175:33
   }
 
   const canCancel = mode === "edit" && !hasDraft && hasComments;
-  const canSeePreviousVersion = mode === "edit" && hasComments && hasDraft;
+  const canSeePreviousVersion = true && hasDraft;
 
   if (mode === "view") {
killedBy: BibTexEntryComments tests shows a side-by-side editor and preview with a Draft badge, and no See-previous-version button, when only a draft exists
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-outline-secondary btn-sm"
  data-testid="BibTexEntryComments-see-previous-version-button"
  type="button"
>
  See previous version

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryComments.jsx:177:7
   const canCancel = mode === "edit" && !hasDraft && hasComments;
   const canSeePreviousVersion = mode === "edit" && hasComments && hasDraft;
 
-  if (mode === "view") {
+  if (false) {
     return (
       <div data-testid={`${testId}-base`}>
killedBy: BibTexEntryComments tests shows rendered markdown and an Edit button when only comments exist
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-rendered"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] EqualityOperator
main/components/Citations/BibTexEntryComments.jsx:177:7
   const canCancel = mode === "edit" && !hasDraft && hasComments;
   const canSeePreviousVersion = mode === "edit" && hasComments && hasDraft;
 
-  if (mode === "view") {
+  if (mode !== "view") {
     return (
       <div data-testid={`${testId}-base`}>
killedBy: BibTexEntryComments tests shows an empty editor, no Draft badge, and no See-previous-version button when neither comments nor draft exist
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-editor-pane"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Survived] ArrayDeclaration
main/components/Citations/BibTexEntryComments.jsx:191:41
           </Button>
         </div>
         <div data-testid={`${testId}-rendered`}>
-          <ReactMarkdown remarkPlugins={[remarkGfm]}>
+          <ReactMarkdown remarkPlugins={[]}>
             {commentsOf(localEntry)}
           </ReactMarkdown>

[Killed] StringLiteral
main/components/Citations/BibTexEntryComments.jsx:203:56
     <div data-testid={`${testId}-base`}>
       <div className="d-flex justify-content-between align-items-center mb-2">
         {hasDraft ? (
-          <Badge bg="warning" text="dark" data-testid={`${testId}-draft-badge`}>
+          <Badge bg="warning" text="dark" data-testid={``}>
             Draft
           </Badge>
killedBy: BibTexEntryComments tests shows a side-by-side editor and preview with a Draft badge, and no See-previous-version button, when only a draft exists
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-draft-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryComments.jsx:210:12
           <span />
         )}
         <div className="d-flex gap-2">
-          {canSeePreviousVersion && (
-            <Button
-              variant="outline-secondary"
-              size="sm"
-              onClick={() => setShowPreviousVersionModal(true)}
-              data-testid={`${testId}-see-previous-version-button`}
-            >
-              See previous version
-            </Button>
-          )}
+          {false}
           {canCancel && (
             <Button
killedBy: BibTexEntryComments tests shows the See-previous-version button when both comments and a draft exist
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-see-previous-version-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryComments.jsx:210:12
           <span />
         )}
         <div className="d-flex gap-2">
-          {canSeePreviousVersion && (
-            <Button
-              variant="outline-secondary"
-              size="sm"
-              onClick={() => setShowPreviousVersionModal(true)}
-              data-testid={`${testId}-see-previous-version-button`}
-            >
-              See previous version
-            </Button>
-          )}
+          {true}
           {canCancel && (
             <Button
killedBy: BibTexEntryComments tests shows the See-previous-version button when both comments and a draft exist
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-see-previous-version-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] BooleanLiteral
main/components/Citations/BibTexEntryComments.jsx:214:58
             <Button
               variant="outline-secondary"
               size="sm"
-              onClick={() => setShowPreviousVersionModal(true)}
+              onClick={() => setShowPreviousVersionModal(false)}
               data-testid={`${testId}-see-previous-version-button`}
             >
killedBy: BibTexEntryComments tests See previous version modal shows the published markdown; Return to Editor closes it
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-PreviousVersionModal-source"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] ArrowFunction
main/components/Citations/BibTexEntryComments.jsx:214:24
             <Button
               variant="outline-secondary"
               size="sm"
-              onClick={() => setShowPreviousVersionModal(true)}
+              onClick={() => undefined}
               data-testid={`${testId}-see-previous-version-button`}
             >
killedBy: BibTexEntryComments tests See previous version modal shows the published markdown; Return to Editor closes it
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-PreviousVersionModal-source"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] LogicalOperator
main/components/Citations/BibTexEntryComments.jsx:220:12
               See previous version
             </Button>
           )}
-          {canCancel && (
-            <Button
-              variant="outline-secondary"
-              size="sm"
-              onClick={handleCancelClick}
-              data-testid={`${testId}-cancel-button`}
-            >
-              Cancel
-            </Button>
-          )}
+          {canCancel || <Button variant="outline-secondary" size="sm" onClick={handleCancelClick} data-testid={`${testId}-cancel-button`}>
+              Cancel
+            </Button>}
           <Button
             variant="primary"
killedBy: BibTexEntryComments tests clicking Edit switches to edit mode, pre-filled with the existing comments, with a Cancel button and no Draft badge
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-cancel-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryComments.jsx:220:12
               See previous version
             </Button>
           )}
-          {canCancel && (
-            <Button
-              variant="outline-secondary"
-              size="sm"
-              onClick={handleCancelClick}
-              data-testid={`${testId}-cancel-button`}
-            >
-              Cancel
-            </Button>
-          )}
+          {true}
           <Button
             variant="primary"
killedBy: BibTexEntryComments tests clicking Edit switches to edit mode, pre-filled with the existing comments, with a Cancel button and no Draft badge
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-cancel-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="BibTexEntryComments-base"
    >

[Survived] ArrayDeclaration
main/components/Citations/BibTexEntryComments.jsx:254:43
             className="border rounded-3 p-3 h-100"
             data-testid={`${testId}-preview-pane`}
           >
-            <ReactMarkdown remarkPlugins={[remarkGfm]}>
+            <ReactMarkdown remarkPlugins={[]}>
               {draftText}
             </ReactMarkdown>

[Killed] ArrowFunction
main/components/Citations/BibTexEntryComments.jsx:263:17
 
       <PreviousVersionModal
         show={showPreviousVersionModal}
-        onHide={() => setShowPreviousVersionModal(false)}
+        onHide={() => undefined}
         publishedMarkdown={commentsOf(localEntry)}
         onRestore={handleRestoreClick}
killedBy: BibTexEntryComments tests See previous version modal shows the published markdown; Return to Editor closes it
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <pre
  class="border rounded-3 p-3"
  data-testid="BibTexEntryComments-PreviousVersionModal-source"
  style="white-space: pre-wrap;"
>
  ## Summary

[Killed] BooleanLiteral
main/components/Citations/BibTexEntryComments.jsx:263:51
 
       <PreviousVersionModal
         show={showPreviousVersionModal}
-        onHide={() => setShowPreviousVersionModal(false)}
+        onHide={() => setShowPreviousVersionModal(true)}
         publishedMarkdown={commentsOf(localEntry)}
         onRestore={handleRestoreClick}
killedBy: BibTexEntryComments tests See previous version modal shows the published markdown; Return to Editor closes it
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <pre
  class="border rounded-3 p-3"
  data-testid="BibTexEntryComments-PreviousVersionModal-source"
  style="white-space: pre-wrap;"
>
  ## Summary
