[Killed] OptionalChaining
main/components/Citations/BibTexEntryLink.jsx:10:15
   keyValuePairs,
   testId = "BibTexEntryLink",
 }) {
-  const doi = keyValuePairs?.doi;
+  const doi = keyValuePairs.doi;
   const url = keyValuePairs?.url;
 
killedBy: BulkCitationUploadModal tests renders the title, instructions, and an empty textarea
statusReason: Cannot read properties of undefined (reading 'doi')

[Killed] OptionalChaining
main/components/Citations/BibTexEntryLink.jsx:11:15
   testId = "BibTexEntryLink",
 }) {
   const doi = keyValuePairs?.doi;
-  const url = keyValuePairs?.url;
+  const url = keyValuePairs.url;
 
   if (doi) {
killedBy: BulkCitationUploadModal tests renders the title, instructions, and an empty textarea
statusReason: Cannot read properties of undefined (reading 'url')

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryLink.jsx:13:7
   const doi = keyValuePairs?.doi;
   const url = keyValuePairs?.url;
 
-  if (doi) {
+  if (true) {
     const href = `https://doi.org/${doi}`;
     return (
killedBy: BulkCitationUploadModal tests shows no paper link when keyValuePairs has neither doi nor url
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a
  data-testid="BulkCitationUploadModal-doi-link"
  href="https://doi.org/undefined"
  rel="noopener noreferrer"
  target="_blank"
>

[Killed] BlockStatement
main/components/Citations/BibTexEntryLink.jsx:13:12
   const doi = keyValuePairs?.doi;
   const url = keyValuePairs?.url;
 
-  if (doi) {
-    const href = `https://doi.org/${doi}`;
-    return (
-      <p className="mb-3">
-        <a
-          href={href}
-          target="_blank"
-          rel="noopener noreferrer"
-          data-testid={`${testId}-doi-link`}
-        >
-          {href}
-        </a>
-      </p>
-    );
-  }
+  if (doi) {}
 
   if (url) {
killedBy: BibTexEntryShowPage tests shows a BibTexEntryLink with the entry's keyValuePairs right below the header
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-doi-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryLink.jsx:29:7
     );
   }
 
-  if (url) {
+  if (false) {
     return (
       <p className="mb-3">
killedBy: BibTexEntryLink tests renders the full URL as a hyperlink when the entry has no DOI but has a URL
statusReason: Unable to find an element by: [data-testid="BibTexEntryLink-url-link"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>
