[Survived] ArrayDeclaration
main/components/Citations/BibTexEntryModal.jsx:20:23
   toggleShowModal,
   projectId,
   entryToEdit = null,
-  mutationQueryKeys = [],
+  mutationQueryKeys = ["Stryker was here"],
   relatedEntryId = null,
   relationship = null,

[Survived] BooleanLiteral
main/components/Citations/BibTexEntryModal.jsx:32:58
   } = useForm({ defaultValues: { bibtex: "", relevance: DEFAULT_RELEVANCE } });
 
   const [parseError, setParseError] = useState(null);
-  const [loadingExisting, setLoadingExisting] = useState(false);
+  const [loadingExisting, setLoadingExisting] = useState(true);
   // CITELINES_* fields other than relevance (e.g. position/references/citations), stripped out
   // of the displayed BibTeX text on load and restored verbatim on submit. Not form state, since

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryModal.jsx:41:7
   const isEditing = Boolean(entryToEdit);
   const modalTitle = isEditing
     ? "Edit Citation"
-    : relationship === "reference"
+    : true
       ? "Add Reference"
       : "Add Citation";
killedBy: BibTexEntryModal tests renders the Add Citation title, an empty textarea, and a Relevance dropdown defaulting to Unreviewed
statusReason: Unable to find an element with the text: Add Citation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] EqualityOperator
main/components/Citations/BibTexEntryModal.jsx:41:7
   const isEditing = Boolean(entryToEdit);
   const modalTitle = isEditing
     ? "Edit Citation"
-    : relationship === "reference"
+    : relationship !== "reference"
       ? "Add Reference"
       : "Add Citation";
killedBy: BibTexEntryModal tests renders the Add Citation title, an empty textarea, and a Relevance dropdown defaulting to Unreviewed
statusReason: Unable to find an element with the text: Add Citation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] BooleanLiteral
main/components/Citations/BibTexEntryModal.jsx:46:9
       : "Add Citation";
 
   useEffect(() => {
-    if (!showModal) {
+    if (showModal) {
       return;
     }
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: expect(element).toHaveValue(@article{smith2020,
  title = {Existing}
}
)

Expected the element to have value:
  @article{smith2020,
    title = {Existing}

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryModal.jsx:46:9
       : "Add Citation";
 
   useEffect(() => {
-    if (!showModal) {
+    if (true) {
       return;
     }
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: expect(element).toHaveValue(@article{smith2020,
  title = {Existing}
}
)

Expected the element to have value:
  @article{smith2020,
    title = {Existing}

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryModal.jsx:50:9
       return;
     }
     setParseError(null);
-    if (isEditing) {
+    if (false) {
       setLoadingExisting(true);
       axios
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: expect(element).toHaveValue(@article{smith2020,
  title = {Existing}
}
)

Expected the element to have value:
  @article{smith2020,
    title = {Existing}

[Killed] BlockStatement
main/components/Citations/BibTexEntryModal.jsx:50:20
       return;
     }
     setParseError(null);
-    if (isEditing) {
-      setLoadingExisting(true);
-      axios
-        .get("/api/bibtexentries/export", {
-          params: { id: entryToEdit.id, projectId: projectId },
-        })
-        .then((response) => {
-          const { strippedBibtex, relevance, preservedFields } =
-            extractCitelinesFields(response.data);
-          preservedFieldsRef.current = preservedFields;
-          reset({ bibtex: strippedBibtex, relevance });
-        })
-        .catch(() => {
-          setParseError("Could not load the existing citation for editing.");
-        })
-        .finally(() => setLoadingExisting(false));
-    } else {
+    if (isEditing) {} else {
       preservedFieldsRef.current = {};
       reset({ bibtex: "", relevance: DEFAULT_RELEVANCE });
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: expect(element).toHaveValue(@article{smith2020,
  title = {Existing}
}
)

Expected the element to have value:
  @article{smith2020,
    title = {Existing}

[Survived] BooleanLiteral
main/components/Citations/BibTexEntryModal.jsx:51:26
     }
     setParseError(null);
     if (isEditing) {
-      setLoadingExisting(true);
+      setLoadingExisting(false);
       axios
         .get("/api/bibtexentries/export", {

[Killed] ObjectLiteral
main/components/Citations/BibTexEntryModal.jsx:53:43
     if (isEditing) {
       setLoadingExisting(true);
       axios
-        .get("/api/bibtexentries/export", {
-          params: { id: entryToEdit.id, projectId: projectId },
-        })
+        .get("/api/bibtexentries/export", {})
         .then((response) => {
           const { strippedBibtex, relevance, preservedFields } =
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: expected undefined to deeply equal { Object (id, projectId) }

[Killed] BlockStatement
main/components/Citations/BibTexEntryModal.jsx:56:29
         .get("/api/bibtexentries/export", {
           params: { id: entryToEdit.id, projectId: projectId },
         })
-        .then((response) => {
-          const { strippedBibtex, relevance, preservedFields } =
-            extractCitelinesFields(response.data);
-          preservedFieldsRef.current = preservedFields;
-          reset({ bibtex: strippedBibtex, relevance });
-        })
+        .then((response) => {})
         .catch(() => {
           setParseError("Could not load the existing citation for editing.");
killedBy: BibTexEntryShowPage tests clicking the Edit button opens the edit modal, and submitting PUTs the updated bibtex
statusReason: expected '' to contain 'A Very Long Title'

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ObjectLiteral
main/components/Citations/BibTexEntryModal.jsx:60:17
           const { strippedBibtex, relevance, preservedFields } =
             extractCitelinesFields(response.data);
           preservedFieldsRef.current = preservedFields;
-          reset({ bibtex: strippedBibtex, relevance });
+          reset({});
         })
         .catch(() => {
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: expect(element).toHaveValue(@article{smith2020,
  title = {Existing}
}
)

Expected the element to have value:
  @article{smith2020,
    title = {Existing}

[Killed] BlockStatement
main/components/Citations/BibTexEntryModal.jsx:62:22
           preservedFieldsRef.current = preservedFields;
           reset({ bibtex: strippedBibtex, relevance });
         })
-        .catch(() => {
-          setParseError("Could not load the existing citation for editing.");
-        })
+        .catch(() => {})
         .finally(() => setLoadingExisting(false));
     } else {
killedBy: BibTexEntryModal tests shows a fallback error message when fetching the existing entry fails
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Survived] ArrowFunction
main/components/Citations/BibTexEntryModal.jsx:65:18
         .catch(() => {
           setParseError("Could not load the existing citation for editing.");
         })
-        .finally(() => setLoadingExisting(false));
+        .finally(() => undefined);
     } else {
       preservedFieldsRef.current = {};

[Survived] BooleanLiteral
main/components/Citations/BibTexEntryModal.jsx:65:43
         .catch(() => {
           setParseError("Could not load the existing citation for editing.");
         })
-        .finally(() => setLoadingExisting(false));
+        .finally(() => setLoadingExisting(true));
     } else {
       preservedFieldsRef.current = {};

[Survived] BlockStatement
main/components/Citations/BibTexEntryModal.jsx:66:12
           setParseError("Could not load the existing citation for editing.");
         })
         .finally(() => setLoadingExisting(false));
-    } else {
-      preservedFieldsRef.current = {};
-      reset({ bibtex: "", relevance: DEFAULT_RELEVANCE });
-    }
+    } else {}
     // Stryker disable next-line ArrayDeclaration : re-running this effect on every render
     // (e.g. by omitting isEditing) would refetch/reset on unrelated re-renders.

[Killed] BlockStatement
main/components/Citations/BibTexEntryModal.jsx:74:45
     // (e.g. by omitting isEditing) would refetch/reset on unrelated re-renders.
   }, [showModal, entryToEdit, projectId, isEditing, reset]);
 
-  const objectToAxiosParams = (formData) => {
-    if (isEditing) {
-      return {
-        url: "/api/bibtexentries",
-        method: "PUT",
-        params: { id: entryToEdit.id, projectId: projectId },
-        data: formData.bibtex,
-        headers: { "Content-Type": "text/plain" },
-      };
-    }
-    return {
-      url: "/api/bibtexentries/post",
-      method: "POST",
-      params:
-        relatedEntryId && relationship
-          ? { projectId: projectId, relatedEntryId, relationship }
-          : { projectId: projectId },
-      data: formData.bibtex,
-      headers: { "Content-Type": "text/plain" },
-    };
-  };
+  const objectToAxiosParams = (formData) => {};
 
   const closeModal = () => {
killedBy: BibTexEntryShowPage tests clicking Add Reference opens the modal, and submitting posts with relationship=reference
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] BlockStatement
main/components/Citations/BibTexEntryModal.jsx:75:20
   }, [showModal, entryToEdit, projectId, isEditing, reset]);
 
   const objectToAxiosParams = (formData) => {
-    if (isEditing) {
-      return {
-        url: "/api/bibtexentries",
-        method: "PUT",
-        params: { id: entryToEdit.id, projectId: projectId },
-        data: formData.bibtex,
-        headers: { "Content-Type": "text/plain" },
-      };
-    }
+    if (isEditing) {}
     return {
       url: "/api/bibtexentries/post",
killedBy: BibTexEntryShowPage tests clicking the Edit button opens the edit modal, and submitting PUTs the updated bibtex
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryModal.jsx:75:9
   }, [showModal, entryToEdit, projectId, isEditing, reset]);
 
   const objectToAxiosParams = (formData) => {
-    if (isEditing) {
+    if (false) {
       return {
         url: "/api/bibtexentries",
killedBy: BibTexEntryModal tests re-injects the (possibly changed) relevance and any other preserved CITELINES_ fields on submit
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Survived] StringLiteral
main/components/Citations/BibTexEntryModal.jsx:81:36
         method: "PUT",
         params: { id: entryToEdit.id, projectId: projectId },
         data: formData.bibtex,
-        headers: { "Content-Type": "text/plain" },
+        headers: { "Content-Type": "" },
       };
     }

[Killed] ObjectLiteral
main/components/Citations/BibTexEntryModal.jsx:84:12
         headers: { "Content-Type": "text/plain" },
       };
     }
-    return {
-      url: "/api/bibtexentries/post",
-      method: "POST",
-      params:
-        relatedEntryId && relationship
-          ? { projectId: projectId, relatedEntryId, relationship }
-          : { projectId: projectId },
-      data: formData.bibtex,
-      headers: { "Content-Type": "text/plain" },
-    };
+    return {};
   };
 
killedBy: BibTexEntryShowPage tests clicking Add Reference opens the modal, and submitting posts with relationship=reference
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryModal.jsx:88:9
       url: "/api/bibtexentries/post",
       method: "POST",
       params:
-        relatedEntryId && relationship
+        false
           ? { projectId: projectId, relatedEntryId, relationship }
           : { projectId: projectId },
killedBy: BibTexEntryShowPage tests clicking Add Reference opens the modal, and submitting posts with relationship=reference
statusReason: expected { projectId: '1' } to deeply equal { projectId: '1', …(2) }

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryModal.jsx:88:9
       url: "/api/bibtexentries/post",
       method: "POST",
       params:
-        relatedEntryId && relationship
+        true
           ? { projectId: projectId, relatedEntryId, relationship }
           : { projectId: projectId },
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected { projectId: 1, …(2) } to deeply equal { projectId: 1 }

[Killed] ObjectLiteral
main/components/Citations/BibTexEntryModal.jsx:90:13
       params:
         relatedEntryId && relationship
           ? { projectId: projectId, relatedEntryId, relationship }
-          : { projectId: projectId },
+          : {},
       data: formData.bibtex,
       headers: { "Content-Type": "text/plain" },
killedBy: CitationsTabComponent tests clicking Add Citation via BibTex opens a create modal and posting adds a citation
statusReason: expected {} to deeply equal { projectId: 1 }

[Survived] ObjectLiteral
main/components/Citations/BibTexEntryModal.jsx:92:16
           ? { projectId: projectId, relatedEntryId, relationship }
           : { projectId: projectId },
       data: formData.bibtex,
-      headers: { "Content-Type": "text/plain" },
+      headers: {},
     };
   };

[Killed] BlockStatement
main/components/Citations/BibTexEntryModal.jsx:96:28
     };
   };
 
-  const closeModal = () => {
-    setParseError(null);
-    toggleShowModal(false);
-  };
+  const closeModal = () => {};
 
   const onSuccess = () => {
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Number of calls: 0

[Killed] BooleanLiteral
main/components/Citations/BibTexEntryModal.jsx:98:21
 
   const closeModal = () => {
     setParseError(null);
-    toggleShowModal(false);
+    toggleShowModal(true);
   };
 
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received:

  1st vi.fn() call:

  [
-   false,

[Killed] BlockStatement
main/components/Citations/BibTexEntryModal.jsx:101:27
     toggleShowModal(false);
   };
 
-  const onSuccess = () => {
-    toast(
-      isEditing
-        ? "Citation updated successfully"
-        : relationship === "reference"
-          ? "Reference added successfully"
-          : "Citation added successfully",
-    );
-    closeModal();
-  };
+  const onSuccess = () => {};
 
   const onError = (error) => {
killedBy: BibTexEntryShowPage tests clicking the Edit button opens the edit modal, and submitting PUTs the updated bibtex
statusReason: expected "vi.fn()" to be called with arguments: [ 'Citation updated successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head>

[Killed] StringLiteral
main/components/Citations/BibTexEntryModal.jsx:104:11
   const onSuccess = () => {
     toast(
       isEditing
-        ? "Citation updated successfully"
+        ? ""
         : relationship === "reference"
           ? "Reference added successfully"
killedBy: BibTexEntryShowPage tests clicking the Edit button opens the edit modal, and submitting PUTs the updated bibtex
statusReason: expected "vi.fn()" to be called with arguments: [ 'Citation updated successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Citation updated successfully",

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryModal.jsx:105:11
     toast(
       isEditing
         ? "Citation updated successfully"
-        : relationship === "reference"
+        : false
           ? "Reference added successfully"
           : "Citation added successfully",
killedBy: BibTexEntryModal tests when relationship is 'reference', shows the Add Reference title and includes relatedEntryId/relationship in the POST
statusReason: expected "vi.fn()" to be called with arguments: [ 'Reference added successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Reference added successfully",

[Killed] EqualityOperator
main/components/Citations/BibTexEntryModal.jsx:105:11
     toast(
       isEditing
         ? "Citation updated successfully"
-        : relationship === "reference"
+        : relationship !== "reference"
           ? "Reference added successfully"
           : "Citation added successfully",
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'Citation added successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Citation added successfully",

[Killed] StringLiteral
main/components/Citations/BibTexEntryModal.jsx:106:13
       isEditing
         ? "Citation updated successfully"
         : relationship === "reference"
-          ? "Reference added successfully"
+          ? ""
           : "Citation added successfully",
     );
killedBy: BibTexEntryModal tests when relationship is 'reference', shows the Add Reference title and includes relatedEntryId/relationship in the POST
statusReason: expected "vi.fn()" to be called with arguments: [ 'Reference added successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Reference added successfully",

[Killed] BlockStatement
main/components/Citations/BibTexEntryModal.jsx:112:30
     closeModal();
   };
 
-  const onError = (error) => {
-    // Stryker disable next-line OptionalChaining : defensive coding for error shape
-    const message = error.response?.data?.message ?? error.message;
-    setParseError(message);
-  };
+  const onError = (error) => {};
 
   const mutation = useBackendMutation(
killedBy: BibTexEntryModal tests shows the backend's parse error message inline, without closing
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] LogicalOperator
main/components/Citations/BibTexEntryModal.jsx:114:21
 
   const onError = (error) => {
     // Stryker disable next-line OptionalChaining : defensive coding for error shape
-    const message = error.response?.data?.message ?? error.message;
+    const message = error.response?.data?.message && error.message;
     setParseError(message);
   };
killedBy: BibTexEntryModal tests shows the backend's parse error message inline, without closing
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Could not parse BibTeX: broken
Received:
  Request failed with status code 400

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Citations/BibTexEntryModal.jsx:124:34
     mutationQueryKeys,
   );
 
-  const onSubmit = (formData) => {
-    setParseError(null);
-    const bibtex = injectCitelinesFields(
-      formData.bibtex,
-      formData.relevance,
-      preservedFieldsRef.current,
-    );
-    mutation.mutate({ ...formData, bibtex });
-  };
+  const onSubmit = (formData) => {};
 
   return (
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ConditionalExpression
main/components/Citations/BibTexEntryModal.jsx:154:12
       </Modal.Header>
       <Form onSubmit={handleSubmit(onSubmit)}>
         <Modal.Body>
-          {parseError && (
-            <Alert variant="danger" data-testid="BibTexEntryModal-error">
-              {parseError}
-            </Alert>
-          )}
+          {true}
           <Form.Group className="mb-3">
             <Form.Label htmlFor="relevance">Relevance</Form.Label>
killedBy: BibTexEntryModal tests shows the backend's parse error message inline, without closing
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] LogicalOperator
main/components/Citations/BibTexEntryModal.jsx:154:12
       </Modal.Header>
       <Form onSubmit={handleSubmit(onSubmit)}>
         <Modal.Body>
-          {parseError && (
-            <Alert variant="danger" data-testid="BibTexEntryModal-error">
-              {parseError}
-            </Alert>
-          )}
+          {parseError || <Alert variant="danger" data-testid="BibTexEntryModal-error">
+              {parseError}
+            </Alert>}
           <Form.Group className="mb-3">
             <Form.Label htmlFor="relevance">Relevance</Form.Label>
killedBy: BibTexEntryModal tests shows the backend's parse error message inline, without closing
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Citations/BibTexEntryModal.jsx:162:28
           <Form.Group className="mb-3">
             <Form.Label htmlFor="relevance">Relevance</Form.Label>
             <Form.Select
-              data-testid={"BibTexEntryModal-relevance"}
+              data-testid={""}
               id="relevance"
               disabled={loadingExisting}
killedBy: BibTexEntryModal tests renders the Add Citation title, an empty textarea, and a Relevance dropdown defaulting to Unreviewed
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-relevance"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ArrowFunction
main/components/Citations/BibTexEntryModal.jsx:167:38
               disabled={loadingExisting}
               {...register("relevance")}
             >
-              {RELEVANCE_OPTIONS.map((option) => (
-                <option key={option} value={option}>
-                  {option}
-                </option>
-              ))}
+              {RELEVANCE_OPTIONS.map(() => undefined)}
             </Form.Select>
           </Form.Group>
killedBy: BibTexEntryModal tests renders the Add Citation title, an empty textarea, and a Relevance dropdown defaulting to Unreviewed
statusReason: expect(element).toHaveValue(Unreviewed)

Expected the element to have value:
  Unreviewed
Received:
  undefined

[Killed] StringLiteral
main/components/Citations/BibTexEntryModal.jsx:177:28
           <Form.Group>
             <Form.Label htmlFor="bibtex">BibTeX Entry</Form.Label>
             <Form.Control
-              data-testid={"BibTexEntryModal-bibtex"}
+              data-testid={""}
               id="bibtex"
               as="textarea"
killedBy: CitationTable tests clicking Edit opens the modal pre-filled from the export endpoint
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-bibtex"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Survived] ObjectLiteral
main/components/Citations/BibTexEntryModal.jsx:181:22
               id="bibtex"
               as="textarea"
               rows={10}
-              style={{ width: "100%", resize: "vertical" }}
+              style={{}}
               isInvalid={Boolean(errors.bibtex)}
               disabled={loadingExisting}

[Survived] StringLiteral
main/components/Citations/BibTexEntryModal.jsx:181:31
               id="bibtex"
               as="textarea"
               rows={10}
-              style={{ width: "100%", resize: "vertical" }}
+              style={{ width: "", resize: "vertical" }}
               isInvalid={Boolean(errors.bibtex)}
               disabled={loadingExisting}

[Killed] StringLiteral
main/components/Citations/BibTexEntryModal.jsx:185:27
               isInvalid={Boolean(errors.bibtex)}
               disabled={loadingExisting}
               {...register("bibtex", {
-                required: "BibTeX text is required.",
+                required: "",
               })}
             />
killedBy: BibTexEntryModal tests validates that bibtex text is required
statusReason: Unable to find an element with the text: BibTeX text is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] OptionalChaining
main/components/Citations/BibTexEntryModal.jsx:189:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.bibtex?.message}
+              {errors.bibtex.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/Citations/BibTexEntryModal.jsx:199:26
             className="btn btn-primary"
             data-testid="BibTexEntryModal-submit"
           >
-            {isEditing ? "Update" : "Add"}
+            {isEditing ? "" : "Add"}
           </button>
         </Modal.Footer>
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: Unable to find an element with the text: Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
