[Killed] BlockStatement
main/components/Citations/BulkReferenceUploadModal.jsx:27:19
 
   // The modal starts hidden (showModal=false), so useForm's own initial state is never visible;
   // this reset is what actually establishes an empty textarea each time the modal opens.
-  useEffect(() => {
-    if (showModal) {
-      reset({ rawHtml: "" });
-    }
-  }, [showModal, reset]);
+  useEffect(() => {}, [showModal, reset]);
 
   const closeModal = () => toggleShowModal(false);
killedBy: BulkReferenceUploadModal tests resets the textarea to empty each time the modal is reopened
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  some leftover html

[Killed] BlockStatement
main/components/Citations/BulkReferenceUploadModal.jsx:28:20
   // The modal starts hidden (showModal=false), so useForm's own initial state is never visible;
   // this reset is what actually establishes an empty textarea each time the modal opens.
   useEffect(() => {
-    if (showModal) {
-      reset({ rawHtml: "" });
-    }
+    if (showModal) {}
   }, [showModal, reset]);
 
killedBy: BulkReferenceUploadModal tests resets the textarea to empty each time the modal is reopened
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  some leftover html

[Killed] ObjectLiteral
main/components/Citations/BulkReferenceUploadModal.jsx:29:13
   // this reset is what actually establishes an empty textarea each time the modal opens.
   useEffect(() => {
     if (showModal) {
-      reset({ rawHtml: "" });
+      reset({});
     }
   }, [showModal, reset]);
killedBy: BulkReferenceUploadModal tests resets the textarea to empty each time the modal is reopened
statusReason: expect(element).toHaveValue()

Expected the element to have value:

Received:
  some leftover html

[Killed] ArrowFunction
main/components/Citations/BulkReferenceUploadModal.jsx:35:31
 
   const closeModal = () => toggleShowModal(false);
 
-  const objectToAxiosParams = (formData) => ({
-    url: "/api/jobs/launch/bulkReferenceUploadFromAcmDl",
-    method: "POST",
-    params: { projectId, citeKey },
-    data: extractBibliographySection(formData.rawHtml),
-    headers: { "Content-Type": "text/plain" },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = () => {
killedBy: BulkReferenceUploadModal tests submits the pasted HTML as a POST to the launch endpoint and shows a success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Citations/BulkReferenceUploadModal.jsx:40:14
     method: "POST",
     params: { projectId, citeKey },
     data: extractBibliographySection(formData.rawHtml),
-    headers: { "Content-Type": "text/plain" },
+    headers: {},
   });
 
killedBy: BulkReferenceUploadModal tests submits the pasted HTML as a POST to the launch endpoint and shows a success toast
statusReason: expected 'application/x-www-form-urlencoded' to be 'text/plain' // Object.is equality

[Killed] BlockStatement
main/components/Citations/BulkReferenceUploadModal.jsx:43:27
     headers: { "Content-Type": "text/plain" },
   });
 
-  const onSuccess = () => {
-    toast(
-      "Bulk reference upload job launched — check the Jobs tab for progress.",
-    );
-    closeModal();
-  };
+  const onSuccess = () => {};
 
   const mutation = useBackendMutation(
killedBy: BulkReferenceUploadModal tests submits the pasted HTML as a POST to the launch endpoint and shows a success toast
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] ObjectLiteral
main/components/Citations/BulkReferenceUploadModal.jsx:105:22
               id="rawHtml"
               as="textarea"
               rows={12}
-              style={{ width: "100%", resize: "vertical" }}
+              style={{}}
               isInvalid={Boolean(errors.rawHtml)}
               {...register("rawHtml", {

[Killed] OptionalChaining
main/components/Citations/BulkReferenceUploadModal.jsx:112:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.rawHtml?.message}
+              {errors.rawHtml.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-title"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
