[Killed] ConditionalExpression
main/components/Citations/DoiEntryModal.jsx:30:5
   const [postError, setPostError] = useState(null);
 
   const modalTitle =
-    relationship === "reference"
+    false
       ? "Add Reference via DOI"
       : "Add Citation via DOI";
killedBy: DoiEntryModal tests when relationship is 'reference', shows the Add Reference via DOI title and includes relatedEntryId/relationship in the POST
statusReason: Unable to find an element with the text: Add Reference via DOI. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/Citations/DoiEntryModal.jsx:30:5
   const [postError, setPostError] = useState(null);
 
   const modalTitle =
-    relationship === "reference"
+    true
       ? "Add Reference via DOI"
       : "Add Citation via DOI";
killedBy: DoiEntryModal tests renders the Add Citation via DOI title, an empty DOI field, and a Relevance dropdown defaulting to Unreviewed
statusReason: Unable to find an element with the text: Add Citation via DOI. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Citations/DoiEntryModal.jsx:31:9
 
   const modalTitle =
     relationship === "reference"
-      ? "Add Reference via DOI"
+      ? ""
       : "Add Citation via DOI";
 
killedBy: DoiEntryModal tests when relationship is 'reference', shows the Add Reference via DOI title and includes relatedEntryId/relationship in the POST
statusReason: Unable to find an element with the text: Add Reference via DOI. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Survived] BlockStatement
main/components/Citations/DoiEntryModal.jsx:34:19
       ? "Add Reference via DOI"
       : "Add Citation via DOI";
 
-  useEffect(() => {
-    if (!showModal) {
-      return;
-    }
-    setPostError(null);
-    reset({ doi: "", relevance: DEFAULT_RELEVANCE });
-  }, [showModal, reset]);
+  useEffect(() => {}, [showModal, reset]);
 
   const objectToAxiosParams = (formData) => {

[Survived] BlockStatement
main/components/Citations/DoiEntryModal.jsx:35:21
       : "Add Citation via DOI";
 
   useEffect(() => {
-    if (!showModal) {
-      return;
-    }
+    if (!showModal) {}
     setPostError(null);
     reset({ doi: "", relevance: DEFAULT_RELEVANCE });

[Survived] ConditionalExpression
main/components/Citations/DoiEntryModal.jsx:35:9
       : "Add Citation via DOI";
 
   useEffect(() => {
-    if (!showModal) {
+    if (false) {
       return;
     }

[Survived] ObjectLiteral
main/components/Citations/DoiEntryModal.jsx:39:11
       return;
     }
     setPostError(null);
-    reset({ doi: "", relevance: DEFAULT_RELEVANCE });
+    reset({});
   }, [showModal, reset]);
 

[Survived] ArrayDeclaration
main/components/Citations/DoiEntryModal.jsx:40:6
     }
     setPostError(null);
     reset({ doi: "", relevance: DEFAULT_RELEVANCE });
-  }, [showModal, reset]);
+  }, []);
 
   const objectToAxiosParams = (formData) => {

[Killed] BlockStatement
main/components/Citations/DoiEntryModal.jsx:42:45
     reset({ doi: "", relevance: DEFAULT_RELEVANCE });
   }, [showModal, reset]);
 
-  const objectToAxiosParams = (formData) => {
-    return {
-      url: "/api/bibtexentries/postByDoi",
-      method: "POST",
-      params:
-        relatedEntryId && relationship
-          ? {
-              projectId: projectId,
-              relatedEntryId,
-              relationship,
-              relevance: formData.relevance,
-            }
-          : { projectId: projectId, relevance: formData.relevance },
-      data: formData.doi,
-      headers: { "Content-Type": "text/plain" },
-    };
-  };
+  const objectToAxiosParams = (formData) => {};
 
   const closeModal = () => {
killedBy: CitationsTabComponent tests clicking Add Citation via DOI opens a create modal and posting adds a citation
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Citations/DoiEntryModal.jsx:44:12
 
   const objectToAxiosParams = (formData) => {
     return {
-      url: "/api/bibtexentries/postByDoi",
+      url: "",
       method: "POST",
       params:
killedBy: DoiEntryModal tests submits the DOI as a POST and shows a success toast
statusReason: expected '' to be '/api/bibtexentries/postByDoi' // Object.is equality

[Killed] ObjectLiteral
main/components/Citations/DoiEntryModal.jsx:48:13
       method: "POST",
       params:
         relatedEntryId && relationship
-          ? {
-              projectId: projectId,
-              relatedEntryId,
-              relationship,
-              relevance: formData.relevance,
-            }
+          ? {}
           : { projectId: projectId, relevance: formData.relevance },
       data: formData.doi,
killedBy: DoiEntryModal tests when relationship is 'reference', shows the Add Reference via DOI title and includes relatedEntryId/relationship in the POST
statusReason: expected {} to deeply equal { projectId: 1, …(3) }

[Killed] BlockStatement
main/components/Citations/DoiEntryModal.jsx:60:28
     };
   };
 
-  const closeModal = () => {
-    setPostError(null);
-    toggleShowModal(false);
-  };
+  const closeModal = () => {};
 
   const onSuccess = () => {
killedBy: DoiEntryModal tests submits the DOI as a POST and shows a success toast
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Number of calls: 0

[Killed] BooleanLiteral
main/components/Citations/DoiEntryModal.jsx:62:21
 
   const closeModal = () => {
     setPostError(null);
-    toggleShowModal(false);
+    toggleShowModal(true);
   };
 
killedBy: DoiEntryModal tests submits the DOI as a POST and shows a success toast
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received:

  1st vi.fn() call:

  [
-   false,

[Killed] BlockStatement
main/components/Citations/DoiEntryModal.jsx:65:27
     toggleShowModal(false);
   };
 
-  const onSuccess = () => {
-    toast(
-      relationship === "reference"
-        ? "Reference added successfully"
-        : "Citation added successfully",
-    );
-    closeModal();
-  };
+  const onSuccess = () => {};
 
   const onError = (error) => {
killedBy: DoiEntryModal tests submits the DOI as a POST and shows a success toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'Citation added successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Citations/DoiEntryModal.jsx:67:7
 
   const onSuccess = () => {
     toast(
-      relationship === "reference"
+      false
         ? "Reference added successfully"
         : "Citation added successfully",
killedBy: DoiEntryModal tests when relationship is 'reference', shows the Add Reference via DOI title and includes relatedEntryId/relationship in the POST
statusReason: expected "vi.fn()" to be called with arguments: [ 'Reference added successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Reference added successfully",

[Killed] EqualityOperator
main/components/Citations/DoiEntryModal.jsx:67:7
 
   const onSuccess = () => {
     toast(
-      relationship === "reference"
+      relationship !== "reference"
         ? "Reference added successfully"
         : "Citation added successfully",
killedBy: DoiEntryModal tests submits the DOI as a POST and shows a success toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'Citation added successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Citation added successfully",

[Killed] StringLiteral
main/components/Citations/DoiEntryModal.jsx:69:11
     toast(
       relationship === "reference"
         ? "Reference added successfully"
-        : "Citation added successfully",
+        : "",
     );
     closeModal();
killedBy: DoiEntryModal tests submits the DOI as a POST and shows a success toast
statusReason: expected "vi.fn()" to be called with arguments: [ 'Citation added successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Citation added successfully",

[Killed] BlockStatement
main/components/Citations/DoiEntryModal.jsx:74:30
     closeModal();
   };
 
-  const onError = (error) => {
-    // Stryker disable next-line OptionalChaining : defensive coding for error shape
-    const message = error.response?.data?.message ?? error.message;
-    setPostError(message);
-  };
+  const onError = (error) => {};
 
   const mutation = useBackendMutation(
killedBy: DoiEntryModal tests shows the backend's 404 'DOI not found' message inline, without closing
statusReason: Unable to find an element by: [data-testid="DoiEntryModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] BlockStatement
main/components/Citations/DoiEntryModal.jsx:86:34
     mutationQueryKeys,
   );
 
-  const onSubmit = (formData) => {
-    setPostError(null);
-    mutation.mutate(formData);
-  };
+  const onSubmit = (formData) => {};
 
   return (
killedBy: DoiEntryModal tests submits the DOI as a POST and shows a success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Citations/DoiEntryModal.jsx:96:20
       show={showModal}
       onHide={closeModal}
       centered={true}
-      data-testid={"DoiEntryModal-base"}
+      data-testid={""}
     >
       <Modal.Header>
killedBy: CitationsTabComponent tests clicking Add Citation via DOI opens a create modal and posting adds a citation
statusReason: Unable to find an element by: [data-testid="DoiEntryModal-base"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/Citations/DoiEntryModal.jsx:110:12
       </Modal.Header>
       <Form onSubmit={handleSubmit(onSubmit)}>
         <Modal.Body>
-          {postError && (
-            <Alert variant="danger" data-testid="DoiEntryModal-error">
-              {postError}
-            </Alert>
-          )}
+          {false}
           <Form.Group className="mb-3">
             <Form.Label htmlFor="relevance">Relevance</Form.Label>
killedBy: DoiEntryModal tests shows the backend's 404 'DOI not found' message inline, without closing
statusReason: Unable to find an element by: [data-testid="DoiEntryModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/Citations/DoiEntryModal.jsx:110:12
       </Modal.Header>
       <Form onSubmit={handleSubmit(onSubmit)}>
         <Modal.Body>
-          {postError && (
-            <Alert variant="danger" data-testid="DoiEntryModal-error">
-              {postError}
-            </Alert>
-          )}
+          {true}
           <Form.Group className="mb-3">
             <Form.Label htmlFor="relevance">Relevance</Form.Label>
killedBy: DoiEntryModal tests shows the backend's 404 'DOI not found' message inline, without closing
statusReason: Unable to find an element by: [data-testid="DoiEntryModal-error"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Citations/DoiEntryModal.jsx:135:28
               data-testid={"DoiEntryModal-doi"}
               id="doi"
               isInvalid={Boolean(errors.doi)}
-              {...register("doi", {
+              {...register("", {
                 required: "DOI is required.",
               })}
killedBy: DoiEntryModal tests renders the Add Citation via DOI title, an empty DOI field, and a Relevance dropdown defaulting to Unreviewed
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/Citations/DoiEntryModal.jsx:140:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.doi?.message}
+              {errors.doi.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: DoiEntryModal tests renders the Add Citation via DOI title, an empty DOI field, and a Relevance dropdown defaulting to Unreviewed
statusReason: Cannot read properties of undefined (reading 'message')
