[Killed] BooleanLiteral
main/components/Citations/PreviousVersionModal.jsx:18:17
   onHide,
   publishedMarkdown,
   onRestore,
-  isRestoring = false,
+  isRestoring = true,
   testId = "PreviousVersionModal",
 }) {
killedBy: PreviousVersionModal tests Restore this Version calls onRestore
statusReason: expected "vi.fn()" to be called at least once

[Killed] StringLiteral
main/components/Citations/PreviousVersionModal.jsx:19:12
   publishedMarkdown,
   onRestore,
   isRestoring = false,
-  testId = "PreviousVersionModal",
+  testId = "",
 }) {
   return (
killedBy: PreviousVersionModal tests shows the markdown source and its rendered form side by side
statusReason: Unable to find an element by: [data-testid="PreviousVersionModal-source"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Citations/PreviousVersionModal.jsx:27:20
       onHide={onHide}
       size="lg"
       centered
-      data-testid={`${testId}-base`}
+      data-testid={``}
     >
       <Modal.Header>
killedBy: PreviousVersionModal tests uses a custom testId when provided
statusReason: Unable to find an element by: [data-testid="CustomModal-base"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Survived] ObjectLiteral
main/components/Citations/PreviousVersionModal.jsx:38:22
             <h6>Markdown source</h6>
             <pre
               className="border rounded-3 p-3"
-              style={{ whiteSpace: "pre-wrap" }}
+              style={{}}
               data-testid={`${testId}-source`}
             >

[Survived] StringLiteral
main/components/Citations/PreviousVersionModal.jsx:48:28
             <h6>Rendered</h6>
             <div
               className="border rounded-3 p-3"
-              data-testid={`${testId}-rendered`}
+              data-testid={``}
             >
               <ReactMarkdown remarkPlugins={[remarkGfm]}>

[Killed] StringLiteral
main/components/Citations/PreviousVersionModal.jsx:61:24
         <Button
           variant="secondary"
           onClick={onHide}
-          data-testid={`${testId}-return-button`}
+          data-testid={``}
         >
           Return to Editor
killedBy: BibTexEntryComments tests See previous version modal shows the published markdown; Return to Editor closes it
statusReason: Unable to find an element by: [data-testid="BibTexEntryComments-PreviousVersionModal-return-button"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
