[Survived] BooleanLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:12:47
   projectId,
   testIdPrefix = "CitationsTabComponent",
 }) {
-  const [postModal, showPostModal] = useState(false);
+  const [postModal, showPostModal] = useState(true);
   const [doiModal, showDoiModal] = useState(false);
 

[Survived] BooleanLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:13:45
   testIdPrefix = "CitationsTabComponent",
 }) {
   const [postModal, showPostModal] = useState(false);
-  const [doiModal, showDoiModal] = useState(false);
+  const [doiModal, showDoiModal] = useState(true);
 
   const queryKey = `/api/bibtexentries/project?projectId=${projectId}`;

[Killed] ObjectLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:20:5
   const { data: citations } = useBackend(
     [queryKey],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
-    { method: "GET", url: queryKey },
+    {},
     [],
     true,
killedBy: CitationsTabComponent tests renders the Add Citation via BibTex and Add Citation via DOI buttons, and the citation table
statusReason: Unable to find an element by: [data-testid="CitationsTabComponent-CitationTable-cell-row-0-col-citeKey"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="CitationsTabComponent-CitationsTabComponent"

[Survived] ArrayDeclaration
components/Citations/TabComponent/CitationsTabComponent.jsx:21:5
     [queryKey],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: queryKey },
-    [],
+    ["Stryker was here"],
     true,
   );

[Survived] StringLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:27:20
 
   return (
     <div
-      data-testid={`${testIdPrefix}-CitationsTabComponent`}
+      data-testid={``}
       className="tabComponent"
     >

[Killed] ArrowFunction
components/Citations/TabComponent/CitationsTabComponent.jsx:45:22
       <Row className="p-2">
         <div className="d-flex gap-2">
           <Button
-            onClick={() => showPostModal(true)}
+            onClick={() => undefined}
             data-testid={`${testIdPrefix}-post-button`}
           >
killedBy: CitationsTabComponent tests clicking Add Citation via BibTex opens a create modal and posting adds a citation
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="CitationsTabComponent-CitationsTabComponent"

[Killed] BooleanLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:45:42
       <Row className="p-2">
         <div className="d-flex gap-2">
           <Button
-            onClick={() => showPostModal(true)}
+            onClick={() => showPostModal(false)}
             data-testid={`${testIdPrefix}-post-button`}
           >
killedBy: CitationsTabComponent tests clicking Add Citation via BibTex opens a create modal and posting adds a citation
statusReason: Unable to find an element by: [data-testid="BibTexEntryModal-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="CitationsTabComponent-CitationsTabComponent"

[Killed] StringLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:46:26
         <div className="d-flex gap-2">
           <Button
             onClick={() => showPostModal(true)}
-            data-testid={`${testIdPrefix}-post-button`}
+            data-testid={``}
           >
             Add Citation via BibTex
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-Citations-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BooleanLiteral
components/Citations/TabComponent/CitationsTabComponent.jsx:51:41
             Add Citation via BibTex
           </Button>
           <Button
-            onClick={() => showDoiModal(true)}
+            onClick={() => showDoiModal(false)}
             data-testid={`${testIdPrefix}-doi-button`}
           >
killedBy: CitationsTabComponent tests clicking Add Citation via DOI opens a create modal and posting adds a citation
statusReason: Unable to find an element by: [data-testid="DoiEntryModal-doi"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="CitationsTabComponent-CitationsTabComponent"

[Killed] ArrowFunction
components/Citations/TabComponent/CitationsTabComponent.jsx:51:22
             Add Citation via BibTex
           </Button>
           <Button
-            onClick={() => showDoiModal(true)}
+            onClick={() => undefined}
             data-testid={`${testIdPrefix}-doi-button`}
           >
killedBy: CitationsTabComponent tests clicking Add Citation via DOI opens a create modal and posting adds a citation
statusReason: Unable to find an element by: [data-testid="DoiEntryModal-doi"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
