[Killed] StringLiteral
main/components/Common/ColorChooser.jsx:8:3
 
 // 8 fully saturated colors
 export const SATURATED_COLORS = [
-  "#e53935",
+  "",
   "#fb8c00",
   "#fdd835",
killedBy: TagModal tests allows choosing a color via the ColorChooser and submits it
statusReason: Unable to find an element by: [data-testid="TagModal-ColorChooser-swatch-#e53935"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Survived] StringLiteral
main/components/Common/ColorChooser.jsx:9:3
 // 8 fully saturated colors
 export const SATURATED_COLORS = [
   "#e53935",
-  "#fb8c00",
+  "",
   "#fdd835",
   "#43a047",

[Survived] StringLiteral
main/components/Common/ColorChooser.jsx:10:3
 export const SATURATED_COLORS = [
   "#e53935",
   "#fb8c00",
-  "#fdd835",
+  "",
   "#43a047",
   "#00acc1",

[Survived] StringLiteral
main/components/Common/ColorChooser.jsx:20:3
 
 // 8 pastel (desaturated/lightened) versions of the same hues
 export const PASTEL_COLORS = [
-  "#ffcdd2",
+  "",
   "#ffe0b2",
   "#fff9c4",

[Survived] StringLiteral
main/components/Common/ColorChooser.jsx:24:3
   "#ffe0b2",
   "#fff9c4",
   "#c8e6c9",
-  "#b2ebf2",
+  "",
   "#bbdefb",
   "#e1bee7",

[Survived] StringLiteral
main/components/Common/ColorChooser.jsx:27:3
   "#b2ebf2",
   "#bbdefb",
   "#e1bee7",
-  "#f8bbd0",
+  "",
 ];
 

[Killed] StringLiteral
main/components/Common/ColorChooser.jsx:33:12
 export default function ColorChooser({
   value,
   onChange,
-  testId = "ColorChooser",
+  testId = "",
 }) {
   const [showPaletteModal, setShowPaletteModal] = useState(false);
killedBy: ColorChooser tests renders 8 saturated and 8 pastel swatches
statusReason: Unable to find an element by: [data-testid="ColorChooser-swatch-#e53935"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="-container"
    >

[Survived] BooleanLiteral
main/components/Common/ColorChooser.jsx:35:60
   onChange,
   testId = "ColorChooser",
 }) {
-  const [showPaletteModal, setShowPaletteModal] = useState(false);
+  const [showPaletteModal, setShowPaletteModal] = useState(true);
   const [paletteColor, setPaletteColor] = useState(value || "#e53935");
 

[Survived] LogicalOperator
main/components/Common/ColorChooser.jsx:36:52
   testId = "ColorChooser",
 }) {
   const [showPaletteModal, setShowPaletteModal] = useState(false);
-  const [paletteColor, setPaletteColor] = useState(value || "#e53935");
+  const [paletteColor, setPaletteColor] = useState(value && "#e53935");
 
   const selectColor = (color) => {

[Survived] ConditionalExpression
main/components/Common/ColorChooser.jsx:36:52
   testId = "ColorChooser",
 }) {
   const [showPaletteModal, setShowPaletteModal] = useState(false);
-  const [paletteColor, setPaletteColor] = useState(value || "#e53935");
+  const [paletteColor, setPaletteColor] = useState(true);
 
   const selectColor = (color) => {

[Killed] BlockStatement
main/components/Common/ColorChooser.jsx:38:34
   const [showPaletteModal, setShowPaletteModal] = useState(false);
   const [paletteColor, setPaletteColor] = useState(value || "#e53935");
 
-  const selectColor = (color) => {
-    onChange(color);
-  };
+  const selectColor = (color) => {};
 
   const handleRandomColor = () => {
killedBy: TagModal tests allows choosing a color via the ColorChooser and submits it
statusReason: expected { tag: 'methodology', …(2) } to deeply equal { tag: 'methodology', …(2) }

[Killed] BlockStatement
main/components/Common/ColorChooser.jsx:42:35
     onChange(color);
   };
 
-  const handleRandomColor = () => {
-    selectColor(randomHexColor());
-  };
+  const handleRandomColor = () => {};
 
   const openPaletteModal = () => {
killedBy: ColorChooser tests clicking Random Color calls onChange with a valid hex color
statusReason: expected "vi.fn()" to be called 1 times, but got 0 times

[Killed] BlockStatement
main/components/Common/ColorChooser.jsx:46:34
     selectColor(randomHexColor());
   };
 
-  const openPaletteModal = () => {
-    setPaletteColor(value || "#e53935");
-    setShowPaletteModal(true);
-  };
+  const openPaletteModal = () => {};
 
   const confirmPaletteColor = () => {
killedBy: ColorChooser tests More Colors... opens a modal, and Choose confirms the selected color
statusReason: Unable to find an element with the text: Choose a Color. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ColorChooser-container"
    >

[Survived] ConditionalExpression
main/components/Common/ColorChooser.jsx:47:21
   };
 
   const openPaletteModal = () => {
-    setPaletteColor(value || "#e53935");
+    setPaletteColor(true);
     setShowPaletteModal(true);
   };

[Survived] LogicalOperator
main/components/Common/ColorChooser.jsx:47:21
   };
 
   const openPaletteModal = () => {
-    setPaletteColor(value || "#e53935");
+    setPaletteColor(value && "#e53935");
     setShowPaletteModal(true);
   };

[Killed] BooleanLiteral
main/components/Common/ColorChooser.jsx:48:25
 
   const openPaletteModal = () => {
     setPaletteColor(value || "#e53935");
-    setShowPaletteModal(true);
+    setShowPaletteModal(false);
   };
 
killedBy: ColorChooser tests More Colors... opens a modal, and Choose confirms the selected color
statusReason: Unable to find an element with the text: Choose a Color. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ColorChooser-container"
    >

[Killed] BlockStatement
main/components/Common/ColorChooser.jsx:51:37
     setShowPaletteModal(true);
   };
 
-  const confirmPaletteColor = () => {
-    selectColor(paletteColor);
-    setShowPaletteModal(false);
-  };
+  const confirmPaletteColor = () => {};
 
   const renderSwatchRow = (colors, rowTestId) => (
killedBy: ColorChooser tests More Colors... opens a modal, and Choose confirms the selected color
statusReason: expected "vi.fn()" to be called with arguments: [ '#123456' ]

Number of calls: 0

[Survived] BooleanLiteral
main/components/Common/ColorChooser.jsx:53:25
 
   const confirmPaletteColor = () => {
     selectColor(paletteColor);
-    setShowPaletteModal(false);
+    setShowPaletteModal(true);
   };
 

[Killed] ArrowFunction
main/components/Common/ColorChooser.jsx:56:27
     setShowPaletteModal(false);
   };
 
-  const renderSwatchRow = (colors, rowTestId) => (
-    <div className="d-flex mb-2" data-testid={`${testId}-${rowTestId}`}>
-      {colors.map((color) => (
-        <button
-          key={color}
-          type="button"
-          onClick={() => selectColor(color)}
-          data-testid={`${testId}-swatch-${color}`}
-          aria-label={`Choose color ${color}`}
-          aria-pressed={value === color}
-          style={{
-            backgroundColor: color,
-            width: "2rem",
-            height: "2rem",
-            marginRight: "0.25rem",
-            borderRadius: "0.25rem",
-            border: value === color ? "2px solid #212529" : "1px solid #ced4da",
-            cursor: "pointer",
-          }}
-        />
-      ))}
-    </div>
-  );
+  const renderSwatchRow = () => undefined;
 
   return (
killedBy: ColorChooser tests renders 8 saturated and 8 pastel swatches
statusReason: Unable to find an element by: [data-testid="ColorChooser-swatch-#e53935"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ColorChooser-container"
    >

[Survived] StringLiteral
main/components/Common/ColorChooser.jsx:57:47
   };
 
   const renderSwatchRow = (colors, rowTestId) => (
-    <div className="d-flex mb-2" data-testid={`${testId}-${rowTestId}`}>
+    <div className="d-flex mb-2" data-testid={``}>
       {colors.map((color) => (
         <button

[Killed] ArrowFunction
main/components/Common/ColorChooser.jsx:58:19
 
   const renderSwatchRow = (colors, rowTestId) => (
     <div className="d-flex mb-2" data-testid={`${testId}-${rowTestId}`}>
-      {colors.map((color) => (
-        <button
-          key={color}
-          type="button"
-          onClick={() => selectColor(color)}
-          data-testid={`${testId}-swatch-${color}`}
-          aria-label={`Choose color ${color}`}
-          aria-pressed={value === color}
-          style={{
-            backgroundColor: color,
-            width: "2rem",
-            height: "2rem",
-            marginRight: "0.25rem",
-            borderRadius: "0.25rem",
-            border: value === color ? "2px solid #212529" : "1px solid #ced4da",
-            cursor: "pointer",
-          }}
-        />
-      ))}
+      {colors.map(() => undefined)}
     </div>
   );
killedBy: TagModal tests allows choosing a color via the ColorChooser and submits it
statusReason: Unable to find an element by: [data-testid="TagModal-ColorChooser-swatch-#e53935"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ArrowFunction
main/components/Common/ColorChooser.jsx:62:20
         <button
           key={color}
           type="button"
-          onClick={() => selectColor(color)}
+          onClick={() => undefined}
           data-testid={`${testId}-swatch-${color}`}
           aria-label={`Choose color ${color}`}
killedBy: ColorChooser tests clicking a swatch calls onChange with that color
statusReason: expected "vi.fn()" to be called with arguments: [ '#1e88e5' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Common/ColorChooser.jsx:63:24
           key={color}
           type="button"
           onClick={() => selectColor(color)}
-          data-testid={`${testId}-swatch-${color}`}
+          data-testid={``}
           aria-label={`Choose color ${color}`}
           aria-pressed={value === color}
killedBy: TagModal tests allows choosing a color via the ColorChooser and submits it
statusReason: Unable to find an element by: [data-testid="TagModal-ColorChooser-swatch-#e53935"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Survived] StringLiteral
main/components/Common/ColorChooser.jsx:64:23
           type="button"
           onClick={() => selectColor(color)}
           data-testid={`${testId}-swatch-${color}`}
-          aria-label={`Choose color ${color}`}
+          aria-label={``}
           aria-pressed={value === color}
           style={{

[Survived] ConditionalExpression
main/components/Common/ColorChooser.jsx:65:25
           onClick={() => selectColor(color)}
           data-testid={`${testId}-swatch-${color}`}
           aria-label={`Choose color ${color}`}
-          aria-pressed={value === color}
+          aria-pressed={true}
           style={{
             backgroundColor: color,

[Survived] EqualityOperator
main/components/Common/ColorChooser.jsx:65:25
           onClick={() => selectColor(color)}
           data-testid={`${testId}-swatch-${color}`}
           aria-label={`Choose color ${color}`}
-          aria-pressed={value === color}
+          aria-pressed={value !== color}
           style={{
             backgroundColor: color,

[Survived] ConditionalExpression
main/components/Common/ColorChooser.jsx:72:21
             height: "2rem",
             marginRight: "0.25rem",
             borderRadius: "0.25rem",
-            border: value === color ? "2px solid #212529" : "1px solid #ced4da",
+            border: false ? "2px solid #212529" : "1px solid #ced4da",
             cursor: "pointer",
           }}

[Survived] EqualityOperator
main/components/Common/ColorChooser.jsx:72:21
             height: "2rem",
             marginRight: "0.25rem",
             borderRadius: "0.25rem",
-            border: value === color ? "2px solid #212529" : "1px solid #ced4da",
+            border: value !== color ? "2px solid #212529" : "1px solid #ced4da",
             cursor: "pointer",
           }}

[Survived] StringLiteral
main/components/Common/ColorChooser.jsx:81:23
   );
 
   return (
-    <div data-testid={`${testId}-container`}>
+    <div data-testid={``}>
       {renderSwatchRow(SATURATED_COLORS, "saturated-row")}
       {renderSwatchRow(PASTEL_COLORS, "pastel-row")}

[Survived] StringLiteral
main/components/Common/ColorChooser.jsx:82:42
 
   return (
     <div data-testid={`${testId}-container`}>
-      {renderSwatchRow(SATURATED_COLORS, "saturated-row")}
+      {renderSwatchRow(SATURATED_COLORS, "")}
       {renderSwatchRow(PASTEL_COLORS, "pastel-row")}
       <div className="d-flex align-items-center">

[Killed] StringLiteral
main/components/Common/ColorChooser.jsx:100:24
           variant="outline-secondary"
           size="sm"
           onClick={openPaletteModal}
-          data-testid={`${testId}-more-colors-button`}
+          data-testid={``}
         >
           More Colors...
killedBy: ColorChooser tests More Colors... opens a modal, and Choose confirms the selected color
statusReason: Unable to find an element by: [data-testid="ColorChooser-more-colors-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="ColorChooser-container"
    >

[Killed] ConditionalExpression
main/components/Common/ColorChooser.jsx:104:10
         >
           More Colors...
         </Button>
-        {value && (
-          <span
-            className="ms-2 px-2 py-1 rounded"
-            data-testid={`${testId}-current-color`}
-            style={{
-              backgroundColor: value,
-              color: getContrastTextColor(value),
-            }}
-          >
-            {value}
-          </span>
-        )}
+        {false}
       </div>
 
killedBy: ColorChooser tests shows the currently selected color value
statusReason: Unable to find an element by: [data-testid="ColorChooser-current-color"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] LogicalOperator
main/components/Common/ColorChooser.jsx:104:10
         >
           More Colors...
         </Button>
-        {value && (
-          <span
-            className="ms-2 px-2 py-1 rounded"
-            data-testid={`${testId}-current-color`}
-            style={{
-              backgroundColor: value,
-              color: getContrastTextColor(value),
-            }}
-          >
-            {value}
-          </span>
-        )}
+        {value || <span className="ms-2 px-2 py-1 rounded" data-testid={`${testId}-current-color`} style={{
+  backgroundColor: value,
+  color: getContrastTextColor(value)
+}}>
+            {value}
+          </span>}
       </div>
 
killedBy: ColorChooser tests shows the currently selected color value
statusReason: Unable to find an element by: [data-testid="ColorChooser-current-color"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/components/Common/ColorChooser.jsx:107:26
         {value && (
           <span
             className="ms-2 px-2 py-1 rounded"
-            data-testid={`${testId}-current-color`}
+            data-testid={``}
             style={{
               backgroundColor: value,
killedBy: ColorChooser tests shows the currently selected color value
statusReason: Unable to find an element by: [data-testid="ColorChooser-current-color"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[NoCoverage] BooleanLiteral
main/components/Common/ColorChooser.jsx:120:43
 
       <Modal
         show={showPaletteModal}
-        onHide={() => setShowPaletteModal(false)}
+        onHide={() => setShowPaletteModal(true)}
         centered
         data-testid={`${testId}-palette-modal`}

[Survived] ArrowFunction
main/components/Common/ColorChooser.jsx:120:17
 
       <Modal
         show={showPaletteModal}
-        onHide={() => setShowPaletteModal(false)}
+        onHide={() => undefined}
         centered
         data-testid={`${testId}-palette-modal`}

[Survived] StringLiteral
main/components/Common/ColorChooser.jsx:122:22
         show={showPaletteModal}
         onHide={() => setShowPaletteModal(false)}
         centered
-        data-testid={`${testId}-palette-modal`}
+        data-testid={``}
       >
         <Modal.Header closeButton>

[Killed] ArrowFunction
main/components/Common/ColorChooser.jsx:131:23
           <Form.Control
             type="color"
             value={paletteColor}
-            onChange={(e) => setPaletteColor(e.target.value)}
+            onChange={() => undefined}
             data-testid={`${testId}-palette-input`}
           />
killedBy: ColorChooser tests More Colors... opens a modal, and Choose confirms the selected color
statusReason: expected "vi.fn()" to be called with arguments: [ '#123456' ]

Received:

  1st vi.fn() call:

  [
-   "#123456",

[Survived] ArrowFunction
main/components/Common/ColorChooser.jsx:138:22
         <Modal.Footer>
           <Button
             variant="secondary"
-            onClick={() => setShowPaletteModal(false)}
+            onClick={() => undefined}
           >
             Cancel

[Survived] BooleanLiteral
main/components/Common/ColorChooser.jsx:138:48
         <Modal.Footer>
           <Button
             variant="secondary"
-            onClick={() => setShowPaletteModal(false)}
+            onClick={() => setShowPaletteModal(true)}
           >
             Cancel
