[Killed] ArrowFunction
main/components/Common/OurTable.tsx:32:5
   const newColumns = convertOldStyleColumnsToNewStyle(columns);
   const memoizedData = useMemo(() => data, [data]);
   const memoizedColumns = useMemo(
-    () => newColumns as ColumnDef<T>[],
+    () => undefined,
     [newColumns],
   );
killedBy: RoleEmailTable renders empty table correctly when data is null
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ObjectLiteral
main/components/Common/OurTable.tsx:37:31
   );
 
   // eslint-disable-next-line react-hooks/incompatible-library -- TanStack Table returns new function references each render; React Compiler correctly skips memoizing this component
-  const table = useReactTable({
-    data: memoizedData,
-    columns: memoizedColumns,
-    getCoreRowModel: getCoreRowModel(),
-    getSortedRowModel: getSortedRowModel(),
-  });
+  const table = useReactTable({});
 
   return (
killedBy: AdminJobsPage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
main/components/Common/OurTable.tsx:114:17
   variant: string,
   callback: (cell: Cell<T, unknown>) => void,
   testid: string,
-): ColumnDef<T> {
-  const columnHelper = createColumnHelper<T>();
-
-  return columnHelper.display({
-    id: label, // Unique ID for display columns
-    header: label,
-    cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    ),
-  });
-}
+): ColumnDef<T> {}
 
killedBy: OurTable tests OurTable component tests renders an empty table without crashing
statusReason: Cannot read properties of undefined (reading 'accessor')

[Killed] ObjectLiteral
main/components/Common/OurTable.tsx:117:31
 ): ColumnDef<T> {
   const columnHelper = createColumnHelper<T>();
 
-  return columnHelper.display({
-    id: label, // Unique ID for display columns
-    header: label,
-    cell: ({ cell }) => (
-      <Button
-        variant={variant}
-        onClick={() => callback(cell)}
-        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-      >
-        {label}
-      </Button>
-    ),
-  });
+  return columnHelper.display({});
 }
 
killedBy: OurTable tests OurTable component tests renders an empty table without crashing
statusReason: Columns require an id when using a non-string header
