[Killed] BlockStatement
main/components/Common/OurTableUtils.ts:13:19
 
 export function convertOldStyleColumnsToNewStyle(
   oldStyleColumns: LegacyColumn[],
-): LegacyColumn[] {
-  const result: LegacyColumn[] = [];
-  for (const col of oldStyleColumns) {
-    const newCol = {
-      id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
-      header: col.Header || col.header, // Use Header or header for the column title
-      accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
-      ...col,
-    };
-    result.push({ ...newCol });
-  }
-  return result;
-}
+): LegacyColumn[] {}
 
killedBy: OurTable tests OurTable helper tests add id when it doesn't exist
statusReason: expected undefined to deeply equal [ { id: 'col1', …(4) } ]

[Killed] ArrayDeclaration
main/components/Common/OurTableUtils.ts:14:34
 export function convertOldStyleColumnsToNewStyle(
   oldStyleColumns: LegacyColumn[],
 ): LegacyColumn[] {
-  const result: LegacyColumn[] = [];
+  const result: LegacyColumn[] = ["Stryker was here"];
   for (const col of oldStyleColumns) {
     const newCol = {
killedBy: OurTable tests OurTable helper tests add id when it doesn't exist
statusReason: expected [ 'Stryker was here', …(1) ] to deeply equal [ { id: 'col1', …(4) } ]

[Killed] BlockStatement
main/components/Common/OurTableUtils.ts:15:38
   oldStyleColumns: LegacyColumn[],
 ): LegacyColumn[] {
   const result: LegacyColumn[] = [];
-  for (const col of oldStyleColumns) {
-    const newCol = {
-      id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
-      header: col.Header || col.header, // Use Header or header for the column title
-      accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
-      ...col,
-    };
-    result.push({ ...newCol });
-  }
+  for (const col of oldStyleColumns) {}
   return result;
 }
killedBy: OurTable tests OurTable helper tests add id when it doesn't exist
statusReason: expected [] to deeply equal [ { id: 'col1', …(4) } ]

[Killed] ConditionalExpression
main/components/Common/OurTableUtils.ts:17:11
   const result: LegacyColumn[] = [];
   for (const col of oldStyleColumns) {
     const newCol = {
-      id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
+      id: true, // Use accessor or accessorKey as id
       header: col.Header || col.header, // Use Header or header for the column title
       accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
killedBy: OurTable tests OurTable helper tests add id when it doesn't exist
statusReason: expected [ { id: true, …(4) } ] to deeply equal [ { id: 'col1', …(4) } ]

[Killed] ConditionalExpression
main/components/Common/OurTableUtils.ts:17:11
   const result: LegacyColumn[] = [];
   for (const col of oldStyleColumns) {
     const newCol = {
-      id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
+      id: false, // Use accessor or accessorKey as id
       header: col.Header || col.header, // Use Header or header for the column title
       accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
killedBy: OurTable tests OurTable helper tests add id when it doesn't exist
statusReason: expected [ { id: false, …(4) } ] to deeply equal [ { id: 'col1', …(4) } ]

[Killed] LogicalOperator
main/components/Common/OurTableUtils.ts:18:15
   for (const col of oldStyleColumns) {
     const newCol = {
       id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
-      header: col.Header || col.header, // Use Header or header for the column title
+      header: col.Header && col.header, // Use Header or header for the column title
       accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
       ...col,
killedBy: OurTable tests OurTable helper tests add id when it doesn't exist
statusReason: expected [ { id: 'col1', …(4) } ] to deeply equal [ { id: 'col1', …(4) } ]

[Killed] ConditionalExpression
main/components/Common/OurTableUtils.ts:18:15
   for (const col of oldStyleColumns) {
     const newCol = {
       id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
-      header: col.Header || col.header, // Use Header or header for the column title
+      header: true, // Use Header or header for the column title
       accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
       ...col,
killedBy: OurTable tests OurTable helper tests add id when it doesn't exist
statusReason: expected [ { id: 'col1', header: true, …(3) } ] to deeply equal [ { id: 'col1', …(4) } ]

[Killed] ConditionalExpression
main/components/Common/OurTableUtils.ts:19:20
     const newCol = {
       id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
       header: col.Header || col.header, // Use Header or header for the column title
-      accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
+      accessorKey: true, // Use accessor or accessorKey
       ...col,
     };
killedBy: OurTable tests OurTable helper tests add id when it doesn't exist
statusReason: expected [ { id: 'col1', …(4) } ] to deeply equal [ { id: 'col1', …(4) } ]

[Killed] ConditionalExpression
main/components/Common/OurTableUtils.ts:19:20
     const newCol = {
       id: col.accessor || col.accessorKey, // Use accessor or accessorKey as id
       header: col.Header || col.header, // Use Header or header for the column title
-      accessorKey: col.accessor || col.accessorKey, // Use accessor or accessorKey
+      accessorKey: false, // Use accessor or accessorKey
       ...col,
     };
killedBy: OurTable tests OurTable helper tests add id when it doesn't exist
statusReason: expected [ { id: 'col1', …(4) } ] to deeply equal [ { id: 'col1', …(4) } ]
