[Killed] BlockStatement
main/components/Common/SortCaret.tsx:13:39
 export default function SortCaret({
   header,
   testId = "testid",
-}: SortCaretProps): React.JSX.Element {
-  return (
-    <span data-testid={`${testId}-header-${header.column.id}-sort-carets`}>
-      {getSortCaret(header)}
-    </span>
-  );
-}
+}: SortCaretProps): React.JSX.Element {}
 
killedBy: OurTable tests OurTable component tests click on a header and a sort caret should appear
statusReason: Unable to find an element by: [data-testid="sampleTestId-header-col1-sort-carets"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="sampleTestId"
