[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:22:25
     {
       header: "Scope",
       accessorFn: (row) =>
-        row.scopeType ? `${row.scopeType}:${row.scopeId}` : "",
+        row.scopeType ? `` : "",
       id: "scope",
     },
killedBy: JobsTable tests renders correctly with jobs data
statusReason: Unable to find an element with the text: course:101. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="JobsTable"

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:28:11
     {
       header: "Created",
       accessorFn: (row) => formatTime(row.createdAt),
-      id: "createdAt",
+      id: "",
     },
     {
killedBy: JobsTable tests renders without crashing for empty table
statusReason: Columns require an id when using an accessorFn

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.jsx:30:5
       accessorFn: (row) => formatTime(row.createdAt),
       id: "createdAt",
     },
-    {
-      header: "Updated",
-      accessorFn: (row) => formatTime(row.updatedAt),
-      id: "updatedAt",
-    },
+    {},
     {
       header: "Status",
killedBy: JobsTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:44:62
       accessorKey: "log",
       cell: ({ cell }) => (
         <div
-          style={{ maxWidth: 450, maxHeight: 100, overflowY: "auto" }}
+          style={{ maxWidth: 450, maxHeight: 100, overflowY: "" }}
           data-testid={`JobsTable-cell-row-${cell.row.index}-col-${cell.column.id}-div`}
         >
killedBy: JobsTable tests renders correctly with jobs data
statusReason: expect(element).toHaveStyle()

- Expected

  max-height: 100px;
  max-width: 450px;
- overflow-y: auto;

[Killed] StringLiteral
main/components/Jobs/JobsTable.jsx:47:37
           style={{ maxWidth: 450, maxHeight: 100, overflowY: "auto" }}
           data-testid={`JobsTable-cell-row-${cell.row.index}-col-${cell.column.id}-div`}
         >
-          <pre style={{ whiteSpace: "pre-wrap" }}>{cell.getValue()}</pre>
+          <pre style={{ whiteSpace: "" }}>{cell.getValue()}</pre>
         </div>
       ),
killedBy: JobsTable tests renders correctly with jobs data
statusReason: expect(element).toHaveStyle()

- Expected

- whiteSpace: pre-wrap;
