[Killed] StringLiteral
main/components/Projects/ProjectCollaboratorForm.jsx:21:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="firstName">First Name</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-firstName"}
+          data-testid={testIdPrefix + ""}
           id="firstName"
           type="text"
killedBy: CollaboratorsTabComponent tests owner sees the Add Collaborator button and can add one
statusReason: Unable to find an element by: [data-testid="ProjectCollaboratorForm-firstName"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Projects/ProjectCollaboratorForm.jsx:37:39
       <Form.Group className="mb-3">
         <Form.Label htmlFor="lastName">Last Name</Form.Label>
         <Form.Control
-          data-testid={testIdPrefix + "-lastName"}
+          data-testid={testIdPrefix + ""}
           id="lastName"
           type="text"
killedBy: CollaboratorsTabComponent tests owner sees the Add Collaborator button and can add one
statusReason: Unable to find an element by: [data-testid="ProjectCollaboratorForm-lastName"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
