[NoCoverage] BooleanLiteral
main/components/Projects/ProjectCollaboratorTable.jsx:11:13
 export default function ProjectCollaboratorTable({
   collaborators,
   projectId,
-  isOwner = true,
+  isOwner = false,
   testIdPrefix = "ProjectCollaboratorTable",
 }) {

[Killed] ArrowFunction
main/components/Projects/ProjectCollaboratorTable.jsx:17:35
   const [showDeleteModal, setShowDeleteModal] = useState(false);
   const [collaboratorToDelete, setCollaboratorToDelete] = useState(null);
 
-  const cellToAxiosParamsDelete = (collaborator) => ({
-    url: "/api/projectcollaborators/delete",
-    method: "DELETE",
-    params: {
-      id: collaborator.id,
-      projectId: projectId,
-    },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   const onDeleteSuccess = () => {
killedBy: ProjectCollaboratorTable tests owner can delete a collaborator after confirming
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Projects/ProjectCollaboratorTable.jsx:17:54
   const [showDeleteModal, setShowDeleteModal] = useState(false);
   const [collaboratorToDelete, setCollaboratorToDelete] = useState(null);
 
-  const cellToAxiosParamsDelete = (collaborator) => ({
-    url: "/api/projectcollaborators/delete",
-    method: "DELETE",
-    params: {
-      id: collaborator.id,
-      projectId: projectId,
-    },
-  });
+  const cellToAxiosParamsDelete = (collaborator) => ({});
 
   const onDeleteSuccess = () => {
killedBy: ProjectCollaboratorTable tests owner can delete a collaborator after confirming
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Projects/ProjectCollaboratorTable.jsx:26:33
     },
   });
 
-  const onDeleteSuccess = () => {
-    toast("Collaborator deleted successfully.");
-    setShowDeleteModal(false);
-    setCollaboratorToDelete(null);
-  };
+  const onDeleteSuccess = () => {};
 
   const deleteMutation = useBackendMutation(
killedBy: ProjectCollaboratorTable tests owner can delete a collaborator after confirming
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BooleanLiteral
main/components/Projects/ProjectCollaboratorTable.jsx:28:24
 
   const onDeleteSuccess = () => {
     toast("Collaborator deleted successfully.");
-    setShowDeleteModal(false);
+    setShowDeleteModal(true);
     setCollaboratorToDelete(null);
   };

[Survived] StringLiteral
main/components/Projects/ProjectCollaboratorTable.jsx:37:6
     {
       onSuccess: onDeleteSuccess,
     },
-    [`/api/projectcollaborators/project?projectId=${projectId}`],
+    [``],
   );
 

[Survived] ArrayDeclaration
main/components/Projects/ProjectCollaboratorTable.jsx:37:5
     {
       onSuccess: onDeleteSuccess,
     },
-    [`/api/projectcollaborators/project?projectId=${projectId}`],
+    [],
   );
 

[Killed] BlockStatement
main/components/Projects/ProjectCollaboratorTable.jsx:40:36
     [`/api/projectcollaborators/project?projectId=${projectId}`],
   );
 
-  const deleteCallback = (cell) => {
-    setCollaboratorToDelete(cell.row.original);
-    setShowDeleteModal(true);
-  };
+  const deleteCallback = (cell) => {};
 
   const columns = [
killedBy: ProjectCollaboratorTable tests owner can delete a collaborator after confirming
statusReason: Unable to find an element with the text: /Please confirm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="PCT"

[Killed] BooleanLiteral
main/components/Projects/ProjectCollaboratorTable.jsx:42:24
 
   const deleteCallback = (cell) => {
     setCollaboratorToDelete(cell.row.original);
-    setShowDeleteModal(true);
+    setShowDeleteModal(false);
   };
 
killedBy: ProjectCollaboratorTable tests owner can delete a collaborator after confirming
statusReason: Unable to find an element with the text: /Please confirm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="PCT"

[Killed] ConditionalExpression
main/components/Projects/ProjectCollaboratorTable.jsx:64:7
     },
   ];
 
-  if (isOwner) {
+  if (true) {
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: ProjectCollaboratorTable tests renders columns and no Delete column for non-owners
statusReason: Found multiple elements with the text: Delete

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="ProjectCollaboratorTable-header-Delete-sort-header"
>

[Killed] ConditionalExpression
main/components/Projects/ProjectCollaboratorTable.jsx:64:7
     },
   ];
 
-  if (isOwner) {
+  if (false) {
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix),
killedBy: ProjectCollaboratorTable tests owner can delete a collaborator after confirming
statusReason: Unable to find an element by: [data-testid="PCT-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="PCT"

[Killed] ConditionalExpression
main/components/Projects/ProjectCollaboratorTable.jsx:82:12
           <Modal.Title>Confirm Delete</Modal.Title>
         </Modal.Header>
         <Modal.Body>
-          {collaboratorToDelete && (
-            <p>
-              Please confirm that you really want to remove{" "}
-              <strong>
-                {collaboratorToDelete.firstName} {collaboratorToDelete.lastName}
-              </strong>{" "}
-              as a collaborator. This action cannot be undone.
-            </p>
-          )}
+          {false}
         </Modal.Body>
         <Modal.Footer>
killedBy: ProjectCollaboratorTable tests owner can delete a collaborator after confirming
statusReason: Unable to find an element with the text: /Please confirm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ConditionalExpression
main/components/Projects/ProjectCollaboratorTable.jsx:82:12
           <Modal.Title>Confirm Delete</Modal.Title>
         </Modal.Header>
         <Modal.Body>
-          {collaboratorToDelete && (
-            <p>
-              Please confirm that you really want to remove{" "}
-              <strong>
-                {collaboratorToDelete.firstName} {collaboratorToDelete.lastName}
-              </strong>{" "}
-              as a collaborator. This action cannot be undone.
-            </p>
-          )}
+          {true}
         </Modal.Body>
         <Modal.Footer>
killedBy: ProjectCollaboratorTable tests owner can delete a collaborator after confirming
statusReason: Unable to find an element with the text: /Please confirm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Survived] StringLiteral
main/components/Projects/ProjectCollaboratorTable.jsx:84:61
         <Modal.Body>
           {collaboratorToDelete && (
             <p>
-              Please confirm that you really want to remove{" "}
+              Please confirm that you really want to remove{""}
               <strong>
                 {collaboratorToDelete.firstName} {collaboratorToDelete.lastName}

[Survived] StringLiteral
main/components/Projects/ProjectCollaboratorTable.jsx:87:25
               Please confirm that you really want to remove{" "}
               <strong>
                 {collaboratorToDelete.firstName} {collaboratorToDelete.lastName}
-              </strong>{" "}
+              </strong>{""}
               as a collaborator. This action cannot be undone.
             </p>

[Killed] ArrowFunction
main/components/Projects/ProjectCollaboratorTable.jsx:99:22
           <Button
             variant="danger"
             data-testid={`${testIdPrefix}-delete-modal-confirm-button`}
-            onClick={() => deleteMutation.mutate(collaboratorToDelete)}
+            onClick={() => undefined}
           >
             Yes, Delete
killedBy: ProjectCollaboratorTable tests owner can delete a collaborator after confirming
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""
