[Killed] BlockStatement
main/components/Projects/ProjectModal.jsx:28:19
 
   // Reset form when initialContents changes (e.g., when editing). When creating a new project
   // (no initialContents), default citationFormat to the last one the user chose.
-  useEffect(() => {
-    reset({
-      citationFormat: getLastCitationFormat(),
-      ...initialContents,
-    });
-  }, [initialContents, reset]);
+  useEffect(() => {}, [initialContents, reset]);
 
   const closeModal = () => {
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: expected { name: 'Citation Graphs', …(2) } to deeply equal { name: 'Citation Graphs', …(2) }

[Killed] ObjectLiteral
main/components/Projects/ProjectModal.jsx:29:11
   // Reset form when initialContents changes (e.g., when editing). When creating a new project
   // (no initialContents), default citationFormat to the last one the user chose.
   useEffect(() => {
-    reset({
-      citationFormat: getLastCitationFormat(),
-      ...initialContents,
-    });
+    reset({});
   }, [initialContents, reset]);
 
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: expected { name: 'Citation Graphs', …(2) } to deeply equal { name: 'Citation Graphs', …(2) }

[Killed] BlockStatement
main/components/Projects/ProjectModal.jsx:35:28
     });
   }, [initialContents, reset]);
 
-  const closeModal = () => {
-    toggleShowModal(false);
-  };
+  const closeModal = () => {};
 
   const onSubmit = (data) => {
killedBy: ProjectModal tests close button toggles the modal closed
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Number of calls: 0

[Killed] BooleanLiteral
main/components/Projects/ProjectModal.jsx:36:21
   }, [initialContents, reset]);
 
   const closeModal = () => {
-    toggleShowModal(false);
+    toggleShowModal(true);
   };
 
killedBy: ProjectModal tests close button toggles the modal closed
statusReason: expected "vi.fn()" to be called with arguments: [ false ]

Received:

  1st vi.fn() call:

  [
-   false,

[Killed] BlockStatement
main/components/Projects/ProjectModal.jsx:39:30
     toggleShowModal(false);
   };
 
-  const onSubmit = (data) => {
-    setLastCitationFormat(data.citationFormat);
-    onSubmitAction(data);
-  };
+  const onSubmit = (data) => {};
 
   return (
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Projects/ProjectModal.jsx:70:36
               id="name"
               type="text"
               isInvalid={Boolean(errors.name)}
-              {...register("name", {
-                required: "Project Name is required.",
-              })}
+              {...register("name", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ProjectModal tests renders create form by default and validates required fields
statusReason: Unable to find an element with the text: Project Name is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ArrowFunction
main/components/Projects/ProjectModal.jsx:101:44
               id="citationFormat"
               {...register("citationFormat")}
             >
-              {CITATION_FORMAT_OPTIONS.map((option) => (
-                <option key={option} value={option}>
-                  {option}
-                </option>
-              ))}
+              {CITATION_FORMAT_OPTIONS.map(() => undefined)}
             </Form.Select>
           </Form.Group>
killedBy: ProjectModal tests defaults citation format to ACM
statusReason: expect(element).toHaveValue(ACM)

Expected the element to have value:
  ACM
Received:
  undefined
