[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:22:32
     "/api/projects/list/collaborator",
   ],
 }) {
-  const canEdit = (project) => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return true;
-    }
-    return (
-      hasRole(currentUser, "ROLE_RESEARCHER") &&
-      currentUser?.root?.user?.email === project.owner
-    );
-  };
+  const canEdit = (project) => {};
 
   const [showEditModal, setShowEditModal] = useState(false);
killedBy: ProjectTable tests shows edit/delete buttons for the owning researcher
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] ConditionalExpression
main/components/Projects/ProjectTable.jsx:23:9
   ],
 }) {
   const canEdit = (project) => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
+    if (true) {
       return true;
     }
killedBy: ProjectTable tests renders expected columns and links, and hides edit/delete for non-owners
statusReason: Found multiple elements with the text: Edit

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="ProjectTable-header-edit-sort-header"
>

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:23:45
   ],
 }) {
   const canEdit = (project) => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return true;
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
     return (
       hasRole(currentUser, "ROLE_RESEARCHER") &&
killedBy: ProjectTable tests shows edit/delete buttons for admins on any project
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] ConditionalExpression
main/components/Projects/ProjectTable.jsx:27:7
       return true;
     }
     return (
-      hasRole(currentUser, "ROLE_RESEARCHER") &&
-      currentUser?.root?.user?.email === project.owner
+      false
     );
   };
killedBy: ProjectTable tests shows edit/delete buttons for the owning researcher
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] LogicalOperator
main/components/Projects/ProjectTable.jsx:27:7
       return true;
     }
     return (
-      hasRole(currentUser, "ROLE_RESEARCHER") &&
-      currentUser?.root?.user?.email === project.owner
+      hasRole(currentUser, "ROLE_RESEARCHER") || currentUser?.root?.user?.email === project.owner
     );
   };
killedBy: ProjectTable tests shows edit/delete buttons for the owning researcher
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-2-col-edit-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] ConditionalExpression
main/components/Projects/ProjectTable.jsx:28:7
     }
     return (
       hasRole(currentUser, "ROLE_RESEARCHER") &&
-      currentUser?.root?.user?.email === project.owner
+      true
     );
   };
killedBy: ProjectTable tests shows edit/delete buttons for the owning researcher
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-2-col-edit-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] EqualityOperator
main/components/Projects/ProjectTable.jsx:28:7
     }
     return (
       hasRole(currentUser, "ROLE_RESEARCHER") &&
-      currentUser?.root?.user?.email === project.owner
+      currentUser?.root?.user?.email !== project.owner
     );
   };
killedBy: ProjectTable tests shows edit/delete buttons for the owning researcher
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] BooleanLiteral
main/components/Projects/ProjectTable.jsx:32:54
     );
   };
 
-  const [showEditModal, setShowEditModal] = useState(false);
+  const [showEditModal, setShowEditModal] = useState(true);
   const [selectedProjectForEdit, setSelectedProjectForEdit] = useState(null);
   const [showDeleteModal, setShowDeleteModal] = useState(false);
killedBy: ProjectTable tests renders expected columns and links, and hides edit/delete for non-owners
statusReason: Found multiple elements with the text: Project Name

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="ProjectTable-header-name-sort-header"
>

[Survived] BooleanLiteral
main/components/Projects/ProjectTable.jsx:34:58
 
   const [showEditModal, setShowEditModal] = useState(false);
   const [selectedProjectForEdit, setSelectedProjectForEdit] = useState(null);
-  const [showDeleteModal, setShowDeleteModal] = useState(false);
+  const [showDeleteModal, setShowDeleteModal] = useState(true);
   const [projectToDelete, setProjectToDelete] = useState(null);
 

[Killed] ArrowFunction
main/components/Projects/ProjectTable.jsx:37:33
   const [showDeleteModal, setShowDeleteModal] = useState(false);
   const [projectToDelete, setProjectToDelete] = useState(null);
 
-  const cellToAxiosParamsEdit = (formData) => ({
-    url: "/api/projects",
-    method: "PUT",
-    params: {
-      projectId: formData.projectId,
-      name: formData.name,
-      description: formData.description,
-      citationFormat: formData.citationFormat,
-    },
-  });
+  const cellToAxiosParamsEdit = () => undefined;
 
   const cellToAxiosParamsDelete = (project) => ({
killedBy: ProjectTable tests owner can edit a project via the modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Projects/ProjectTable.jsx:37:48
   const [showDeleteModal, setShowDeleteModal] = useState(false);
   const [projectToDelete, setProjectToDelete] = useState(null);
 
-  const cellToAxiosParamsEdit = (formData) => ({
-    url: "/api/projects",
-    method: "PUT",
-    params: {
-      projectId: formData.projectId,
-      name: formData.name,
-      description: formData.description,
-      citationFormat: formData.citationFormat,
-    },
-  });
+  const cellToAxiosParamsEdit = (formData) => ({});
 
   const cellToAxiosParamsDelete = (project) => ({
killedBy: ProjectTable tests owner can edit a project via the modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Projects/ProjectTable.jsx:38:10
   const [projectToDelete, setProjectToDelete] = useState(null);
 
   const cellToAxiosParamsEdit = (formData) => ({
-    url: "/api/projects",
+    url: "",
     method: "PUT",
     params: {
killedBy: ProjectTable tests owner can edit a project via the modal
statusReason: expected "vi.fn()" to be called with arguments: [ 'Project updated successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Project updated successfully",

[Killed] ArrowFunction
main/components/Projects/ProjectTable.jsx:48:35
     },
   });
 
-  const cellToAxiosParamsDelete = (project) => ({
-    url: "/api/projects",
-    method: "DELETE",
-    params: {
-      projectId: project.id,
-    },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   const onEditSuccess = () => {
killedBy: ProjectTable tests owner can delete a project after confirming
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:56:31
     },
   });
 
-  const onEditSuccess = () => {
-    setShowEditModal(false);
-    setSelectedProjectForEdit(null);
-    toast("Project updated successfully");
-  };
+  const onEditSuccess = () => {};
 
   const onEditError = (error) => {
killedBy: ProjectTable tests owner can edit a project via the modal
statusReason: expected "vi.fn()" to be called with arguments: [ 'Project updated successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BooleanLiteral
main/components/Projects/ProjectTable.jsx:57:22
   });
 
   const onEditSuccess = () => {
-    setShowEditModal(false);
+    setShowEditModal(true);
     setSelectedProjectForEdit(null);
     toast("Project updated successfully");

[Killed] StringLiteral
main/components/Projects/ProjectTable.jsx:59:11
   const onEditSuccess = () => {
     setShowEditModal(false);
     setSelectedProjectForEdit(null);
-    toast("Project updated successfully");
+    toast("");
   };
 
killedBy: ProjectTable tests owner can edit a project via the modal
statusReason: expected "vi.fn()" to be called with arguments: [ 'Project updated successfully' ]

Received:

  1st vi.fn() call:

  [
-   "Project updated successfully",

[NoCoverage] BlockStatement
main/components/Projects/ProjectTable.jsx:62:34
     toast("Project updated successfully");
   };
 
-  const onEditError = (error) => {
-    // Stryker disable next-line OptionalChaining : defensive coding for error shape
-    if (error.response?.data?.message)
-      toast(`Could not update project:\n${error.response.data.message}`);
-    else toast(`Could not update project:\n${error.message}`);
-  };
+  const onEditError = (error) => {};
 
   const onDeleteSuccess = () => {

[NoCoverage] StringLiteral
main/components/Projects/ProjectTable.jsx:65:13
   const onEditError = (error) => {
     // Stryker disable next-line OptionalChaining : defensive coding for error shape
     if (error.response?.data?.message)
-      toast(`Could not update project:\n${error.response.data.message}`);
+      toast(``);
     else toast(`Could not update project:\n${error.message}`);
   };

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:69:33
     else toast(`Could not update project:\n${error.message}`);
   };
 
-  const onDeleteSuccess = () => {
-    toast("Project deleted successfully");
-    setShowDeleteModal(false);
-    setProjectToDelete(null);
-  };
+  const onDeleteSuccess = () => {};
 
   const onDeleteError = (error) => {
killedBy: ProjectTable tests owner can delete a project after confirming
statusReason: expected "vi.fn()" to be called with arguments: [ 'Project deleted successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BooleanLiteral
main/components/Projects/ProjectTable.jsx:71:24
 
   const onDeleteSuccess = () => {
     toast("Project deleted successfully");
-    setShowDeleteModal(false);
+    setShowDeleteModal(true);
     setProjectToDelete(null);
   };

[NoCoverage] BlockStatement
main/components/Projects/ProjectTable.jsx:75:36
     setProjectToDelete(null);
   };
 
-  const onDeleteError = (error) => {
-    // Stryker disable next-line OptionalChaining : defensive coding for error shape
-    if (error.response?.data?.message)
-      toast(`Could not delete project:\n${error.response.data.message}`);
-    else toast(`Could not delete project:\n${error.message}`);
-  };
+  const onDeleteError = (error) => {};
 
   const editMutation = useBackendMutation(

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:94:44
     mutationQueryKeys,
   );
 
-  const handleShowEditModal = (project) => {
-    setSelectedProjectForEdit(project);
-    setShowEditModal(true);
-  };
+  const handleShowEditModal = (project) => {};
 
   const handleUpdateProject = (formData) => {
killedBy: ProjectTable tests owner can edit a project via the modal
statusReason: Unable to find an element by: [data-testid="ProjectModal-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] BooleanLiteral
main/components/Projects/ProjectTable.jsx:96:22
 
   const handleShowEditModal = (project) => {
     setSelectedProjectForEdit(project);
-    setShowEditModal(true);
+    setShowEditModal(false);
   };
 
killedBy: ProjectTable tests owner can edit a project via the modal
statusReason: Unable to find an element by: [data-testid="ProjectModal-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:99:45
     setShowEditModal(true);
   };
 
-  const handleUpdateProject = (formData) => {
-    formData.projectId = selectedProjectForEdit.id;
-    editMutation.mutate(formData);
-  };
+  const handleUpdateProject = (formData) => {};
 
   const columns = [
killedBy: ProjectTable tests owner can edit a project via the modal
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:112:27
     {
       header: "Project Name",
       id: "name",
-      cell: ({ cell }) => {
-        const project = cell.row.original;
-        return (
-          <Link
-            to={`/project/${project.id}`}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-name-link`}
-          >
-            <GraphIcon className="me-2" width={20} height={20} />
-            {project.name}
-          </Link>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: ProjectTable tests renders expected columns and links, and hides edit/delete for non-owners
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-name-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] ObjectLiteral
main/components/Projects/ProjectTable.jsx:125:5
         );
       },
     },
-    {
-      header: "Settings",
-      id: "settings",
-      cell: ({ cell }) => {
-        const project = cell.row.original;
-        return (
-          <Link
-            to={`/project/${project.id}/settings`}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-settings-link`}
-          >
-            <UserListIcon width={20} height={20} />
-          </Link>
-        );
-      },
-    },
+    {},
     {
       header: "Description",
killedBy: ProjectTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:128:27
     {
       header: "Settings",
       id: "settings",
-      cell: ({ cell }) => {
-        const project = cell.row.original;
-        return (
-          <Link
-            to={`/project/${project.id}/settings`}
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-settings-link`}
-          >
-            <UserListIcon width={20} height={20} />
-          </Link>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: ProjectTable tests renders expected columns and links, and hides edit/delete for non-owners
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-settings-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] StringLiteral
main/components/Projects/ProjectTable.jsx:141:15
       },
     },
     {
-      header: "Description",
+      header: "",
       accessorKey: "description",
     },
killedBy: ProjectTable tests renders expected columns and links, and hides edit/delete for non-owners
statusReason: Unable to find an element with the text: Description. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] StringLiteral
main/components/Projects/ProjectTable.jsx:142:20
     },
     {
       header: "Description",
-      accessorKey: "description",
+      accessorKey: "",
     },
     {
killedBy: ProjectTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Projects/ProjectTable.jsx:144:5
       header: "Description",
       accessorKey: "description",
     },
-    {
-      header: "Date Created",
-      id: "dateCreated",
-      accessorFn: (row) => formatTime(row.dateCreated),
-    },
+    {},
     {
       header: "Owner",
killedBy: ProjectTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Projects/ProjectTable.jsx:146:11
     },
     {
       header: "Date Created",
-      id: "dateCreated",
+      id: "",
       accessorFn: (row) => formatTime(row.dateCreated),
     },
killedBy: ProjectTable tests renders without crashing for empty table
statusReason: Columns require an id when using an accessorFn

[Survived] ArrowFunction
main/components/Projects/ProjectTable.jsx:147:19
     {
       header: "Date Created",
       id: "dateCreated",
-      accessorFn: (row) => formatTime(row.dateCreated),
+      accessorFn: () => undefined,
     },
     {

[Killed] StringLiteral
main/components/Projects/ProjectTable.jsx:150:15
       accessorFn: (row) => formatTime(row.dateCreated),
     },
     {
-      header: "Owner",
+      header: "",
       accessorKey: "owner",
     },
killedBy: ProjectTable tests renders expected columns and links, and hides edit/delete for non-owners
statusReason: Unable to find an element with the text: Owner. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] StringLiteral
main/components/Projects/ProjectTable.jsx:151:20
     },
     {
       header: "Owner",
-      accessorKey: "owner",
+      accessorKey: "",
     },
     {
killedBy: ProjectTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Projects/ProjectTable.jsx:153:5
       header: "Owner",
       accessorKey: "owner",
     },
-    {
-      header: "Citation Format",
-      accessorKey: "citationFormat",
-    },
+    {},
     {
       header: "Edit",
killedBy: ProjectTable tests renders without crashing for empty table
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:160:27
     {
       header: "Edit",
       id: "edit",
-      cell: ({ cell }) => {
-        const project = cell.row.original;
-        if (canEdit(project)) {
-          return (
-            <Button
-              variant="outline-primary"
-              size="sm"
-              onClick={() => handleShowEditModal(project)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-button`}
-            >
-              Edit
-            </Button>
-          );
-        }
-        return (
-          <span
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-no-permission`}
-          ></span>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: ProjectTable tests renders expected columns and links, and hides edit/delete for non-owners
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-edit-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:162:31
       id: "edit",
       cell: ({ cell }) => {
         const project = cell.row.original;
-        if (canEdit(project)) {
-          return (
-            <Button
-              variant="outline-primary"
-              size="sm"
-              onClick={() => handleShowEditModal(project)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-button`}
-            >
-              Edit
-            </Button>
-          );
-        }
+        if (canEdit(project)) {}
         return (
           <span
killedBy: ProjectTable tests shows edit/delete buttons for the owning researcher
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] ConditionalExpression
main/components/Projects/ProjectTable.jsx:162:13
       id: "edit",
       cell: ({ cell }) => {
         const project = cell.row.original;
-        if (canEdit(project)) {
+        if (false) {
           return (
             <Button
killedBy: ProjectTable tests shows edit/delete buttons for the owning researcher
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] ArrowFunction
main/components/Projects/ProjectTable.jsx:167:24
             <Button
               variant="outline-primary"
               size="sm"
-              onClick={() => handleShowEditModal(project)}
+              onClick={() => undefined}
               data-testid={`${testId}-cell-row-${cell.row.index}-col-edit-button`}
             >
killedBy: ProjectTable tests owner can edit a project via the modal
statusReason: Unable to find an element by: [data-testid="ProjectModal-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:184:27
     {
       header: "Delete",
       id: "delete",
-      cell: ({ cell }) => {
-        const project = cell.row.original;
-        if (canEdit(project)) {
-          return (
-            <Button
-              variant="danger"
-              size="sm"
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
-              onClick={() => {
-                setProjectToDelete(project);
-                setShowDeleteModal(true);
-              }}
-            >
-              Delete
-            </Button>
-          );
-        }
-        return (
-          <span
-            data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-no-permission`}
-          ></span>
-        );
-      },
+      cell: ({ cell }) => {},
     },
   ];
killedBy: ProjectTable tests renders expected columns and links, and hides edit/delete for non-owners
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-delete-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:186:31
       id: "delete",
       cell: ({ cell }) => {
         const project = cell.row.original;
-        if (canEdit(project)) {
-          return (
-            <Button
-              variant="danger"
-              size="sm"
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
-              onClick={() => {
-                setProjectToDelete(project);
-                setShowDeleteModal(true);
-              }}
-            >
-              Delete
-            </Button>
-          );
-        }
+        if (canEdit(project)) {}
         return (
           <span
killedBy: ProjectTable tests shows edit/delete buttons for the owning researcher
statusReason: Unable to find an element by: [data-testid="ProjectTable-cell-row-0-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] ConditionalExpression
main/components/Projects/ProjectTable.jsx:186:13
       id: "delete",
       cell: ({ cell }) => {
         const project = cell.row.original;
-        if (canEdit(project)) {
+        if (true) {
           return (
             <Button
killedBy: ProjectTable tests renders expected columns and links, and hides edit/delete for non-owners
statusReason: Found multiple elements with the text: Delete

Here are the matching elements:

Ignored nodes: comments, script, style
<div
  data-testid="ProjectTable-header-delete-sort-header"
>

[Killed] BlockStatement
main/components/Projects/ProjectTable.jsx:192:30
               variant="danger"
               size="sm"
               data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
-              onClick={() => {
-                setProjectToDelete(project);
-                setShowDeleteModal(true);
-              }}
+              onClick={() => {}}
             >
               Delete
killedBy: ProjectTable tests owner can delete a project after confirming
statusReason: Unable to find an element with the text: /Please confirm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] BooleanLiteral
main/components/Projects/ProjectTable.jsx:194:36
               data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
               onClick={() => {
                 setProjectToDelete(project);
-                setShowDeleteModal(true);
+                setShowDeleteModal(false);
               }}
             >
killedBy: ProjectTable tests owner can delete a project after confirming
statusReason: Unable to find an element with the text: /Please confirm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ProjectTable"

[Killed] ConditionalExpression
main/components/Projects/ProjectTable.jsx:232:12
         </Modal.Header>
 
         <Modal.Body>
-          {projectToDelete && (
-            <p>
-              Please confirm that you really want to delete project{" "}
-              <strong>{projectToDelete.name}</strong>. This action cannot be
-              undone.
-            </p>
-          )}
+          {false}
         </Modal.Body>
 
killedBy: ProjectTable tests owner can delete a project after confirming
statusReason: Unable to find an element with the text: /Please confirm/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] LogicalOperator
main/components/Projects/ProjectTable.jsx:232:12
         </Modal.Header>
 
         <Modal.Body>
-          {projectToDelete && (
-            <p>
-              Please confirm that you really want to delete project{" "}
-              <strong>{projectToDelete.name}</strong>. This action cannot be
-              undone.
-            </p>
-          )}
+          {projectToDelete || <p>
+              Please confirm that you really want to delete project{" "}
+              <strong>{projectToDelete.name}</strong>. This action cannot be
+              undone.
+            </p>}
         </Modal.Body>
 
killedBy: ProjectTable tests renders without crashing for empty table
statusReason: Cannot read properties of null (reading 'name')

[Killed] ArrowFunction
main/components/Projects/ProjectTable.jsx:249:22
           <Button
             variant="danger"
             data-testid={`${testId}-delete-modal-confirm-button`}
-            onClick={() => deleteMutation.mutate(projectToDelete)}
+            onClick={() => undefined}
           >
             Yes, Delete
killedBy: ProjectTable tests owner can delete a project after confirming
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""
