[Killed] StringLiteral
components/Tags/TabComponent/TagsTabComponent.jsx:10:18
 
 export default function TagsTabComponent({
   projectId,
-  testIdPrefix = "TagsTabComponent",
+  testIdPrefix = "",
   canEdit = true,
 }) {
killedBy: TagsTabComponent tests sees the Add Tag button and can add one
statusReason: Unable to find an element by: [data-testid="TagsTabComponent-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="-TagsTabComponent"

[Killed] BooleanLiteral
components/Tags/TabComponent/TagsTabComponent.jsx:11:13
 export default function TagsTabComponent({
   projectId,
   testIdPrefix = "TagsTabComponent",
-  canEdit = true,
+  canEdit = false,
 }) {
   const [postModal, showPostModal] = useState(false);
killedBy: TagsTabComponent tests sees the Add Tag button and can add one
statusReason: Unable to find an element by: [data-testid="TagsTabComponent-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="TagsTabComponent-TagsTabComponent"

[Survived] ArrayDeclaration
components/Tags/TabComponent/TagsTabComponent.jsx:18:5
   const queryKey = `/api/tags/project?projectId=${projectId}`;
 
   const { data: tags } = useBackend(
-    [queryKey],
+    [],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
     { method: "GET", url: queryKey },

[Killed] ArrowFunction
components/Tags/TabComponent/TagsTabComponent.jsx:25:35
     true,
   );
 
-  const objectToAxiosParamsPost = (tag) => ({
-    url: `/api/tags/post`,
-    method: "POST",
-    params: {
-      projectId: projectId,
-      tag: tag.tag,
-      explanation: tag.explanation,
-      color: tag.color,
-    },
-  });
+  const objectToAxiosParamsPost = () => undefined;
 
   const onSuccessPost = () => {
killedBy: TagsTabComponent tests sees the Add Tag button and can add one
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
components/Tags/TabComponent/TagsTabComponent.jsx:26:10
   );
 
   const objectToAxiosParamsPost = (tag) => ({
-    url: `/api/tags/post`,
+    url: ``,
     method: "POST",
     params: {
killedBy: TagsTabComponent tests sees the Add Tag button and can add one
statusReason: expected "vi.fn()" to be called with arguments: [ 'Tag successfully added.' ]

Received:

  1st vi.fn() call:

  [
-   "Tag successfully added.",

[Killed] ObjectLiteral
components/Tags/TabComponent/TagsTabComponent.jsx:28:13
   const objectToAxiosParamsPost = (tag) => ({
     url: `/api/tags/post`,
     method: "POST",
-    params: {
-      projectId: projectId,
-      tag: tag.tag,
-      explanation: tag.explanation,
-      color: tag.color,
-    },
+    params: {},
   });
 
killedBy: TagsTabComponent tests sees the Add Tag button and can add one
statusReason: expected {} to deeply equal { projectId: 1, …(3) }

[Killed] BlockStatement
components/Tags/TabComponent/TagsTabComponent.jsx:36:31
     },
   });
 
-  const onSuccessPost = () => {
-    toast("Tag successfully added.");
-    showPostModal(false);
-  };
+  const onSuccessPost = () => {};
 
   const onErrorPost = (error) => {
killedBy: TagsTabComponent tests sees the Add Tag button and can add one
statusReason: expected "vi.fn()" to be called with arguments: [ 'Tag successfully added.' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Survived] BooleanLiteral
components/Tags/TabComponent/TagsTabComponent.jsx:38:19
 
   const onSuccessPost = () => {
     toast("Tag successfully added.");
-    showPostModal(false);
+    showPostModal(true);
   };
 

[Killed] BlockStatement
components/Tags/TabComponent/TagsTabComponent.jsx:41:34
     showPostModal(false);
   };
 
-  const onErrorPost = (error) => {
-    // Stryker disable next-line OptionalChaining : defensive coding for error shape
-    if (error.response?.data?.message)
-      toast(`Could not add tag:\n${error.response.data.message}`);
-    else toast(`Could not add tag:\n${error.message}`);
-  };
+  const onErrorPost = (error) => {};
 
   const tagPostMutation = useBackendMutation(
killedBy: TagsTabComponent tests shows a toast with the server message when adding fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
components/Tags/TabComponent/TagsTabComponent.jsx:44:13
   const onErrorPost = (error) => {
     // Stryker disable next-line OptionalChaining : defensive coding for error shape
     if (error.response?.data?.message)
-      toast(`Could not add tag:\n${error.response.data.message}`);
+      toast(``);
     else toast(`Could not add tag:\n${error.message}`);
   };
killedBy: TagsTabComponent tests shows a toast with the server message when adding fails
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received:

  1st vi.fn() call:

  [
-   "Could not add tag:

[NoCoverage] StringLiteral
components/Tags/TabComponent/TagsTabComponent.jsx:45:16
     // Stryker disable next-line OptionalChaining : defensive coding for error shape
     if (error.response?.data?.message)
       toast(`Could not add tag:\n${error.response.data.message}`);
-    else toast(`Could not add tag:\n${error.message}`);
+    else toast(``);
   };
 

[Killed] BlockStatement
components/Tags/TabComponent/TagsTabComponent.jsx:54:37
     [queryKey],
   );
 
-  const handlePostSubmit = (tag) => {
-    tagPostMutation.mutate(tag);
-  };
+  const handlePostSubmit = (tag) => {};
 
   return (
killedBy: TagsTabComponent tests sees the Add Tag button and can add one
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Survived] StringLiteral
components/Tags/TabComponent/TagsTabComponent.jsx:60:20
 
   return (
     <div
-      data-testid={`${testIdPrefix}-TagsTabComponent`}
+      data-testid={``}
       className="tabComponent"
     >

[Killed] ConditionalExpression
components/Tags/TabComponent/TagsTabComponent.jsx:69:8
         onSubmitAction={handlePostSubmit}
         testId={`${testIdPrefix}-TagModal`}
       />
-      {canEdit && (
-        <Row className="p-2">
-          <Button
-            onClick={() => showPostModal(true)}
-            data-testid={`${testIdPrefix}-post-button`}
-          >
-            Add Tag
-          </Button>
-        </Row>
-      )}
+      {true}
       <Row>
         <TagTable
killedBy: TagsTabComponent tests sees the Add Tag button and can add one
statusReason: Unable to find an element by: [data-testid="TagsTabComponent-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="TagsTabComponent-TagsTabComponent"

[Killed] ConditionalExpression
components/Tags/TabComponent/TagsTabComponent.jsx:69:8
         onSubmitAction={handlePostSubmit}
         testId={`${testIdPrefix}-TagModal`}
       />
-      {canEdit && (
-        <Row className="p-2">
-          <Button
-            onClick={() => showPostModal(true)}
-            data-testid={`${testIdPrefix}-post-button`}
-          >
-            Add Tag
-          </Button>
-        </Row>
-      )}
+      {false}
       <Row>
         <TagTable
killedBy: TagsTabComponent tests sees the Add Tag button and can add one
statusReason: Unable to find an element by: [data-testid="TagsTabComponent-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="tabComponent"
      data-testid="TagsTabComponent-TagsTabComponent"
