[Killed] StringLiteral
main/components/Tags/TagModal.jsx:14:12
   initialContents,
   buttonText = "Create",
   modalTitle = "Create Tag",
-  testId = "TagModal",
+  testId = "",
 }) {
   const {
killedBy: TagModal tests renders create form by default and validates required fields
statusReason: Unable to find an element by: [data-testid="TagModal-submit"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] BlockStatement
main/components/Tags/TagModal.jsx:25:19
   } = useForm({});
 
   // Reset form when initialContents changes (e.g., when editing)
-  useEffect(() => {
-    reset(initialContents);
-  }, [initialContents, reset]);
+  useEffect(() => {}, [initialContents, reset]);
 
   const closeModal = () => {
killedBy: TagModal tests shows edit title/button text and prefills from initialContents
statusReason: expect(element).toHaveValue(existing)

Expected the element to have value:
  existing
Received:

[Killed] StringLiteral
main/components/Tags/TagModal.jsx:38:20
       show={showModal}
       onHide={closeModal}
       centered={true}
-      data-testid={`${testId}-base`}
+      data-testid={``}
     >
       <Modal.Header>
killedBy: TagModal tests respects a custom testId prefix
statusReason: Unable to find an element by: [data-testid="CustomTagModal-base"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Tags/TagModal.jsx:46:24
           type="button"
           className="btn-close"
           aria-label="Close"
-          data-testid={`${testId}-closeButton`}
+          data-testid={``}
           onClick={closeModal}
         ></button>
killedBy: TagModal tests close button toggles the modal closed
statusReason: Unable to find an element by: [data-testid="TagModal-closeButton"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Tags/TagModal.jsx:60:27
               type="text"
               isInvalid={Boolean(errors.tag)}
               {...register("tag", {
-                required: "Tag is required.",
+                required: "",
               })}
             />
killedBy: TagModal tests renders create form by default and validates required fields
statusReason: Unable to find an element with the text: Tag is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] OptionalChaining
main/components/Tags/TagModal.jsx:64:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.tag?.message}
+              {errors.tag.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: TagModal tests renders create form by default and validates required fields
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ArrowFunction
main/components/Tags/TagModal.jsx:89:23
               name="color"
               control={control}
               defaultValue=""
-              render={({ field: { value, onChange } }) => (
-                <ColorChooser
-                  value={value}
-                  onChange={onChange}
-                  testId={`${testId}-ColorChooser`}
-                />
-              )}
+              render={() => undefined}
             />
           </Form.Group>
killedBy: TagModal tests allows choosing a color via the ColorChooser and submits it
statusReason: Unable to find an element by: [data-testid="TagModal-ColorChooser-swatch-#e53935"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] StringLiteral
main/components/Tags/TagModal.jsx:93:27
                 <ColorChooser
                   value={value}
                   onChange={onChange}
-                  testId={`${testId}-ColorChooser`}
+                  testId={``}
                 />
               )}
killedBy: TagModal tests allows choosing a color via the ColorChooser and submits it
statusReason: Unable to find an element by: [data-testid="TagModal-ColorChooser-swatch-#e53935"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>
