[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:14:27
 import { useBackendMutation } from "main/utils/useBackend";
 import TagModal from "main/components/Tags/TagModal";
 
-const DEFAULT_TAG_COLOR = "#6c757d";
+const DEFAULT_TAG_COLOR = "";
 
 function TagPill({ tag, testId }) {
killedBy: TagSelector tests uses default color when a tag has no color
statusReason: expect(element).toHaveStyle()

- Expected

- background-color: rgb(108, 117, 125);

[Killed] BlockStatement
main/components/Tags/TagSelector.jsx:16:35
 
 const DEFAULT_TAG_COLOR = "#6c757d";
 
-function TagPill({ tag, testId }) {
-  const color = tag.color || DEFAULT_TAG_COLOR;
-  return (
-    <Badge
-      pill
-      bg={null}
-      style={{
-        backgroundColor: color,
-        color: getContrastTextColor(color),
-      }}
-      data-testid={testId}
-    >
-      {tag.tag}
-    </Badge>
-  );
-}
+function TagPill({ tag, testId }) {}
 
 export default function TagSelector({
killedBy: TagSelector tests renders assigned tags as colored pill badges with contrast text
statusReason: Unable to find an element by: [data-testid="TagSelector-assigned-tag-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:17:17
 const DEFAULT_TAG_COLOR = "#6c757d";
 
 function TagPill({ tag, testId }) {
-  const color = tag.color || DEFAULT_TAG_COLOR;
+  const color = true;
   return (
     <Badge
killedBy: TagSelector tests renders assigned tags as colored pill badges with contrast text
statusReason: expect(element).toHaveStyle()

- Expected

- background-color: rgb(30, 136, 229);

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:17:17
 const DEFAULT_TAG_COLOR = "#6c757d";
 
 function TagPill({ tag, testId }) {
-  const color = tag.color || DEFAULT_TAG_COLOR;
+  const color = false;
   return (
     <Badge
killedBy: TagSelector tests renders assigned tags as colored pill badges with contrast text
statusReason: expect(element).toHaveStyle()

- Expected

- background-color: rgb(30, 136, 229);

[Killed] BooleanLiteral
main/components/Tags/TagSelector.jsx:39:13
   onAddTag = () => {},
   onRemoveTag = () => {},
   projectId,
-  canEdit = true,
+  canEdit = false,
   testId = "TagSelector",
 }) {
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-add-tag-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:42:48
   canEdit = true,
   testId = "TagSelector",
 }) {
-  const assignedIds = new Set(assignedTags.map((tag) => tag.id));
+  const assignedIds = new Set(assignedTags.map(() => undefined));
   const availableTags = allTags.filter((tag) => !assignedIds.has(tag.id));
 
killedBy: TagSelector tests dropdown lists only unassigned tags, with pill and explanation
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="dropdown-item"
  data-rr-ui-dropdown-item=""
  data-testid="TagSelector-available-tag-1"
  type="button"
>

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:43:40
   testId = "TagSelector",
 }) {
   const assignedIds = new Set(assignedTags.map((tag) => tag.id));
-  const availableTags = allTags.filter((tag) => !assignedIds.has(tag.id));
+  const availableTags = allTags.filter(() => undefined);
 
   const [showNewTagModal, setShowNewTagModal] = useState(false);
killedBy: TagSelector tests dropdown lists only unassigned tags, with pill and explanation
statusReason: Unable to find an element by: [data-testid="TagSelector-available-tag-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] BooleanLiteral
main/components/Tags/TagSelector.jsx:43:49
   testId = "TagSelector",
 }) {
   const assignedIds = new Set(assignedTags.map((tag) => tag.id));
-  const availableTags = allTags.filter((tag) => !assignedIds.has(tag.id));
+  const availableTags = allTags.filter((tag) => assignedIds.has(tag.id));
 
   const [showNewTagModal, setShowNewTagModal] = useState(false);
killedBy: BibTexEntryShowPage tests shows a TagSelector with the project's tags and the entry's assigned tags
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-TagSelector-available-tag-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BooleanLiteral
main/components/Tags/TagSelector.jsx:45:58
   const assignedIds = new Set(assignedTags.map((tag) => tag.id));
   const availableTags = allTags.filter((tag) => !assignedIds.has(tag.id));
 
-  const [showNewTagModal, setShowNewTagModal] = useState(false);
+  const [showNewTagModal, setShowNewTagModal] = useState(true);
 
   // Same query key TagsTabComponent uses for the project's tag list, so creating a tag here
killedBy: TagSelector tests clicking New Tag opens the create-tag modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="TagSelector-TagModal-base"
>
  <div
    class="modal-content"

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:52:5
   const tagsQueryKey = `/api/tags/project?projectId=${projectId}`;
 
   const createTagMutation = useBackendMutation(
-    (tag) => ({
-      url: "/api/tags/post",
-      method: "POST",
-      params: {
-        projectId,
-        tag: tag.tag,
-        explanation: tag.explanation,
-        color: tag.color,
-      },
-    }),
+    () => undefined,
     {
       onSuccess: () => {
killedBy: TagSelector tests submitting the New Tag modal POSTs the new tag, toasts, closes the modal, and refreshes the tag list
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Tags/TagSelector.jsx:52:15
   const tagsQueryKey = `/api/tags/project?projectId=${projectId}`;
 
   const createTagMutation = useBackendMutation(
-    (tag) => ({
-      url: "/api/tags/post",
-      method: "POST",
-      params: {
-        projectId,
-        tag: tag.tag,
-        explanation: tag.explanation,
-        color: tag.color,
-      },
-    }),
+    (tag) => ({}),
     {
       onSuccess: () => {
killedBy: TagSelector tests submitting the New Tag modal POSTs the new tag, toasts, closes the modal, and refreshes the tag list
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:53:12
 
   const createTagMutation = useBackendMutation(
     (tag) => ({
-      url: "/api/tags/post",
+      url: "",
       method: "POST",
       params: {
killedBy: TagSelector tests submitting the New Tag modal POSTs the new tag, toasts, closes the modal, and refreshes the tag list
statusReason: expected '' to be '/api/tags/post' // Object.is equality

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:54:15
   const createTagMutation = useBackendMutation(
     (tag) => ({
       url: "/api/tags/post",
-      method: "POST",
+      method: "",
       params: {
         projectId,
killedBy: TagSelector tests submitting the New Tag modal POSTs the new tag, toasts, closes the modal, and refreshes the tag list
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Tags/TagSelector.jsx:55:15
     (tag) => ({
       url: "/api/tags/post",
       method: "POST",
-      params: {
-        projectId,
-        tag: tag.tag,
-        explanation: tag.explanation,
-        color: tag.color,
-      },
+      params: {},
     }),
     {
killedBy: TagSelector tests submitting the New Tag modal POSTs the new tag, toasts, closes the modal, and refreshes the tag list
statusReason: expected {} to deeply equal { projectId: 1, tag: 'new-tag', …(2) }

[Killed] BlockStatement
main/components/Tags/TagSelector.jsx:63:24
       },
     }),
     {
-      onSuccess: () => {
-        toast("Tag successfully added.");
-        setShowNewTagModal(false);
-      },
+      onSuccess: () => {},
       onError: (error) => {
         // Stryker disable next-line OptionalChaining : defensive coding for error shape
killedBy: TagSelector tests submitting the New Tag modal POSTs the new tag, toasts, closes the modal, and refreshes the tag list
statusReason: expected "vi.fn()" to be called with arguments: [ 'Tag successfully added.' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/components/Tags/TagSelector.jsx:65:28
     {
       onSuccess: () => {
         toast("Tag successfully added.");
-        setShowNewTagModal(false);
+        setShowNewTagModal(true);
       },
       onError: (error) => {
killedBy: TagSelector tests submitting the New Tag modal POSTs the new tag, toasts, closes the modal, and refreshes the tag list
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="TagSelector-TagModal-base"
>
  <div
    class="modal-content"

[Killed] BlockStatement
main/components/Tags/TagSelector.jsx:67:27
         toast("Tag successfully added.");
         setShowNewTagModal(false);
       },
-      onError: (error) => {
-        // Stryker disable next-line OptionalChaining : defensive coding for error shape
-        if (error.response?.data?.message)
-          toast(`Could not add tag:\n${error.response.data.message}`);
-        else toast(`Could not add tag:\n${error.message}`);
-      },
+      onError: (error) => {},
     },
     [tagsQueryKey],
killedBy: TagSelector tests a network error (no response) on New Tag submission falls back to the raw error message
statusReason: expected "vi.fn()" to be called with arguments: [ 'Could not add tag:\nNetwork Error' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:77:34
     [tagsQueryKey],
   );
 
-  const withExplanationTooltip = (tag, tooltipId, children) => (
-    <OverlayTrigger
-      key={tag.id}
-      placement="top"
-      overlay={<Tooltip id={tooltipId}>{tag.explanation}</Tooltip>}
-    >
-      {children}
-    </OverlayTrigger>
-  );
+  const withExplanationTooltip = () => undefined;
 
   return (
killedBy: TagSelector tests renders assigned tags as colored pill badges with contrast text
statusReason: Unable to find an element by: [data-testid="TagSelector-assigned-tag-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:92:25
       <TagModal
         showModal={showNewTagModal}
         toggleShowModal={setShowNewTagModal}
-        onSubmitAction={(tag) => createTagMutation.mutate(tag)}
+        onSubmitAction={() => undefined}
         testId={`${testId}-TagModal`}
       />
killedBy: TagSelector tests submitting the New Tag modal POSTs the new tag, toasts, closes the modal, and refreshes the tag list
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:97:22
       />
       <div
         className="d-flex flex-wrap align-items-center gap-2"
-        data-testid={`${testId}-assigned-tags`}
+        data-testid={``}
       >
         {assignedTags.length === 0 && (
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-assigned-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:99:10
         className="d-flex flex-wrap align-items-center gap-2"
         data-testid={`${testId}-assigned-tags`}
       >
-        {assignedTags.length === 0 && (
-          <span data-testid={`${testId}-no-tags`} className="text-muted">
-            No tags assigned
-          </span>
-        )}
+        {true}
         {assignedTags.map((tag) =>
           withExplanationTooltip(
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-no-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:99:10
         className="d-flex flex-wrap align-items-center gap-2"
         data-testid={`${testId}-assigned-tags`}
       >
-        {assignedTags.length === 0 && (
+        {true && (
           <span data-testid={`${testId}-no-tags`} className="text-muted">
             No tags assigned
killedBy: TagSelector tests renders assigned tags as colored pill badges with contrast text
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-muted"
  data-testid="TagSelector-no-tags"
>
  No tags assigned
</span> instead

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:104:27
             No tags assigned
           </span>
         )}
-        {assignedTags.map((tag) =>
-          withExplanationTooltip(
-            tag,
-            `${testId}-assigned-tag-${tag.id}-tooltip`,
-            <span
-              className="d-inline-flex align-items-center"
-              data-testid={`${testId}-assigned-tag-${tag.id}`}
-            >
-              <TagPill
-                tag={tag}
-                testId={`${testId}-assigned-tag-${tag.id}-badge`}
-              />
-              {canEdit && (
-                <button
-                  type="button"
-                  className="btn btn-link btn-sm p-0 ms-1 text-decoration-none"
-                  aria-label={`Remove tag ${tag.tag}`}
-                  data-testid={`${testId}-remove-tag-${tag.id}`}
-                  onClick={() => onRemoveTag(tag)}
-                >
-                  &times;
-                </button>
-              )}
-            </span>,
-          ),
+        {assignedTags.map(() => undefined,
         )}
       </div>
killedBy: TagSelector tests renders assigned tags as colored pill badges with contrast text
statusReason: Unable to find an element by: [data-testid="TagSelector-assigned-tag-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:116:16
                 tag={tag}
                 testId={`${testId}-assigned-tag-${tag.id}-badge`}
               />
-              {canEdit && (
-                <button
-                  type="button"
-                  className="btn btn-link btn-sm p-0 ms-1 text-decoration-none"
-                  aria-label={`Remove tag ${tag.tag}`}
-                  data-testid={`${testId}-remove-tag-${tag.id}`}
-                  onClick={() => onRemoveTag(tag)}
-                >
-                  &times;
-                </button>
-              )}
+              {true}
             </span>,
           ),
killedBy: TagSelector tests clicking the remove button calls onRemoveTag with the tag
statusReason: Unable to find an element by: [data-testid="TagSelector-remove-tag-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:116:16
                 tag={tag}
                 testId={`${testId}-assigned-tag-${tag.id}-badge`}
               />
-              {canEdit && (
-                <button
-                  type="button"
-                  className="btn btn-link btn-sm p-0 ms-1 text-decoration-none"
-                  aria-label={`Remove tag ${tag.tag}`}
-                  data-testid={`${testId}-remove-tag-${tag.id}`}
-                  onClick={() => onRemoveTag(tag)}
-                >
-                  &times;
-                </button>
-              )}
+              {false}
             </span>,
           ),
killedBy: TagSelector tests clicking the remove button calls onRemoveTag with the tag
statusReason: Unable to find an element by: [data-testid="TagSelector-remove-tag-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:122:28
                   className="btn btn-link btn-sm p-0 ms-1 text-decoration-none"
                   aria-label={`Remove tag ${tag.tag}`}
                   data-testid={`${testId}-remove-tag-${tag.id}`}
-                  onClick={() => onRemoveTag(tag)}
+                  onClick={() => undefined}
                 >
                   &times;
killedBy: TagSelector tests clicking the remove button calls onRemoveTag with the tag
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 2, tag: 'background', …(2) } ]

Number of calls: 0

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:137:28
             <Dropdown.Toggle
               variant="outline-primary"
               size="sm"
-              data-testid={`${testId}-add-tag-dropdown`}
+              data-testid={``}
             >
               Add Tag
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-add-tag-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:142:16
               Add Tag
             </Dropdown.Toggle>
             <Dropdown.Menu>
-              {availableTags.length === 0 && (
-                <Dropdown.Item
-                  disabled
-                  data-testid={`${testId}-no-available-tags`}
-                >
-                  No more tags available
-                </Dropdown.Item>
-              )}
+              {false}
               {availableTags.map((tag) =>
                 withExplanationTooltip(
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-no-available-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] EqualityOperator
main/components/Tags/TagSelector.jsx:142:16
               Add Tag
             </Dropdown.Toggle>
             <Dropdown.Menu>
-              {availableTags.length === 0 && (
+              {availableTags.length !== 0 && (
                 <Dropdown.Item
                   disabled
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-no-available-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:145:32
               {availableTags.length === 0 && (
                 <Dropdown.Item
                   disabled
-                  data-testid={`${testId}-no-available-tags`}
+                  data-testid={``}
                 >
                   No more tags available
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-no-available-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:150:34
                   No more tags available
                 </Dropdown.Item>
               )}
-              {availableTags.map((tag) =>
-                withExplanationTooltip(
-                  tag,
-                  `${testId}-available-tag-${tag.id}-tooltip`,
-                  <Dropdown.Item
-                    as="button"
-                    type="button"
-                    data-testid={`${testId}-available-tag-${tag.id}`}
-                    onClick={() => onAddTag(tag)}
-                  >
-                    <TagPill
-                      tag={tag}
-                      testId={`${testId}-available-tag-${tag.id}-badge`}
-                    />
-                    <span className="ms-2 small text-muted">
-                      {tag.explanation}
-                    </span>
-                  </Dropdown.Item>,
-                ),
+              {availableTags.map(() => undefined,
               )}
             </Dropdown.Menu>
killedBy: TagSelector tests dropdown lists only unassigned tags, with pill and explanation
statusReason: Unable to find an element by: [data-testid="TagSelector-available-tag-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:157:34
                   <Dropdown.Item
                     as="button"
                     type="button"
-                    data-testid={`${testId}-available-tag-${tag.id}`}
+                    data-testid={``}
                     onClick={() => onAddTag(tag)}
                   >
killedBy: TagSelector tests dropdown lists only unassigned tags, with pill and explanation
statusReason: Unable to find an element by: [data-testid="TagSelector-available-tag-2"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:158:30
                     as="button"
                     type="button"
                     data-testid={`${testId}-available-tag-${tag.id}`}
-                    onClick={() => onAddTag(tag)}
+                    onClick={() => undefined}
                   >
                     <TagPill
killedBy: TagSelector tests clicking an available tag calls onAddTag with the tag
statusReason: expected "vi.fn()" to be called with arguments: [ { id: 3, tag: 'results', …(2) } ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Tags/TagSelector.jsx:173:10
             </Dropdown.Menu>
           </Dropdown>
         )}
-        {canEdit && (
-          <Button
-            variant="outline-secondary"
-            size="sm"
-            onClick={() => setShowNewTagModal(true)}
-            data-testid={`${testId}-new-tag-button`}
-          >
-            New Tag
-          </Button>
-        )}
+        {true}
         <a
           href={`/project/${projectId}`}
killedBy: TagSelector tests clicking New Tag opens the create-tag modal
statusReason: Unable to find an element by: [data-testid="TagSelector-new-tag-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] LogicalOperator
main/components/Tags/TagSelector.jsx:173:10
             </Dropdown.Menu>
           </Dropdown>
         )}
-        {canEdit && (
-          <Button
-            variant="outline-secondary"
-            size="sm"
-            onClick={() => setShowNewTagModal(true)}
-            data-testid={`${testId}-new-tag-button`}
-          >
-            New Tag
-          </Button>
-        )}
+        {canEdit || <Button variant="outline-secondary" size="sm" onClick={() => setShowNewTagModal(true)} data-testid={`${testId}-new-tag-button`}>
+            New Tag
+          </Button>}
         <a
           href={`/project/${projectId}`}
killedBy: TagSelector tests hides remove buttons, add dropdown, and new tag button when canEdit is false
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-outline-secondary btn-sm"
  data-testid="TagSelector-new-tag-button"
  type="button"
>
  New Tag

[Killed] ArrowFunction
main/components/Tags/TagSelector.jsx:177:22
           <Button
             variant="outline-secondary"
             size="sm"
-            onClick={() => setShowNewTagModal(true)}
+            onClick={() => undefined}
             data-testid={`${testId}-new-tag-button`}
           >
killedBy: TagSelector tests clicking New Tag opens the create-tag modal
statusReason: Unable to find an element by: [data-testid="TagSelector-TagModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] BooleanLiteral
main/components/Tags/TagSelector.jsx:177:47
           <Button
             variant="outline-secondary"
             size="sm"
-            onClick={() => setShowNewTagModal(true)}
+            onClick={() => setShowNewTagModal(false)}
             data-testid={`${testId}-new-tag-button`}
           >
killedBy: TagSelector tests clicking New Tag opens the create-tag modal
statusReason: Unable to find an element by: [data-testid="TagSelector-TagModal-base"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:184:17
           </Button>
         )}
         <a
-          href={`/project/${projectId}`}
+          href={``}
           target="_blank"
           rel="noopener noreferrer"
killedBy: TagSelector tests manage tags link points to the project page and opens in a new tab
statusReason: expect(element).toHaveAttribute("href", "/project/17") // element.getAttribute("href") === "/project/17"

Expected the element to have attribute:
  href="/project/17"
Received:
  href=""
