[Killed] BlockStatement
main/layouts/BasicLayout/BasicLayout.tsx:11:69
   children: ReactNode;
 }
 
-export default function BasicLayout({ children }: BasicLayoutProps) {
-  const doLogout = useLogout().mutate;
-  const currentUser = useCurrentUser();
-  const { data: systemInfo } = useSystemInfo();
-
-  return (
-    <div className="BasicLayout" data-testid="BasicLayout">
-      <AppNavbar
-        doLogout={doLogout}
-        currentUser={currentUser}
-        systemInfo={systemInfo}
-      />
-      <main className="main-content" data-testid="BasicLayout-main-content">
-        {children}
-      </main>
-      <Footer />
-    </div>
-  );
-}
+export default function BasicLayout({ children }: BasicLayoutProps) {}
 
killedBy: ResearchersIndexPage tests Renders with New Researcher Button
statusReason: Unable to find an element with the text: /New Researcher/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
