[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:13:5
 export default function HomePageLoggedIn() {
   const currentUser = useCurrentUser();
   const isResearcher =
-    hasRole(currentUser, "ROLE_RESEARCHER") ||
-    hasRole(currentUser, "ROLE_ADMIN");
+    false;
 
   const {
killedBy: HomePageLoggedIn tests researcher sees both sections, with owned projects empty message
statusReason: Unable to find an element with the text: Your Projects. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:13:5
 export default function HomePageLoggedIn() {
   const currentUser = useCurrentUser();
   const isResearcher =
-    hasRole(currentUser, "ROLE_RESEARCHER") ||
-    hasRole(currentUser, "ROLE_ADMIN");
+    true;
 
   const {
killedBy: HomePageLoggedIn tests regular user sees only the collaborator section, and it fetches on mount
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <h1>
  Your Projects
</h1> instead

[Killed] ArrayDeclaration
main/pages/Home/HomePageLoggedIn.jsx:21:5
     error: _ownedError,
     status: _ownedStatus,
   } = useBackend(
-    ["/api/projects/list/owner"],
+    [],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET.
     { method: "GET", url: "/api/projects/list/owner" },
killedBy: HomePageLoggedIn tests useBackend is called with correct cache query keys, owner list disabled for regular users
statusReason: expected "useBackend" to be called with arguments: [ Array(5) ]

Received:

  1st useBackend call:

@@ -1,9 +1,7 @@
  [

[Killed] ObjectLiteral
main/pages/Home/HomePageLoggedIn.jsx:23:5
   } = useBackend(
     ["/api/projects/list/owner"],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET.
-    { method: "GET", url: "/api/projects/list/owner" },
+    {},
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: HomePageLoggedIn tests researcher sees their owned projects when there are some
statusReason: Unable to find an element by: [data-testid="OwnerProjectTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrayDeclaration
main/pages/Home/HomePageLoggedIn.jsx:37:5
     error: _collaboratorError,
     status: _collaboratorStatus,
   } = useBackend(
-    ["/api/projects/list/collaborator"],
+    [],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET.
     { method: "GET", url: "/api/projects/list/collaborator" },
killedBy: HomePageLoggedIn tests useBackend is called with correct cache query keys, owner list disabled for regular users
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

  [
    [

[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:37:6
     error: _collaboratorError,
     status: _collaboratorStatus,
   } = useBackend(
-    ["/api/projects/list/collaborator"],
+    [""],
     // Stryker disable next-line StringLiteral : The default value for an empty ("") method is GET.
     { method: "GET", url: "/api/projects/list/collaborator" },
killedBy: HomePageLoggedIn tests useBackend is called with correct cache query keys, owner list disabled for regular users
statusReason: expected "useBackend" to be called with arguments: [ …(3) ]

Received:

  1st useBackend call:

  [
    [

[Killed] ArrowFunction
main/pages/Home/HomePageLoggedIn.jsx:46:31
 
   const [viewModal, setViewModal] = useState(false);
 
-  const objectToAxiosParams = (project) => ({
-    url: "/api/projects/post",
-    method: "POST",
-    params: {
-      name: project.name,
-      description: project.description,
-      citationFormat: project.citationFormat,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (project) => {
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:47:10
   const [viewModal, setViewModal] = useState(false);
 
   const objectToAxiosParams = (project) => ({
-    url: "/api/projects/post",
+    url: "",
     method: "POST",
     params: {
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: expected "vi.fn()" to be called with arguments: [ 'Project Citation Graphs created' ]

Received:

  1st vi.fn() call:

  [
-   "Project Citation Graphs created",

[Killed] BlockStatement
main/pages/Home/HomePageLoggedIn.jsx:56:34
     },
   });
 
-  const onSuccess = (project) => {
-    toast(`Project ${project.name} created`);
-    setViewModal(false);
-  };
+  const onSuccess = (project) => {};
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess }, [
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: expected "vi.fn()" to be called with arguments: [ 'Project Citation Graphs created' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BooleanLiteral
main/pages/Home/HomePageLoggedIn.jsx:58:18
 
   const onSuccess = (project) => {
     toast(`Project ${project.name} created`);
-    setViewModal(false);
+    setViewModal(true);
   };
 
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="ProjectModal-base"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/pages/Home/HomePageLoggedIn.jsx:69:44
     mutation.mutate(data);
   };
 
-  const createProject = () => setViewModal(true);
+  const createProject = () => setViewModal(false);
 
   return (
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: Unable to find an element by: [data-testid="ProjectModal-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrowFunction
main/pages/Home/HomePageLoggedIn.jsx:69:25
     mutation.mutate(data);
   };
 
-  const createProject = () => setViewModal(true);
+  const createProject = () => undefined;
 
   return (
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: Unable to find an element by: [data-testid="ProjectModal-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:89:14
               Create Project
             </Button>
             <h1>Your Projects</h1>
-            {ownedProjects.length === 0 && (
-              <p data-testid="HomePageLoggedIn-no-owned-projects">
-                No projects yet. Click the button above to create one.
-              </p>
-            )}
+            {false}
             {ownedProjects.length > 0 && (
               <ProjectTable
killedBy: HomePageLoggedIn tests researcher sees both sections, with owned projects empty message
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-no-owned-projects"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] EqualityOperator
main/pages/Home/HomePageLoggedIn.jsx:89:14
               Create Project
             </Button>
             <h1>Your Projects</h1>
-            {ownedProjects.length === 0 && (
+            {ownedProjects.length !== 0 && (
               <p data-testid="HomePageLoggedIn-no-owned-projects">
                 No projects yet. Click the button above to create one.
killedBy: HomePageLoggedIn tests researcher sees both sections, with owned projects empty message
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-no-owned-projects"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Home/HomePageLoggedIn.jsx:94:14
                 No projects yet. Click the button above to create one.
               </p>
             )}
-            {ownedProjects.length > 0 && (
-              <ProjectTable
-                projects={ownedProjects}
-                currentUser={currentUser}
-                testId={"OwnerProjectTable"}
-              />
-            )}
+            {ownedProjects.length > 0 || <ProjectTable projects={ownedProjects} currentUser={currentUser} testId={"OwnerProjectTable"} />}
           </>
         )}
killedBy: HomePageLoggedIn tests researcher sees their owned projects when there are some
statusReason: Unable to find an element by: [data-testid="OwnerProjectTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] EqualityOperator
main/pages/Home/HomePageLoggedIn.jsx:94:14
                 No projects yet. Click the button above to create one.
               </p>
             )}
-            {ownedProjects.length > 0 && (
+            {ownedProjects.length <= 0 && (
               <ProjectTable
                 projects={ownedProjects}
killedBy: HomePageLoggedIn tests researcher sees their owned projects when there are some
statusReason: Unable to find an element by: [data-testid="OwnerProjectTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Home/HomePageLoggedIn.jsx:98:25
               <ProjectTable
                 projects={ownedProjects}
                 currentUser={currentUser}
-                testId={"OwnerProjectTable"}
+                testId={""}
               />
             )}
killedBy: HomePageLoggedIn tests researcher sees their owned projects when there are some
statusReason: Unable to find an element by: [data-testid="OwnerProjectTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:104:10
           </>
         )}
         <h1>Projects You Collaborate On</h1>
-        {collaboratorProjects.length === 0 && (
-          <p data-testid="HomePageLoggedIn-no-collaborator-projects">
-            You are not a collaborator on any projects yet.
-          </p>
-        )}
+        {false}
         {collaboratorProjects.length > 0 && (
           <ProjectTable
killedBy: HomePageLoggedIn tests regular user sees only the collaborator section, and it fetches on mount
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-no-collaborator-projects"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:104:10
           </>
         )}
         <h1>Projects You Collaborate On</h1>
-        {collaboratorProjects.length === 0 && (
-          <p data-testid="HomePageLoggedIn-no-collaborator-projects">
-            You are not a collaborator on any projects yet.
-          </p>
-        )}
+        {true}
         {collaboratorProjects.length > 0 && (
           <ProjectTable
killedBy: HomePageLoggedIn tests regular user sees only the collaborator section, and it fetches on mount
statusReason: Unable to find an element by: [data-testid="HomePageLoggedIn-no-collaborator-projects"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Home/HomePageLoggedIn.jsx:109:10
             You are not a collaborator on any projects yet.
           </p>
         )}
-        {collaboratorProjects.length > 0 && (
-          <ProjectTable
-            projects={collaboratorProjects}
-            currentUser={currentUser}
-            testId={"CollaboratorProjectTable"}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HomePageLoggedIn tests regular user sees projects they collaborate on
statusReason: Unable to find an element by: [data-testid="CollaboratorProjectTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] EqualityOperator
main/pages/Home/HomePageLoggedIn.jsx:109:10
             You are not a collaborator on any projects yet.
           </p>
         )}
-        {collaboratorProjects.length > 0 && (
+        {collaboratorProjects.length <= 0 && (
           <ProjectTable
             projects={collaboratorProjects}
killedBy: HomePageLoggedIn tests regular user sees projects they collaborate on
statusReason: Unable to find an element by: [data-testid="CollaboratorProjectTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
