[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:44:3
 // preserved CITELINES_ field name used to persist each card's state onto the entry itself, e.g.
 // "card_bibtex" <-> CITELINES_card_bibtex = {Open|Closed}.
 const CARD_DEFS = [
-  { key: "abstract", field: "card_abstract", defaultOpen: false },
+  {},
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  null

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:45:3
 // "card_bibtex" <-> CITELINES_card_bibtex = {Open|Closed}.
 const CARD_DEFS = [
   { key: "abstract", field: "card_abstract", defaultOpen: false },
-  { key: "bibtex", field: "card_bibtex", defaultOpen: true },
+  {},
   { key: "comments", field: "card_comments", defaultOpen: false },
   { key: "references", field: "card_references", defaultOpen: false },
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  null

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:46:3
 const CARD_DEFS = [
   { key: "abstract", field: "card_abstract", defaultOpen: false },
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
-  { key: "comments", field: "card_comments", defaultOpen: false },
+  {},
   { key: "references", field: "card_references", defaultOpen: false },
   { key: "citations", field: "card_citations", defaultOpen: false },
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  null

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:47:10
   { key: "abstract", field: "card_abstract", defaultOpen: false },
   { key: "bibtex", field: "card_bibtex", defaultOpen: true },
   { key: "comments", field: "card_comments", defaultOpen: false },
-  { key: "references", field: "card_references", defaultOpen: false },
+  { key: "", field: "card_references", defaultOpen: false },
   { key: "citations", field: "card_citations", defaultOpen: false },
 ];
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: expect(element).toHaveAttribute("aria-expanded", "false") // element.getAttribute("aria-expanded") === "false"

Expected the element to have attribute:
  aria-expanded="false"
Received:
  null

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:96:5
   const queryKey = `/api/bibtexentries/formatted?projectId=${projectId}&id=${duplicateId}`;
   const { data: formattedCitation } = useBackend(
     [queryKey],
-    {
-      method: "GET",
-      url: "/api/bibtexentries/formatted",
-      params: { projectId, id: duplicateId },
-    },
+    {},
     "",
     true,
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Other, A. The Other Paper.
Received:
  Loading...

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:99:15
     {
       method: "GET",
       url: "/api/bibtexentries/formatted",
-      params: { projectId, id: duplicateId },
+      params: {},
     },
     "",
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Other, A. The Other Paper.
Received:
  Loading...

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:107:11
 
   return (
     <Link
-      to={`/project/${projectId}/bibtex/${duplicateId}`}
+      to={``}
       data-testid={testId}
     >
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: expect(element).toHaveAttribute("href", "/project/1/bibtex/64f1b2c3d4e5f6a7b8c9d0e9") // element.getAttribute("href") === "/project/1/bibtex/64f1b2c3d4e5f6a7b8c9d0e9"

Expected the element to have attribute:
  href="/project/1/bibtex/64f1b2c3d4e5f6a7b8c9d0e9"
Received:
  href="/project/1/bibtex/64f1b2c3d4e5f6a7b8c9d0e1"

[Killed] LogicalOperator
main/pages/Projects/BibTexEntryShowPage.jsx:110:8
       to={`/project/${projectId}/bibtex/${duplicateId}`}
       data-testid={testId}
     >
-      {formattedCitation || "Loading..."}
+      {formattedCitation && "Loading..."}
     </Link>
   );
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Other, A. The Other Paper.
Received:
  Loading...

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:141:12
     [entryQueryKey],
     {
       method: "GET",
-      url: "/api/bibtexentries/entry",
+      url: "",
       params: { projectId, id: entryId },
     },
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-title"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="overflow: hidden; padding-right: 1024px;"
>

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:142:15
     {
       method: "GET",
       url: "/api/bibtexentries/entry",
-      params: { projectId, id: entryId },
+      params: {},
     },
     null,
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: expected {} to deeply equal { projectId: '1', …(1) }

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:186:15
   const addTagMutation = useBackendMutation(
     (tag) => ({
       url: "/api/bibtexentries/tags",
-      method: "POST",
+      method: "",
       params: { id: entry?.id, projectId, tagId: tag.id },
     }),
killedBy: BibTexEntryShowPage tests clicking a tag in the Add Tag dropdown POSTs to associate it and refetches the entry
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:196:15
   const removeTagMutation = useBackendMutation(
     (tag) => ({
       url: "/api/bibtexentries/tags",
-      method: "DELETE",
+      method: "",
       params: { id: entry?.id, projectId, tagId: tag.id },
     }),
killedBy: BibTexEntryShowPage tests clicking the remove button on an assigned tag DELETEs to remove it and refetches the entry
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head>
    <link
      href="https://maxcdn.bootstrapcdn.com/font-awesome/latest/css/font-awesome.min.css"
      rel="stylesheet"

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:197:15
     (tag) => ({
       url: "/api/bibtexentries/tags",
       method: "DELETE",
-      params: { id: entry?.id, projectId, tagId: tag.id },
+      params: {},
     }),
     {},
killedBy: BibTexEntryShowPage tests clicking the remove button on an assigned tag DELETEs to remove it and refetches the entry
statusReason: expected {} to deeply equal { Object (id, projectId, ...) }

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:246:30
         CARD_DEFS.map((c) => [
           c.key,
           (preservedFields[`citelines_${c.field}`] ??
-            (c.defaultOpen ? "Open" : "Closed")) === "Open",
+            (c.defaultOpen ? "" : "Closed")) === "Open",
         ]),
       ),
killedBy: BibTexEntryShowPage tests clicking the Edit button in the card header does not toggle the card open/closed
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:268:5
 
   const citationsQueryKey = `/api/citationedges/citations?projectId=${projectId}&id=${entry?.id}`;
   const { data: citations } = useBackend(
-    [citationsQueryKey],
+    [],
     {
       method: "GET",

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:280:5
   );
 
   const { data: unresolved } = useBackend(
-    [
-      `/api/citationedges/unresolved?projectId=${projectId}&sourceEntryId=${entry?.id}`,
-    ],
+    [],
     {
       method: "GET",

[Killed] EqualityOperator
main/pages/Projects/BibTexEntryShowPage.jsx:293:12
     { refetchInterval: 5000, enabled: !!entry },
   );
   const unresolvedReferencesCount = unresolved.filter(
-    (u) => u.direction === "reference",
+    (u) => u.direction !== "reference",
   ).length;
   const unresolvedCitationsCount = unresolved.filter(
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  2 unresolved
Received:
  — 1 unresolved

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:296:12
     (u) => u.direction === "reference",
   ).length;
   const unresolvedCitationsCount = unresolved.filter(
-    (u) => u.direction === "citation",
+    (u) => false,
   ).length;
 
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-citations-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:308:15
     () => ({
       url: "/api/jobs/launch/getReferences",
       method: "POST",
-      params: { projectId, citeKey: entry?.citeKey },
+      params: {},
     }),
     {
killedBy: BibTexEntryShowPage tests clicking Get References launches the job and shows a toast
statusReason: expected {} to deeply equal { Object (projectId, citeKey) }

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:334:34
       method: "PUT",
       params: { id: entry?.id, projectId },
       data: injectCitelinesFields(rawBibtex, newRelevance, preservedFields),
-      headers: { "Content-Type": "text/plain" },
+      headers: { "Content-Type": "" },
     }),
     { onSuccess: () => toast("Relevance updated successfully") },

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:342:12
 
   const updateCardStateMutation = useBackendMutation(
     (newPreservedFields) => ({
-      url: "/api/bibtexentries",
+      url: "",
       method: "PUT",
       params: { id: entry?.id, projectId },

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:360:60
       if (rawBibtex) {
         updateCardStateMutation.mutate({
           ...preservedFields,
-          [`citelines_${fieldName}`]: newIsOpen ? "Open" : "Closed",
+          [`citelines_${fieldName}`]: newIsOpen ? "Open" : "",
         });
       }
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expected '@article{smith2020,\n  title = {A Ver…' to contain 'CITELINES_card_bibtex = {Closed}'

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:360:12
       if (rawBibtex) {
         updateCardStateMutation.mutate({
           ...preservedFields,
-          [`citelines_${fieldName}`]: newIsOpen ? "Open" : "Closed",
+          [``]: newIsOpen ? "Open" : "Closed",
         });
       }
killedBy: BibTexEntryShowPage tests each card can be opened/closed independently of the others, and PUTs the new state
statusReason: expected '@article{smith2020,\n  title = {A Ver…' to contain 'CITELINES_card_bibtex = {Closed}'

[Survived] ArrayDeclaration
main/pages/Projects/BibTexEntryShowPage.jsx:445:32
             toggleShowModal={setShowAbstractEditModal}
             projectId={projectId}
             entry={entry}
-            mutationQueryKeys={[entryQueryKey]}
+            mutationQueryKeys={[]}
             testId={`${testId}-AbstractEditModal`}
           />

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:479:34
           </div>
 
           <Form.Group className="mb-3" style={{ maxWidth: "200px" }}>
-            <Form.Label htmlFor={`${testId}-relevance-select`}>
+            <Form.Label htmlFor={``}>
               Relevance
             </Form.Label>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:502:30
                 as={Link}
                 to={`/project/${projectId}`}
                 variant="outline-secondary"
-                data-testid={`${testId}-go-to-project-button`}
+                data-testid={``}
               >
                 Go to Project
killedBy: BibTexEntryShowPage tests shows a Go to Project button linking back to the project page
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-go-to-project-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:558:30
               <Button
                 variant="outline-primary"
                 onClick={() => setShowBulkReferenceUploadModal(true)}
-                data-testid={`${testId}-bulk-reference-upload-button`}
+                data-testid={``}
               >
                 Bulk References from ACM DL
killedBy: BibTexEntryShowPage tests clicking Bulk References from ACM DL opens the modal, and submitting launches the job with the current entry's citeKey
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-bulk-reference-upload-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Survived] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:576:26
             show={showDeleteModal}
             onHide={() => setShowDeleteModal(false)}
             centered
-            data-testid={`${testId}-delete-modal`}
+            data-testid={``}
           >
             <Modal.Header closeButton>

[Killed] ObjectLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:608:28
             <CollapsibleCard
               testId={`${testId}-PossibleDuplicatesCard`}
               header="Possible Duplicates"
-              headerStyle={{ backgroundColor: POSSIBLE_DUPLICATE_HEADER_COLOR }}
+              headerStyle={{}}
               isOpen={showPossibleDuplicates}
               onToggle={() => setShowPossibleDuplicates((prev) => !prev)}
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: expect(element).toHaveStyle()

- Expected

- background-color: rgb(248, 215, 218);

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:616:32
                 <div
                   key={duplicateId}
                   className="mb-3"
-                  data-testid={`${testId}-PossibleDuplicatesCard-item-${duplicateId}`}
+                  data-testid={``}
                 >
                   <div className="fw-semibold">Possible duplicate:</div>
killedBy: BibTexEntryShowPage tests shows a Possible Duplicates card, open by default with a pastel red header, when the entry is flagged
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-PossibleDuplicatesCard-item-64f1b2c3d4e5f6a7b8c9d0e9"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:661:30
                 variant="outline-primary"
                 size="sm"
                 onClick={() => setShowAbstractEditModal(true)}
-                data-testid={`${testId}-abstract-edit-button`}
+                data-testid={``}
               >
                 Edit
killedBy: BibTexEntryShowPage tests clicking the Abstract Edit button opens the AbstractEditModal pre-filled with the current abstract
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-abstract-edit-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:710:21
           </CollapsibleCard>
 
           <CollapsibleCard
-            testId={`${testId}-ReferencesCard`}
+            testId={``}
             header={
               <span data-testid={`${testId}-references-heading`}>
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesCard-header"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:714:18
             header={
               <span data-testid={`${testId}-references-heading`}>
                 References ({references.length})
-                {unresolvedReferencesCount > 0 && (
-                  <span
-                    className="text-warning ms-2"
-                    data-testid={`${testId}-references-unresolved-badge`}
-                  >
-                    — {unresolvedReferencesCount} unresolved
-                  </span>
-                )}
+                {false}
               </span>
             }
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-references-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[NoCoverage] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:725:40
               </span>
             }
             isOpen={cardOpenState.references}
-            onToggle={() => toggleCard("references", "card_references")}
+            onToggle={() => toggleCard("", "card_references")}
           >
             <CitationTable

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:731:23
               readOnly
               citations={references}
               projectId={projectId}
-              testId={`${testId}-ReferencesTable`}
+              testId={``}
             />
           </CollapsibleCard>
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-ReferencesTable-cell-row-0-col-citeKey-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:736:21
           </CollapsibleCard>
 
           <CollapsibleCard
-            testId={`${testId}-CitationsCard`}
+            testId={``}
             header={
               <span data-testid={`${testId}-citations-heading`}>
killedBy: BibTexEntryShowPage tests the BibTex Entry card is open by default, and the other cards are closed by default
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-CitationsCard-header"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:738:34
           <CollapsibleCard
             testId={`${testId}-CitationsCard`}
             header={
-              <span data-testid={`${testId}-citations-heading`}>
+              <span data-testid={``}>
                 Citations ({citations.length})
                 {unresolvedCitationsCount > 0 && (
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-citations-heading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] LogicalOperator
main/pages/Projects/BibTexEntryShowPage.jsx:740:18
             header={
               <span data-testid={`${testId}-citations-heading`}>
                 Citations ({citations.length})
-                {unresolvedCitationsCount > 0 && (
-                  <span
-                    className="text-warning ms-2"
-                    data-testid={`${testId}-citations-unresolved-badge`}
-                  >
-                    — {unresolvedCitationsCount} unresolved
-                  </span>
-                )}
+                {unresolvedCitationsCount > 0 || <span className="text-warning ms-2" data-testid={`${testId}-citations-unresolved-badge`}>
+                    — {unresolvedCitationsCount} unresolved
+                  </span>}
               </span>
             }
killedBy: BibTexEntryShowPage tests shows no unresolved badge when there are no unresolved citations
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <span
  class="text-warning ms-2"
  data-testid="BibTexEntryShowPage-citations-unresolved-badge"
>
  — 
  0

[Killed] ConditionalExpression
main/pages/Projects/BibTexEntryShowPage.jsx:740:18
             header={
               <span data-testid={`${testId}-citations-heading`}>
                 Citations ({citations.length})
-                {unresolvedCitationsCount > 0 && (
-                  <span
-                    className="text-warning ms-2"
-                    data-testid={`${testId}-citations-unresolved-badge`}
-                  >
-                    — {unresolvedCitationsCount} unresolved
-                  </span>
-                )}
+                {false}
               </span>
             }
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-citations-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:743:34
                 {unresolvedCitationsCount > 0 && (
                   <span
                     className="text-warning ms-2"
-                    data-testid={`${testId}-citations-unresolved-badge`}
+                    data-testid={``}
                   >
                     — {unresolvedCitationsCount} unresolved
killedBy: BibTexEntryShowPage tests shows an unresolved badge with the count for each direction
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-citations-unresolved-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[NoCoverage] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:751:40
               </span>
             }
             isOpen={cardOpenState.citations}
-            onToggle={() => toggleCard("citations", "card_citations")}
+            onToggle={() => toggleCard("", "card_citations")}
           >
             <CitationTable

[Killed] ArrowFunction
main/pages/Projects/BibTexEntryShowPage.jsx:765:23
             testId={`${testId}-RawEntryCard`}
             header="Raw BibTeX (debug)"
             isOpen={showRawEntry}
-            onToggle={() => setShowRawEntry((prev) => !prev)}
+            onToggle={() => undefined}
           >
             <pre
killedBy: BibTexEntryShowPage tests opening the Raw BibTeX (debug) card shows the full entry as JSON, including fields not shown elsewhere on the page
statusReason: expect(element).toHaveAttribute("aria-expanded", "true") // element.getAttribute("aria-expanded") === "true"

Expected the element to have attribute:
  aria-expanded="true"
Received:
  aria-expanded="false"

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/pages/Projects/BibTexEntryShowPage.jsx:768:28
             onToggle={() => setShowRawEntry((prev) => !prev)}
           >
             <pre
-              data-testid={`${testId}-raw-entry-json`}
+              data-testid={``}
               className="border rounded-3 p-3"
             >
killedBy: BibTexEntryShowPage tests opening the Raw BibTeX (debug) card shows the full entry as JSON, including fields not shown elsewhere on the page
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-raw-entry-json"]

Ignored nodes: comments, script, style
<body
  class=""
  style=""
>
  <div>
