[Survived] BooleanLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:21:56
 }) {
   const currentUser = useCurrentUser();
   const projectId = useParams().id;
-  const [showErrorModal, setShowErrorModal] = useState(false);
+  const [showErrorModal, setShowErrorModal] = useState(true);
 
   const {

[Killed] ConditionalExpression
main/pages/Projects/ResearcherProjectShowPage.jsx:36:28
     true,
   );
 
-  const getProjectFailed = projectBackendFailureCount > 0;
+  const getProjectFailed = false;
 
   // Stryker disable OptionalChaining -- project?.owner is more readable than project && project.owner
killedBy: ResearcherProjectShowPage tests shows an error modal and returns home when the project cannot be fetched
statusReason: Unable to find an element with the text: Project Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] EqualityOperator
main/pages/Projects/ResearcherProjectShowPage.jsx:36:28
     true,
   );
 
-  const getProjectFailed = projectBackendFailureCount > 0;
+  const getProjectFailed = projectBackendFailureCount >= 0;
 
   // Stryker disable OptionalChaining -- project?.owner is more readable than project && project.owner

[Killed] LogicalOperator
main/pages/Projects/ResearcherProjectShowPage.jsx:40:5
 
   // Stryker disable OptionalChaining -- project?.owner is more readable than project && project.owner
   const isOwner =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    currentUser?.root?.user?.email === project?.owner;
+    hasRole(currentUser, "ROLE_ADMIN") && currentUser?.root?.user?.email === project?.owner;
   // Stryker enable OptionalChaining
 
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Projects/ResearcherProjectShowPage.jsx:40:5
 
   // Stryker disable OptionalChaining -- project?.owner is more readable than project && project.owner
   const isOwner =
-    hasRole(currentUser, "ROLE_ADMIN") ||
-    currentUser?.root?.user?.email === project?.owner;
+    true;
   // Stryker enable OptionalChaining
 
killedBy: ResearcherProjectShowPage tests a collaborator (non-owner) does not see the Add Collaborator button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-primary"
  data-testid="ResearcherProjectShowPage-post-button"
  type="button"
>
  Add Collaborator

[Killed] ConditionalExpression
main/pages/Projects/ResearcherProjectShowPage.jsx:41:5
   // Stryker disable OptionalChaining -- project?.owner is more readable than project && project.owner
   const isOwner =
     hasRole(currentUser, "ROLE_ADMIN") ||
-    currentUser?.root?.user?.email === project?.owner;
+    false;
   // Stryker enable OptionalChaining
 
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] EqualityOperator
main/pages/Projects/ResearcherProjectShowPage.jsx:41:5
   // Stryker disable OptionalChaining -- project?.owner is more readable than project && project.owner
   const isOwner =
     hasRole(currentUser, "ROLE_ADMIN") ||
-    currentUser?.root?.user?.email === project?.owner;
+    currentUser?.root?.user?.email !== project?.owner;
   // Stryker enable OptionalChaining
 
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-post-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BlockStatement
main/pages/Projects/ResearcherProjectShowPage.jsx:45:19
   // Stryker enable OptionalChaining
 
   const navigate = useNavigate();
-  useEffect(() => {
-    if (getProjectFailed) {
-      setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate("/", { replace: true });
-      }, 3000);
-      // Stryker disable next-line BlockStatement
-      return () => {
-        clearTimeout(timer);
-      };
-    }
-  }, [getProjectFailed, navigate]);
+  useEffect(() => {}, [getProjectFailed, navigate]);
 
   return (
killedBy: ResearcherProjectShowPage tests shows an error modal and returns home when the project cannot be fetched
statusReason: Unable to find an element with the text: Project Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BlockStatement
main/pages/Projects/ResearcherProjectShowPage.jsx:46:27
 
   const navigate = useNavigate();
   useEffect(() => {
-    if (getProjectFailed) {
-      setShowErrorModal(true);
-      const timer = setTimeout(() => {
-        navigate("/", { replace: true });
-      }, 3000);
-      // Stryker disable next-line BlockStatement
-      return () => {
-        clearTimeout(timer);
-      };
-    }
+    if (getProjectFailed) {}
   }, [getProjectFailed, navigate]);
 
killedBy: ResearcherProjectShowPage tests shows an error modal and returns home when the project cannot be fetched
statusReason: Unable to find an element with the text: Project Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ConditionalExpression
main/pages/Projects/ResearcherProjectShowPage.jsx:46:9
 
   const navigate = useNavigate();
   useEffect(() => {
-    if (getProjectFailed) {
+    if (false) {
       setShowErrorModal(true);
       const timer = setTimeout(() => {
killedBy: ResearcherProjectShowPage tests shows an error modal and returns home when the project cannot be fetched
statusReason: Unable to find an element with the text: Project Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BooleanLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:47:25
   const navigate = useNavigate();
   useEffect(() => {
     if (getProjectFailed) {
-      setShowErrorModal(true);
+      setShowErrorModal(false);
       const timer = setTimeout(() => {
         navigate("/", { replace: true });
killedBy: ResearcherProjectShowPage tests shows an error modal and returns home when the project cannot be fetched
statusReason: Unable to find an element with the text: Project Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] ArrayDeclaration
main/pages/Projects/ResearcherProjectShowPage.jsx:56:6
         clearTimeout(timer);
       };
     }
-  }, [getProjectFailed, navigate]);
+  }, []);
 
   return (
killedBy: ResearcherProjectShowPage tests shows an error modal and returns home when the project cannot be fetched
statusReason: Unable to find an element with the text: Project Not Found. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] BooleanLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:73:8
           </Button>
         </Modal.Footer>
       </Modal>
-      {!project ? (
+      {project ? (
         <div data-testid={`${testId}-loading`}>Project: Loading...</div>
       ) : (
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Cannot read properties of null (reading 'name')

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:96:31
             <Tab eventKey={"citations"} title={"Citations"} className="pt-2">
               <CitationsTabComponent
                 projectId={projectId}
-                testIdPrefix={`${testId}-Citations`}
+                testIdPrefix={``}
               />
             </Tab>
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-Citations-CitationTable-cell-row-0-col-citeKey"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Survived] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:106:25
               />
             </Tab>
             <Tab
-              eventKey={"collaborators"}
+              eventKey={""}
               title={"Collaborators"}
               className="pt-2"

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:116:43
                 isOwner={isOwner}
               />
             </Tab>
-            <Tab eventKey={"tags"} title={"Tags"} className="pt-2">
+            <Tab eventKey={"tags"} title={""} className="pt-2">
               <TagsTabComponent
                 projectId={projectId}
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element with the text: Tags. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"

[Killed] StringLiteral
main/pages/Projects/ResearcherProjectShowPage.jsx:119:31
             <Tab eventKey={"tags"} title={"Tags"} className="pt-2">
               <TagsTabComponent
                 projectId={projectId}
-                testIdPrefix={`${testId}-Tags`}
+                testIdPrefix={``}
               />
             </Tab>
killedBy: ResearcherProjectShowPage tests shows loading, then title/description, and the Collaborators tab, for the owner
statusReason: Unable to find an element by: [data-testid="ResearcherProjectShowPage-Tags-TagTable-cell-row-0-col-tag"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="BasicLayout"
      data-testid="BasicLayout"
