[Killed] ArrayDeclaration
src/main/utils/citationFormats.js:8:40
  * CitationFormattingService.java`); if you add/remove/rename a format in one place, update the
  * other to match.
  */
-export const CITATION_FORMAT_OPTIONS = [
-  "APA",
-  "MLA",
-  "ACM",
-  "IEEE",
-  "CHICAGO-AUTHOR-DATE",
-  "CHICAGO-FULLNOTE",
-  "HARVARD",
-  "VANCOUVER",
-  "NATURE",
-  "SCIENCE",
-];
+export const CITATION_FORMAT_OPTIONS = [];
 
 export const DEFAULT_CITATION_FORMAT = "ACM";
killedBy: ProjectModal tests defaults citation format to ACM
statusReason: expect(element).toHaveValue(ACM)

Expected the element to have value:
  ACM
Received:
  undefined

[Killed] StringLiteral
src/main/utils/citationFormats.js:12:3
   "APA",
   "MLA",
   "ACM",
-  "IEEE",
+  "",
   "CHICAGO-AUTHOR-DATE",
   "CHICAGO-FULLNOTE",
killedBy: ProjectModal tests defaults citation format to the last one chosen, from local storage
statusReason: expect(element).toHaveValue(IEEE)

Expected the element to have value:
  IEEE
Received:
  ACM

[Survived] StringLiteral
src/main/utils/citationFormats.js:13:3
   "MLA",
   "ACM",
   "IEEE",
-  "CHICAGO-AUTHOR-DATE",
+  "",
   "CHICAGO-FULLNOTE",
   "HARVARD",

[Survived] StringLiteral
src/main/utils/citationFormats.js:14:3
   "ACM",
   "IEEE",
   "CHICAGO-AUTHOR-DATE",
-  "CHICAGO-FULLNOTE",
+  "",
   "HARVARD",
   "VANCOUVER",

[Killed] StringLiteral
src/main/utils/citationFormats.js:21:40
   "SCIENCE",
 ];
 
-export const DEFAULT_CITATION_FORMAT = "ACM";
+export const DEFAULT_CITATION_FORMAT = "";
 
 /** localStorage key used to remember the last citation format chosen when creating a project. */
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: expected { name: 'Citation Graphs', …(2) } to deeply equal { name: 'Citation Graphs', …(2) }

[Survived] StringLiteral
src/main/utils/citationFormats.js:24:49
 export const DEFAULT_CITATION_FORMAT = "ACM";
 
 /** localStorage key used to remember the last citation format chosen when creating a project. */
-export const LAST_CITATION_FORMAT_STORAGE_KEY = "citelines.lastCitationFormat";
+export const LAST_CITATION_FORMAT_STORAGE_KEY = "";
 
 /**

[Killed] BlockStatement
src/main/utils/citationFormats.js:31:41
  * LAST_CITATION_FORMAT_STORAGE_KEY}), falling back to {@link DEFAULT_CITATION_FORMAT} if none was
  * stored, or if the stored value is no longer a recognized format.
  */
-export function getLastCitationFormat() {
-  const stored = window.localStorage.getItem(LAST_CITATION_FORMAT_STORAGE_KEY);
-  return CITATION_FORMAT_OPTIONS.includes(stored)
-    ? stored
-    : DEFAULT_CITATION_FORMAT;
-}
+export function getLastCitationFormat() {}
 
 /** Persists `citationFormat` as the last-chosen citation format, for {@link
killedBy: HomePageLoggedIn tests researcher can create a new project
statusReason: expected { name: 'Citation Graphs', …(2) } to deeply equal { name: 'Citation Graphs', …(2) }

[Killed] BlockStatement
src/main/utils/citationFormats.js:40:55
 
 /** Persists `citationFormat` as the last-chosen citation format, for {@link
  * getLastCitationFormat} to pick up next time. */
-export function setLastCitationFormat(citationFormat) {
-  window.localStorage.setItem(LAST_CITATION_FORMAT_STORAGE_KEY, citationFormat);
-}
+export function setLastCitationFormat(citationFormat) {}
 
killedBy: ProjectModal tests submits with entered values, including citation format, and remembers the choice
statusReason: expected null to deeply equal 'IEEE'
