[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:39:19
   const parts = [];
   let start = 0;
 
-  for (let i = 0; i < text.length; i++) {
+  for (let i = 0; false; i++) {
     const ch = text[i];
     const top = stack[stack.length - 1];
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:39:19
   const parts = [];
   let start = 0;
 
-  for (let i = 0; i < text.length; i++) {
+  for (let i = 0; i >= text.length; i++) {
     const ch = text[i];
     const top = stack[stack.length - 1];
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/citelinesFields.js:41:23
 
   for (let i = 0; i < text.length; i++) {
     const ch = text[i];
-    const top = stack[stack.length - 1];
+    const top = stack[stack.length + 1];
 
     if (top === "quote") {
killedBy: citelinesFields extractCitelinesFields preserves other CITELINES_ fields (case-insensitively) without displaying them
statusReason: expected { citelines_position: '42', …(2) } to deeply equal { citelines_position: '42', …(2) }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:43:9
     const ch = text[i];
     const top = stack[stack.length - 1];
 
-    if (top === "quote") {
+    if (true) {
       if (ch === "{") {
         stack.push("brace");
killedBy: BibTexEntryModal tests when editing an entry with an existing relevance, strips it from the text and pre-fills the dropdown
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:43:9
     const ch = text[i];
     const top = stack[stack.length - 1];
 
-    if (top === "quote") {
+    if (top !== "quote") {
       if (ch === "{") {
         stack.push("brace");
killedBy: BibTexEntryModal tests when editing an entry with an existing relevance, strips it from the text and pre-fills the dropdown
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:44:11
     const top = stack[stack.length - 1];
 
     if (top === "quote") {
-      if (ch === "{") {
+      if (true) {
         stack.push("brace");
       } else if (ch === '"') {
killedBy: BibTexEntryModal tests when editing an entry with an existing relevance, strips it from the text and pre-fills the dropdown
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:44:11
     const top = stack[stack.length - 1];
 
     if (top === "quote") {
-      if (ch === "{") {
+      if (ch !== "{") {
         stack.push("brace");
       } else if (ch === '"') {
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] BlockStatement
src/main/utils/citelinesFields.js:46:30
     if (top === "quote") {
       if (ch === "{") {
         stack.push("brace");
-      } else if (ch === '"') {
-        stack.pop();
-      }
+      } else if (ch === '"') {}
       continue;
     }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:46:18
     if (top === "quote") {
       if (ch === "{") {
         stack.push("brace");
-      } else if (ch === '"') {
+      } else if (true) {
         stack.pop();
       }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:52:9
       continue;
     }
 
-    if (top === "brace") {
+    if (top !== "brace") {
       if (ch === "{") {
         stack.push("brace");
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:52:9
       continue;
     }
 
-    if (top === "brace") {
+    if (true) {
       if (ch === "{") {
         stack.push("brace");
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:53:11
     }
 
     if (top === "brace") {
-      if (ch === "{") {
+      if (true) {
         stack.push("brace");
       } else if (ch === "}") {
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:53:11
     }
 
     if (top === "brace") {
-      if (ch === "{") {
+      if (ch !== "{") {
         stack.push("brace");
       } else if (ch === "}") {
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:55:18
     if (top === "brace") {
       if (ch === "{") {
         stack.push("brace");
-      } else if (ch === "}") {
+      } else if (ch !== "}") {
         stack.pop();
       }
killedBy: citelinesFields extractCitelinesFields preserves other CITELINES_ fields (case-insensitively) without displaying them
statusReason: expected { citelines_position: '42', …(2) } to deeply equal { citelines_position: '42', …(2) }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:55:18
     if (top === "brace") {
       if (ch === "{") {
         stack.push("brace");
-      } else if (ch === "}") {
+      } else if (false) {
         stack.pop();
       }
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:61:9
       continue;
     }
 
-    if (ch === "{") {
+    if (true) {
       stack.push("brace");
     } else if (ch === '"') {
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] BlockStatement
src/main/utils/citelinesFields.js:61:21
       continue;
     }
 
-    if (ch === "{") {
-      stack.push("brace");
-    } else if (ch === '"') {
+    if (ch === "{") {} else if (ch === '"') {
       stack.push("quote");
     } else if (ch === splitChar) {
killedBy: citelinesFields extractCitelinesFields preserves other CITELINES_ fields (case-insensitively) without displaying them
statusReason: expected { citelines_position: '42', …(2) } to deeply equal { citelines_position: '42', …(2) }

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:63:16
 
     if (ch === "{") {
       stack.push("brace");
-    } else if (ch === '"') {
+    } else if (ch !== '"') {
       stack.push("quote");
     } else if (ch === splitChar) {
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:65:16
       stack.push("brace");
     } else if (ch === '"') {
       stack.push("quote");
-    } else if (ch === splitChar) {
+    } else if (true) {
       parts.push(text.slice(start, i));
       start = i + 1;
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:65:16
       stack.push("brace");
     } else if (ch === '"') {
       stack.push("quote");
-    } else if (ch === splitChar) {
+    } else if (false) {
       parts.push(text.slice(start, i));
       start = i + 1;
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] MethodExpression
src/main/utils/citelinesFields.js:66:18
     } else if (ch === '"') {
       stack.push("quote");
     } else if (ch === splitChar) {
-      parts.push(text.slice(start, i));
+      parts.push(text);
       start = i + 1;
     }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High", smith2020, title = "A Very Long Title", citelines_relevance = "High", }

[Killed] ArithmeticOperator
src/main/utils/citelinesFields.js:67:15
       stack.push("quote");
     } else if (ch === splitChar) {
       parts.push(text.slice(start, i));
-      start = i + 1;
+      start = i - 1;
     }
   }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] MethodExpression
src/main/utils/citelinesFields.js:70:14
       start = i + 1;
     }
   }
-  parts.push(text.slice(start));
+  parts.push(text);
   return parts;
 }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ArrayDeclaration
src/main/utils/citelinesFields.js:82:17
  */
 function findEntryBodySpans(text) {
   const spans = [];
-  const stack = [];
+  const stack = ["Stryker was here"];
   let bodyStart = -1;
 
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Survived] UnaryOperator
src/main/utils/citelinesFields.js:83:19
 function findEntryBodySpans(text) {
   const spans = [];
   const stack = [];
-  let bodyStart = -1;
+  let bodyStart = +1;
 
   for (let i = 0; i < text.length; i++) {

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:92:9
     // quote nested inside the entry's outer brace is just literal text as far as finding where
     // the entry ENDS is concerned (splitTopLevel handles quote-vs-brace nesting separately, once
     // we're splitting an already-isolated entry body into individual fields).
-    if (stack.length > 0) {
+    if (stack.length >= 0) {
       if (ch === "{") {
         stack.push("brace");
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:92:9
     // quote nested inside the entry's outer brace is just literal text as far as finding where
     // the entry ENDS is concerned (splitTopLevel handles quote-vs-brace nesting separately, once
     // we're splitting an already-isolated entry body into individual fields).
-    if (stack.length > 0) {
+    if (true) {
       if (ch === "{") {
         stack.push("brace");
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:93:11
     // the entry ENDS is concerned (splitTopLevel handles quote-vs-brace nesting separately, once
     // we're splitting an already-isolated entry body into individual fields).
     if (stack.length > 0) {
-      if (ch === "{") {
+      if (ch !== "{") {
         stack.push("brace");
       } else if (ch === "}") {
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] BlockStatement
src/main/utils/citelinesFields.js:93:23
     // the entry ENDS is concerned (splitTopLevel handles quote-vs-brace nesting separately, once
     // we're splitting an already-isolated entry body into individual fields).
     if (stack.length > 0) {
-      if (ch === "{") {
-        stack.push("brace");
-      } else if (ch === "}") {
+      if (ch === "{") {} else if (ch === "}") {
         stack.pop();
         if (stack.length === 0) {
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020,\n  title = {A Tit…' to contain 'title = {A Title}'

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:95:18
     if (stack.length > 0) {
       if (ch === "{") {
         stack.push("brace");
-      } else if (ch === "}") {
+      } else if (true) {
         stack.pop();
         if (stack.length === 0) {
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{,\n  CITELINES_relevance = {…' to contain '@article{smith2020'

[Killed] BlockStatement
src/main/utils/citelinesFields.js:95:30
     if (stack.length > 0) {
       if (ch === "{") {
         stack.push("brace");
-      } else if (ch === "}") {
-        stack.pop();
-        if (stack.length === 0) {
-          spans.push({ bodyStart, bodyEnd: i });
-          bodyStart = -1;
-        }
-      }
+      } else if (ch === "}") {}
       continue;
     }
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020, title = {A Title}}' to contain 'CITELINES_relevance = {Unreviewed}'

[Killed] BlockStatement
src/main/utils/citelinesFields.js:97:33
         stack.push("brace");
       } else if (ch === "}") {
         stack.pop();
-        if (stack.length === 0) {
-          spans.push({ bodyStart, bodyEnd: i });
-          bodyStart = -1;
-        }
+        if (stack.length === 0) {}
       }
       continue;
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020, title = {A Title}}' to contain 'CITELINES_relevance = {Unreviewed}'

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:97:13
         stack.push("brace");
       } else if (ch === "}") {
         stack.pop();
-        if (stack.length === 0) {
+        if (stack.length !== 0) {
           spans.push({ bodyStart, bodyEnd: i });
           bodyStart = -1;
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020,\n  title = {A Tit…' to contain 'title = {A Title}'

[Survived] UnaryOperator
src/main/utils/citelinesFields.js:99:23
         stack.pop();
         if (stack.length === 0) {
           spans.push({ bodyStart, bodyEnd: i });
-          bodyStart = -1;
+          bodyStart = +1;
         }
       }

[Killed] BlockStatement
src/main/utils/citelinesFields.js:105:21
       continue;
     }
 
-    if (ch === "@") {
-      const openBrace = text.indexOf("{", i);
-      if (openBrace === -1) break;
-      stack.push("brace");
-      bodyStart = openBrace + 1;
-      i = openBrace;
-    }
+    if (ch === "@") {}
   }
   return spans;
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:105:9
       continue;
     }
 
-    if (ch === "@") {
+    if (false) {
       const openBrace = text.indexOf("{", i);
       if (openBrace === -1) break;
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:107:11
 
     if (ch === "@") {
       const openBrace = text.indexOf("{", i);
-      if (openBrace === -1) break;
+      if (true) break;
       stack.push("brace");
       bodyStart = openBrace + 1;
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:107:11
 
     if (ch === "@") {
       const openBrace = text.indexOf("{", i);
-      if (openBrace === -1) break;
+      if (openBrace !== -1) break;
       stack.push("brace");
       bodyStart = openBrace + 1;
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Survived] StringLiteral
src/main/utils/citelinesFields.js:108:18
     if (ch === "@") {
       const openBrace = text.indexOf("{", i);
       if (openBrace === -1) break;
-      stack.push("brace");
+      stack.push("");
       bodyStart = openBrace + 1;
       i = openBrace;

[Killed] ArithmeticOperator
src/main/utils/citelinesFields.js:109:19
       const openBrace = text.indexOf("{", i);
       if (openBrace === -1) break;
       stack.push("brace");
-      bodyStart = openBrace + 1;
+      bodyStart = openBrace - 1;
       i = openBrace;
     }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] BlockStatement
src/main/utils/citelinesFields.js:117:31
 }
 
 /** Splits an entry body into its citeKey portion and its raw (untrimmed) field chunks. */
-function splitEntryBody(body) {
-  const parts = splitTopLevel(body, ",");
-  const [citeKeyPart, ...rest] = parts;
-  // A trailing comma after the last field produces one empty trailing chunk; drop it.
-  const fieldChunks = rest.filter((chunk) => chunk.trim().length > 0);
-  return { citeKeyPart, fieldChunks };
-}
+function splitEntryBody(body) {}
 
 /** Parses one raw field chunk ("  name = {value}") into {name, value}, or null if malformed. */
killedBy: BibTexEntryShowPage tests shows loading, then the entry's citekey, raw bibtex, and both buttons
statusReason: Unable to find an element by: [data-testid="BibTexEntryShowPage-bibtex"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:121:46
   const parts = splitTopLevel(body, ",");
   const [citeKeyPart, ...rest] = parts;
   // A trailing comma after the last field produces one empty trailing chunk; drop it.
-  const fieldChunks = rest.filter((chunk) => chunk.trim().length > 0);
+  const fieldChunks = rest.filter((chunk) => false);
   return { citeKeyPart, fieldChunks };
 }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ArrowFunction
src/main/utils/citelinesFields.js:121:35
   const parts = splitTopLevel(body, ",");
   const [citeKeyPart, ...rest] = parts;
   // A trailing comma after the last field produces one empty trailing chunk; drop it.
-  const fieldChunks = rest.filter((chunk) => chunk.trim().length > 0);
+  const fieldChunks = rest.filter(() => undefined);
   return { citeKeyPart, fieldChunks };
 }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] BlockStatement
src/main/utils/citelinesFields.js:126:33
 }
 
 /** Parses one raw field chunk ("  name = {value}") into {name, value}, or null if malformed. */
-function parseFieldChunk(chunk) {
-  const eq = chunk.indexOf("=");
-  if (eq === -1) {
-    return null;
-  }
-  const name = chunk.slice(0, eq).trim().toLowerCase();
-  let value = chunk.slice(eq + 1).trim();
-  if (
-    (value.startsWith("{") && value.endsWith("}")) ||
-    (value.startsWith('"') && value.endsWith('"'))
-  ) {
-    value = value.slice(1, -1);
-  }
-  return { name, value };
-}
+function parseFieldChunk(chunk) {}
 
 function normalizeRelevance(rawValue) {
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:128:7
 /** Parses one raw field chunk ("  name = {value}") into {name, value}, or null if malformed. */
 function parseFieldChunk(chunk) {
   const eq = chunk.indexOf("=");
-  if (eq === -1) {
+  if (true) {
     return null;
   }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:128:7
 /** Parses one raw field chunk ("  name = {value}") into {name, value}, or null if malformed. */
 function parseFieldChunk(chunk) {
   const eq = chunk.indexOf("=");
-  if (eq === -1) {
+  if (eq !== -1) {
     return null;
   }
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] MethodExpression
src/main/utils/citelinesFields.js:131:16
   if (eq === -1) {
     return null;
   }
-  const name = chunk.slice(0, eq).trim().toLowerCase();
+  const name = chunk.slice(0, eq).toLowerCase();
   let value = chunk.slice(eq + 1).trim();
   if (
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] MethodExpression
src/main/utils/citelinesFields.js:131:16
   if (eq === -1) {
     return null;
   }
-  const name = chunk.slice(0, eq).trim().toLowerCase();
+  const name = chunk.slice(0, eq).trim().toUpperCase();
   let value = chunk.slice(eq + 1).trim();
   if (
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] MethodExpression
src/main/utils/citelinesFields.js:132:15
     return null;
   }
   const name = chunk.slice(0, eq).trim().toLowerCase();
-  let value = chunk.slice(eq + 1).trim();
+  let value = chunk.slice(eq + 1);
   if (
     (value.startsWith("{") && value.endsWith("}")) ||
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] ArithmeticOperator
src/main/utils/citelinesFields.js:132:27
     return null;
   }
   const name = chunk.slice(0, eq).trim().toLowerCase();
-  let value = chunk.slice(eq + 1).trim();
+  let value = chunk.slice(eq - 1).trim();
   if (
     (value.startsWith("{") && value.endsWith("}")) ||
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] MethodExpression
src/main/utils/citelinesFields.js:134:31
   const name = chunk.slice(0, eq).trim().toLowerCase();
   let value = chunk.slice(eq + 1).trim();
   if (
-    (value.startsWith("{") && value.endsWith("}")) ||
+    (value.startsWith("{") && value.startsWith("}")) ||
     (value.startsWith('"') && value.endsWith('"'))
   ) {
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] LogicalOperator
src/main/utils/citelinesFields.js:134:5
   const name = chunk.slice(0, eq).trim().toLowerCase();
   let value = chunk.slice(eq + 1).trim();
   if (
-    (value.startsWith("{") && value.endsWith("}")) ||
-    (value.startsWith('"') && value.endsWith('"'))
+    value.startsWith("{") && value.endsWith("}") && value.startsWith('"') && value.endsWith('"')
   ) {
     value = value.slice(1, -1);
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:135:6
   let value = chunk.slice(eq + 1).trim();
   if (
     (value.startsWith("{") && value.endsWith("}")) ||
-    (value.startsWith('"') && value.endsWith('"'))
+    (false)
   ) {
     value = value.slice(1, -1);
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Survived] LogicalOperator
src/main/utils/citelinesFields.js:135:6
   let value = chunk.slice(eq + 1).trim();
   if (
     (value.startsWith("{") && value.endsWith("}")) ||
-    (value.startsWith('"') && value.endsWith('"'))
+    (value.startsWith('"') || value.endsWith('"'))
   ) {
     value = value.slice(1, -1);

[Killed] BlockStatement
src/main/utils/citelinesFields.js:136:5
   if (
     (value.startsWith("{") && value.endsWith("}")) ||
     (value.startsWith('"') && value.endsWith('"'))
-  ) {
-    value = value.slice(1, -1);
-  }
+  ) {}
   return { name, value };
 }
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style
