[Killed] MethodExpression
src/main/utils/citelinesFields.js:137:13
     (value.startsWith("{") && value.endsWith("}")) ||
     (value.startsWith('"') && value.endsWith('"'))
   ) {
-    value = value.slice(1, -1);
+    value = value;
   }
   return { name, value };
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] UnaryOperator
src/main/utils/citelinesFields.js:137:28
     (value.startsWith("{") && value.endsWith("}")) ||
     (value.startsWith('"') && value.endsWith('"'))
   ) {
-    value = value.slice(1, -1);
+    value = value.slice(1, +1);
   }
   return { name, value };
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/main/utils/citelinesFields.js:142:39
   return { name, value };
 }
 
-function normalizeRelevance(rawValue) {
-  const match = RELEVANCE_OPTIONS.find(
-    (option) => option.toLowerCase() === rawValue.trim().toLowerCase(),
-  );
-  return match ?? DEFAULT_RELEVANCE;
-}
+function normalizeRelevance(rawValue) {}
 
 /**
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] ArrowFunction
src/main/utils/citelinesFields.js:144:5
 
 function normalizeRelevance(rawValue) {
   const match = RELEVANCE_OPTIONS.find(
-    (option) => option.toLowerCase() === rawValue.trim().toLowerCase(),
+    () => undefined,
   );
   return match ?? DEFAULT_RELEVANCE;
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:144:17
 
 function normalizeRelevance(rawValue) {
   const match = RELEVANCE_OPTIONS.find(
-    (option) => option.toLowerCase() === rawValue.trim().toLowerCase(),
+    (option) => option.toLowerCase() !== rawValue.trim().toLowerCase(),
   );
   return match ?? DEFAULT_RELEVANCE;
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Medium

Ignored nodes: comments, script, style

[Killed] LogicalOperator
src/main/utils/citelinesFields.js:146:10
   const match = RELEVANCE_OPTIONS.find(
     (option) => option.toLowerCase() === rawValue.trim().toLowerCase(),
   );
-  return match ?? DEFAULT_RELEVANCE;
+  return match && DEFAULT_RELEVANCE;
 }
 
killedBy: BibTexEntryModal tests when editing an entry with an existing relevance, strips it from the text and pre-fills the dropdown
statusReason: expect(element).toHaveValue(High)

Expected the element to have value:
  High
Received:
  Unreviewed

Ignored nodes: comments, script, style

[Killed] BlockStatement
src/main/utils/citelinesFields.js:160:19
  * @returns {{strippedBibtex: string, relevance: string, preservedFields: Record<string,string>}}
  */
 export function extractCitelinesFields(rawBibtex) {
-  if (!rawBibtex) {
-    return {
-      strippedBibtex: rawBibtex ?? "",
-      relevance: DEFAULT_RELEVANCE,
-      preservedFields: {},
-    };
-  }
+  if (!rawBibtex) {}
 
   const spans = findEntryBodySpans(rawBibtex);
killedBy: citelinesFields extractCitelinesFields round-trips through a real BibTeX-shaped null/empty input without throwing
statusReason: Cannot read properties of null (reading 'length')

[Killed] BooleanLiteral
src/main/utils/citelinesFields.js:160:7
  * @returns {{strippedBibtex: string, relevance: string, preservedFields: Record<string,string>}}
  */
 export function extractCitelinesFields(rawBibtex) {
-  if (!rawBibtex) {
+  if (rawBibtex) {
     return {
       strippedBibtex: rawBibtex ?? "",
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }

[Killed] ObjectLiteral
src/main/utils/citelinesFields.js:161:12
  */
 export function extractCitelinesFields(rawBibtex) {
   if (!rawBibtex) {
-    return {
-      strippedBibtex: rawBibtex ?? "",
-      relevance: DEFAULT_RELEVANCE,
-      preservedFields: {},
-    };
+    return {};
   }
 
killedBy: citelinesFields extractCitelinesFields round-trips through a real BibTeX-shaped null/empty input without throwing
statusReason: expected {} to deeply equal { strippedBibtex: '', …(2) }

[Killed] LogicalOperator
src/main/utils/citelinesFields.js:162:23
 export function extractCitelinesFields(rawBibtex) {
   if (!rawBibtex) {
     return {
-      strippedBibtex: rawBibtex ?? "",
+      strippedBibtex: rawBibtex && "",
       relevance: DEFAULT_RELEVANCE,
       preservedFields: {},
killedBy: citelinesFields extractCitelinesFields round-trips through a real BibTeX-shaped null/empty input without throwing
statusReason: expected { strippedBibtex: null, …(2) } to deeply equal { strippedBibtex: '', …(2) }

[Killed] StringLiteral
src/main/utils/citelinesFields.js:162:36
 export function extractCitelinesFields(rawBibtex) {
   if (!rawBibtex) {
     return {
-      strippedBibtex: rawBibtex ?? "",
+      strippedBibtex: rawBibtex ?? "Stryker was here!",
       relevance: DEFAULT_RELEVANCE,
       preservedFields: {},
killedBy: citelinesFields extractCitelinesFields round-trips through a real BibTeX-shaped null/empty input without throwing
statusReason: expected { …(3) } to deeply equal { strippedBibtex: '', …(2) }

[Killed] BlockStatement
src/main/utils/citelinesFields.js:169:27
   }
 
   const spans = findEntryBodySpans(rawBibtex);
-  if (spans.length === 0) {
-    return {
-      strippedBibtex: rawBibtex,
-      relevance: DEFAULT_RELEVANCE,
-      preservedFields: {},
-    };
-  }
+  if (spans.length === 0) {}
 
   const { bodyStart, bodyEnd } = spans[0];
killedBy: citelinesFields extractCitelinesFields stops scanning cleanly when '@' is never followed by '{' anywhere in the text
statusReason: Cannot destructure property 'bodyStart' of 'spans[0]' as it is undefined.

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:169:7
   }
 
   const spans = findEntryBodySpans(rawBibtex);
-  if (spans.length === 0) {
+  if (false) {
     return {
       strippedBibtex: rawBibtex,
killedBy: citelinesFields extractCitelinesFields stops scanning cleanly when '@' is never followed by '{' anywhere in the text
statusReason: Cannot destructure property 'bodyStart' of 'spans[0]' as it is undefined.

[Killed] MethodExpression
src/main/utils/citelinesFields.js:178:16
   }
 
   const { bodyStart, bodyEnd } = spans[0];
-  const body = rawBibtex.slice(bodyStart, bodyEnd);
+  const body = rawBibtex;
   const { citeKeyPart, fieldChunks } = splitEntryBody(body);
 
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Survived] ArrayDeclaration
src/main/utils/citelinesFields.js:183:22
 
   let relevance = DEFAULT_RELEVANCE;
   const preservedFields = {};
-  const keptChunks = [];
+  const keptChunks = ["Stryker was here"];
   let foundCitelinesField = false;
 

[Killed] BooleanLiteral
src/main/utils/citelinesFields.js:184:29
   let relevance = DEFAULT_RELEVANCE;
   const preservedFields = {};
   const keptChunks = [];
-  let foundCitelinesField = false;
+  let foundCitelinesField = true;
 
   for (const chunk of fieldChunks) {
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: expect(element).toHaveValue(@article{smith2020,
  title = {Existing}
}
)

Expected the element to have value:
  @article{smith2020,
    title = {Existing}

[Killed] BlockStatement
src/main/utils/citelinesFields.js:186:36
   const keptChunks = [];
   let foundCitelinesField = false;
 
-  for (const chunk of fieldChunks) {
-    const field = parseFieldChunk(chunk);
-    if (!field) {
-      keptChunks.push(chunk.trim());
-      continue;
-    }
-    if (field.name === RELEVANCE_FIELD_NAME) {
-      relevance = normalizeRelevance(field.value);
-      foundCitelinesField = true;
-    } else if (field.name.startsWith(CITELINES_PREFIX)) {
-      preservedFields[field.name] = field.value;
-      foundCitelinesField = true;
-    } else {
-      keptChunks.push(chunk.trim());
-    }
-  }
+  for (const chunk of fieldChunks) {}
 
   // Nothing to strip: return the original text untouched rather than a reformatted
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] BlockStatement
src/main/utils/citelinesFields.js:188:17
 
   for (const chunk of fieldChunks) {
     const field = parseFieldChunk(chunk);
-    if (!field) {
-      keptChunks.push(chunk.trim());
-      continue;
-    }
+    if (!field) {}
     if (field.name === RELEVANCE_FIELD_NAME) {
       relevance = normalizeRelevance(field.value);
killedBy: citelinesFields extractCitelinesFields preserves a malformed field chunk with no '=' as-is
statusReason: Cannot read properties of null (reading 'name')

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:188:9
 
   for (const chunk of fieldChunks) {
     const field = parseFieldChunk(chunk);
-    if (!field) {
+    if (true) {
       keptChunks.push(chunk.trim());
       continue;
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Survived] MethodExpression
src/main/utils/citelinesFields.js:189:23
   for (const chunk of fieldChunks) {
     const field = parseFieldChunk(chunk);
     if (!field) {
-      keptChunks.push(chunk.trim());
+      keptChunks.push(chunk);
       continue;
     }

[Killed] BlockStatement
src/main/utils/citelinesFields.js:192:46
       keptChunks.push(chunk.trim());
       continue;
     }
-    if (field.name === RELEVANCE_FIELD_NAME) {
-      relevance = normalizeRelevance(field.value);
-      foundCitelinesField = true;
-    } else if (field.name.startsWith(CITELINES_PREFIX)) {
+    if (field.name === RELEVANCE_FIELD_NAME) {} else if (field.name.startsWith(CITELINES_PREFIX)) {
       preservedFields[field.name] = field.value;
       foundCitelinesField = true;
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected 'Unreviewed' to be 'High' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:192:9
       keptChunks.push(chunk.trim());
       continue;
     }
-    if (field.name === RELEVANCE_FIELD_NAME) {
+    if (true) {
       relevance = normalizeRelevance(field.value);
       foundCitelinesField = true;
killedBy: citelinesFields extractCitelinesFields returns Unreviewed and no preserved fields for a plain entry, unchanged byte-for-byte
statusReason: expected '@article{smith2020,\n}\n' to be '@article{smith2020,\n  author = {Jane…' // Object.is equality

[Killed] BooleanLiteral
src/main/utils/citelinesFields.js:194:29
     }
     if (field.name === RELEVANCE_FIELD_NAME) {
       relevance = normalizeRelevance(field.value);
-      foundCitelinesField = true;
+      foundCitelinesField = false;
     } else if (field.name.startsWith(CITELINES_PREFIX)) {
       preservedFields[field.name] = field.value;
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected '@article{smith2020,\n  author = {Jane…' not to contain 'citelines_relevance'

[Killed] BlockStatement
src/main/utils/citelinesFields.js:195:57
     if (field.name === RELEVANCE_FIELD_NAME) {
       relevance = normalizeRelevance(field.value);
       foundCitelinesField = true;
-    } else if (field.name.startsWith(CITELINES_PREFIX)) {
-      preservedFields[field.name] = field.value;
-      foundCitelinesField = true;
-    } else {
+    } else if (field.name.startsWith(CITELINES_PREFIX)) {} else {
       keptChunks.push(chunk.trim());
     }
killedBy: BibTexEntryModal tests re-injects the (possibly changed) relevance and any other preserved CITELINES_ fields on submit
statusReason: expected '@article{smith2020,\n  title = "Exist…' to contain 'CITELINES_position = {3}'

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:195:16
     if (field.name === RELEVANCE_FIELD_NAME) {
       relevance = normalizeRelevance(field.value);
       foundCitelinesField = true;
-    } else if (field.name.startsWith(CITELINES_PREFIX)) {
+    } else if (true) {
       preservedFields[field.name] = field.value;
       foundCitelinesField = true;
killedBy: citelinesFields extractCitelinesFields returns Unreviewed and no preserved fields for a plain entry, unchanged byte-for-byte
statusReason: expected { author: 'Jane Smith', …(2) } to deeply equal {}

[Killed] BooleanLiteral
src/main/utils/citelinesFields.js:197:29
       foundCitelinesField = true;
     } else if (field.name.startsWith(CITELINES_PREFIX)) {
       preservedFields[field.name] = field.value;
-      foundCitelinesField = true;
+      foundCitelinesField = false;
     } else {
       keptChunks.push(chunk.trim());
killedBy: citelinesFields extractCitelinesFields preserves other CITELINES_ fields (case-insensitively) without displaying them
statusReason: expected '@article{smith2020,\n  title = {T},\n…' not to contain 'position'

[Killed] BlockStatement
src/main/utils/citelinesFields.js:198:12
     } else if (field.name.startsWith(CITELINES_PREFIX)) {
       preservedFields[field.name] = field.value;
       foundCitelinesField = true;
-    } else {
-      keptChunks.push(chunk.trim());
-    }
+    } else {}
   }
 
killedBy: citelinesFields extractCitelinesFields extracts an existing relevance value and strips it from the displayed text
statusReason: expected '@article{smith2020,\n}\n' to contain 'author = {Jane Smith}'

[Survived] MethodExpression
src/main/utils/citelinesFields.js:199:23
       preservedFields[field.name] = field.value;
       foundCitelinesField = true;
     } else {
-      keptChunks.push(chunk.trim());
+      keptChunks.push(chunk);
     }
   }

[Killed] BlockStatement
src/main/utils/citelinesFields.js:205:29
 
   // Nothing to strip: return the original text untouched rather than a reformatted
   // (but equivalent) rebuild, so editing an entry that predates this feature causes no diff.
-  if (!foundCitelinesField) {
-    return { strippedBibtex: rawBibtex, relevance, preservedFields };
-  }
+  if (!foundCitelinesField) {}
 
   const rebuiltBody = [
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: expect(element).toHaveValue(@article{smith2020,
  title = {Existing}
}
)

Expected the element to have value:
  @article{smith2020,
    title = {Existing}

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:205:7
 
   // Nothing to strip: return the original text untouched rather than a reformatted
   // (but equivalent) rebuild, so editing an entry that predates this feature causes no diff.
-  if (!foundCitelinesField) {
+  if (false) {
     return { strippedBibtex: rawBibtex, relevance, preservedFields };
   }
killedBy: BibTexEntryModal tests when editing, fetches and pre-fills the existing entry's BibTeX text
statusReason: expect(element).toHaveValue(@article{smith2020,
  title = {Existing}
}
)

Expected the element to have value:
  @article{smith2020,
    title = {Existing}

[Killed] ArrayDeclaration
src/main/utils/citelinesFields.js:209:23
     return { strippedBibtex: rawBibtex, relevance, preservedFields };
   }
 
-  const rebuiltBody = [
-    citeKeyPart.trim(),
-    ...keptChunks.map((c) => `\n  ${c}`),
-  ].join(",");
+  const rebuiltBody = [].join(",");
   const strippedBibtex =
     rawBibtex.slice(0, bodyStart) +
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  title = "A Very Long Title"
Received:
  @article{, }

Ignored nodes: comments, script, style

[Survived] MethodExpression
src/main/utils/citelinesFields.js:210:5
   }
 
   const rebuiltBody = [
-    citeKeyPart.trim(),
+    citeKeyPart,
     ...keptChunks.map((c) => `\n  ${c}`),
   ].join(",");

[Killed] ArrowFunction
src/main/utils/citelinesFields.js:211:23
 
   const rebuiltBody = [
     citeKeyPart.trim(),
-    ...keptChunks.map((c) => `\n  ${c}`),
+    ...keptChunks.map(() => undefined),
   ].join(",");
   const strippedBibtex =
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  title = "A Very Long Title"
Received:
  @article{smith2020,, }

Ignored nodes: comments, script, style

[Killed] ArithmeticOperator
src/main/utils/citelinesFields.js:214:5
     ...keptChunks.map((c) => `\n  ${c}`),
   ].join(",");
   const strippedBibtex =
-    rawBibtex.slice(0, bodyStart) +
-    rebuiltBody +
+    rawBibtex.slice(0, bodyStart) - rebuiltBody +
     ",\n" +
     rawBibtex.slice(bodyEnd);
killedBy: BibTexEntryModal tests when editing an entry with an existing relevance, strips it from the text and pre-fills the dropdown
statusReason: expected 'NaN,\n}' to contain 'title = "Existing"'

[Killed] MethodExpression
src/main/utils/citelinesFields.js:214:5
     ...keptChunks.map((c) => `\n  ${c}`),
   ].join(",");
   const strippedBibtex =
-    rawBibtex.slice(0, bodyStart) +
+    rawBibtex +
     rebuiltBody +
     ",\n" +
killedBy: BibTexEntryShowPage tests strips CITELINES_ fields out of the displayed bibtex text
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  citelines
Received:
  @article{smith2020, title = "A Very Long Title", citelines_relevance = "High" }smith2020, title = "A Very Long Title", }

[Killed] MethodExpression
src/main/utils/citelinesFields.js:217:5
     rawBibtex.slice(0, bodyStart) +
     rebuiltBody +
     ",\n" +
-    rawBibtex.slice(bodyEnd);
+    rawBibtex;
 
   return { strippedBibtex, relevance, preservedFields };
killedBy: BibTexEntryModal tests when editing an entry with an existing relevance, strips it from the text and pre-fills the dropdown
statusReason: expected '@article{smith2020,\n  title = "Exist…' not to contain 'citelines'

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:238:7
   relevance,
   preservedFields = {},
 ) {
-  if (!rawBibtex) {
+  if (false) {
     return rawBibtex ?? "";
   }
killedBy: citelinesFields injectCitelinesFields is a no-op for empty or unrecognizable input
statusReason: Cannot read properties of null (reading 'length')

[Killed] BlockStatement
src/main/utils/citelinesFields.js:238:19
   relevance,
   preservedFields = {},
 ) {
-  if (!rawBibtex) {
-    return rawBibtex ?? "";
-  }
+  if (!rawBibtex) {}
 
   const spans = findEntryBodySpans(rawBibtex);
killedBy: citelinesFields injectCitelinesFields is a no-op for empty or unrecognizable input
statusReason: Cannot read properties of null (reading 'length')

[Killed] LogicalOperator
src/main/utils/citelinesFields.js:239:12
   preservedFields = {},
 ) {
   if (!rawBibtex) {
-    return rawBibtex ?? "";
+    return rawBibtex && "";
   }
 
killedBy: citelinesFields injectCitelinesFields is a no-op for empty or unrecognizable input
statusReason: expected null to be '' // Object.is equality

[Killed] EqualityOperator
src/main/utils/citelinesFields.js:243:7
   }
 
   const spans = findEntryBodySpans(rawBibtex);
-  if (spans.length === 0) {
+  if (spans.length !== 0) {
     return rawBibtex;
   }
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected '@article{smith2020,\n\ttitle = "A Ver…' to contain 'CITELINES_relevance = {Low}'

[Killed] ConditionalExpression
src/main/utils/citelinesFields.js:243:7
   }
 
   const spans = findEntryBodySpans(rawBibtex);
-  if (spans.length === 0) {
+  if (true) {
     return rawBibtex;
   }
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020, title = {A Title}}' to contain 'CITELINES_relevance = {Unreviewed}'

[Killed] ArrowFunction
src/main/utils/citelinesFields.js:249:5
 
   const extraFields = { [RELEVANCE_FIELD_NAME]: relevance, ...preservedFields };
   const extraChunks = Object.entries(extraFields).map(
-    ([name, value]) =>
-      `\n  CITELINES_${name.slice(CITELINES_PREFIX.length)} = {${value}}`,
+    () => undefined,
   );
 
killedBy: citelinesFields injectCitelinesFields adds a CITELINES_relevance field to a plain entry
statusReason: expected '@article{smith2020,\n  author = {Jane…' to contain 'CITELINES_relevance = {High}'

[Killed] MethodExpression
src/main/utils/citelinesFields.js:250:24
   const extraFields = { [RELEVANCE_FIELD_NAME]: relevance, ...preservedFields };
   const extraChunks = Object.entries(extraFields).map(
     ([name, value]) =>
-      `\n  CITELINES_${name.slice(CITELINES_PREFIX.length)} = {${value}}`,
+      `\n  CITELINES_${name} = {${value}}`,
   );
 
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected '@article{smith2020,\n  title = "A Ver…' to contain 'CITELINES_relevance = {Low}'

[Killed] BlockStatement
src/main/utils/citelinesFields.js:255:47
 
   let result = "";
   let cursor = 0;
-  for (const { bodyStart, bodyEnd } of spans) {
-    const body = rawBibtex.slice(bodyStart, bodyEnd);
-    const { citeKeyPart, fieldChunks } = splitEntryBody(body);
-    const keptChunks = fieldChunks
-      .filter((chunk) => {
-        const field = parseFieldChunk(chunk);
-        return !(field && field.name.startsWith(CITELINES_PREFIX));
-      })
-      .map((chunk) => chunk.trim());
-
-    const rebuiltBody = [
-      citeKeyPart.trim(),
-      ...keptChunks.map((c) => `\n  ${c}`),
-      ...extraChunks,
-    ].join(",");
-
-    result += rawBibtex.slice(cursor, bodyStart) + rebuiltBody + ",\n";
-    cursor = bodyEnd;
-  }
+  for (const { bodyStart, bodyEnd } of spans) {}
   result += rawBibtex.slice(cursor);
 
killedBy: BibTexEntryShowPage tests shows the entry's current relevance in the dropdown, and updating it PUTs the new value
statusReason: expected '@article{smith2020,\n\ttitle = "A Ver…' to contain 'CITELINES_relevance = {Low}'

[Killed] MethodExpression
src/main/utils/citelinesFields.js:256:18
   let result = "";
   let cursor = 0;
   for (const { bodyStart, bodyEnd } of spans) {
-    const body = rawBibtex.slice(bodyStart, bodyEnd);
+    const body = rawBibtex;
     const { citeKeyPart, fieldChunks } = splitEntryBody(body);
     const keptChunks = fieldChunks
killedBy: citelinesFields injectCitelinesFields does not duplicate a CITELINES_ field the user left in the edited text
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/main/utils/citelinesFields.js:258:24
   for (const { bodyStart, bodyEnd } of spans) {
     const body = rawBibtex.slice(bodyStart, bodyEnd);
     const { citeKeyPart, fieldChunks } = splitEntryBody(body);
-    const keptChunks = fieldChunks
-      .filter((chunk) => {
-        const field = parseFieldChunk(chunk);
-        return !(field && field.name.startsWith(CITELINES_PREFIX));
-      })
+    const keptChunks = fieldChunks
       .map((chunk) => chunk.trim());
 
killedBy: citelinesFields injectCitelinesFields does not duplicate a CITELINES_ field the user left in the edited text
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BlockStatement
src/main/utils/citelinesFields.js:259:26
     const body = rawBibtex.slice(bodyStart, bodyEnd);
     const { citeKeyPart, fieldChunks } = splitEntryBody(body);
     const keptChunks = fieldChunks
-      .filter((chunk) => {
-        const field = parseFieldChunk(chunk);
-        return !(field && field.name.startsWith(CITELINES_PREFIX));
-      })
+      .filter((chunk) => {})
       .map((chunk) => chunk.trim());
 
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020,\n  CITELINES_rele…' to contain 'title = {A Title}'

[Killed] LogicalOperator
src/main/utils/citelinesFields.js:261:18
     const keptChunks = fieldChunks
       .filter((chunk) => {
         const field = parseFieldChunk(chunk);
-        return !(field && field.name.startsWith(CITELINES_PREFIX));
+        return !(field || field.name.startsWith(CITELINES_PREFIX));
       })
       .map((chunk) => chunk.trim());
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020,\n  CITELINES_rele…' to contain 'title = {A Title}'

[Killed] MethodExpression
src/main/utils/citelinesFields.js:261:27
     const keptChunks = fieldChunks
       .filter((chunk) => {
         const field = parseFieldChunk(chunk);
-        return !(field && field.name.startsWith(CITELINES_PREFIX));
+        return !(field && field.name.endsWith(CITELINES_PREFIX));
       })
       .map((chunk) => chunk.trim());
killedBy: citelinesFields injectCitelinesFields does not duplicate a CITELINES_ field the user left in the edited text
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
src/main/utils/citelinesFields.js:263:12
         const field = parseFieldChunk(chunk);
         return !(field && field.name.startsWith(CITELINES_PREFIX));
       })
-      .map((chunk) => chunk.trim());
+      .map(() => undefined);
 
     const rebuiltBody = [
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected '@article{smith2020,\n  undefined,\n  …' to contain 'title = {A Title}'

[Survived] MethodExpression
src/main/utils/citelinesFields.js:263:23
         const field = parseFieldChunk(chunk);
         return !(field && field.name.startsWith(CITELINES_PREFIX));
       })
-      .map((chunk) => chunk.trim());
+      .map((chunk) => chunk);
 
     const rebuiltBody = [

[Killed] StringLiteral
src/main/utils/citelinesFields.js:269:12
       citeKeyPart.trim(),
       ...keptChunks.map((c) => `\n  ${c}`),
       ...extraChunks,
-    ].join(",");
+    ].join("");
 
     result += rawBibtex.slice(cursor, bodyStart) + rebuiltBody + ",\n";
killedBy: citelinesFields injectCitelinesFields injects correctly into the exact format the real backend export endpoint produces
statusReason: expected 'Unreviewed' to be 'Low' // Object.is equality

[Killed] AssignmentOperator
src/main/utils/citelinesFields.js:271:5
       ...extraChunks,
     ].join(",");
 
-    result += rawBibtex.slice(cursor, bodyStart) + rebuiltBody + ",\n";
+    result -= rawBibtex.slice(cursor, bodyStart) + rebuiltBody + ",\n";
     cursor = bodyEnd;
   }
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected 'NaN}' to contain '@article{smith2020'

[Killed] MethodExpression
src/main/utils/citelinesFields.js:271:15
       ...extraChunks,
     ].join(",");
 
-    result += rawBibtex.slice(cursor, bodyStart) + rebuiltBody + ",\n";
+    result += rawBibtex + rebuiltBody + ",\n";
     cursor = bodyEnd;
   }
killedBy: citelinesFields injectCitelinesFields does not duplicate a CITELINES_ field the user left in the edited text
statusReason: expected 2 to be 1 // Object.is equality

[Killed] AssignmentOperator
src/main/utils/citelinesFields.js:274:3
     result += rawBibtex.slice(cursor, bodyStart) + rebuiltBody + ",\n";
     cursor = bodyEnd;
   }
-  result += rawBibtex.slice(cursor);
+  result -= rawBibtex.slice(cursor);
 
   return result;
killedBy: BibTexEntryModal tests submits pasted text as a POST and shows a success toast
statusReason: expected [] to include '@article{smith2020'

[Killed] MethodExpression
src/main/utils/citelinesFields.js:274:13
     result += rawBibtex.slice(cursor, bodyStart) + rebuiltBody + ",\n";
     cursor = bodyEnd;
   }
-  result += rawBibtex.slice(cursor);
+  result += rawBibtex;
 
   return result;
killedBy: citelinesFields injectCitelinesFields does not duplicate a CITELINES_ field the user left in the edited text
statusReason: expected 2 to be 1 // Object.is equality
