[Killed] BlockStatement
src/main/utils/colorUtils.js:9:31
  *
  * Returns null if the input is not a valid hex color.
  */
-export function hexToRgb(hex) {
-  if (typeof hex !== "string") return null;
-
-  const normalized = hex.trim().replace(/^#/, "");
-
-  const expanded =
-    normalized.length === 3
-      ? normalized
-          .split("")
-          .map((c) => c + c)
-          .join("")
-      : normalized;
-
-  if (!/^[0-9a-fA-F]{6}$/.test(expanded)) return null;
-
-  const r = parseInt(expanded.substring(0, 2), 16);
-  const g = parseInt(expanded.substring(2, 4), 16);
-  const b = parseInt(expanded.substring(4, 6), 16);
-
-  return { r, g, b };
-}
+export function hexToRgb(hex) {}
 
 /**
killedBy: TagSelector tests uses default color when a tag has no color
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);
+ color: rgb(0, 0, 0);

[Killed] EqualityOperator
src/main/utils/colorUtils.js:10:7
  * Returns null if the input is not a valid hex color.
  */
 export function hexToRgb(hex) {
-  if (typeof hex !== "string") return null;
+  if (typeof hex === "string") return null;
 
   const normalized = hex.trim().replace(/^#/, "");
killedBy: TagSelector tests uses default color when a tag has no color
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);
+ color: rgb(0, 0, 0);

[Killed] ConditionalExpression
src/main/utils/colorUtils.js:10:7
  * Returns null if the input is not a valid hex color.
  */
 export function hexToRgb(hex) {
-  if (typeof hex !== "string") return null;
+  if (false) return null;
 
   const normalized = hex.trim().replace(/^#/, "");
killedBy: colorUtils tests hexToRgb returns null for invalid input
statusReason: Cannot read properties of undefined (reading 'trim')

[Survived] MethodExpression
src/main/utils/colorUtils.js:12:22
 export function hexToRgb(hex) {
   if (typeof hex !== "string") return null;
 
-  const normalized = hex.trim().replace(/^#/, "");
+  const normalized = hex.replace(/^#/, "");
 
   const expanded =

[Killed] ConditionalExpression
src/main/utils/colorUtils.js:15:5
   const normalized = hex.trim().replace(/^#/, "");
 
   const expanded =
-    normalized.length === 3
+    true
       ? normalized
           .split("")
killedBy: colorUtils tests hexToRgb parses 6-digit hex colors
statusReason: expected null to deeply equal { r: 255, g: +0, b: +0 }

[Killed] ConditionalExpression
src/main/utils/colorUtils.js:15:5
   const normalized = hex.trim().replace(/^#/, "");
 
   const expanded =
-    normalized.length === 3
+    false
       ? normalized
           .split("")
killedBy: colorUtils tests hexToRgb parses 3-digit hex colors
statusReason: expected null to deeply equal { r: +0, g: 255, b: +0 }

[Killed] StringLiteral
src/main/utils/colorUtils.js:17:18
   const expanded =
     normalized.length === 3
       ? normalized
-          .split("")
+          .split("Stryker was here!")
           .map((c) => c + c)
           .join("")
killedBy: colorUtils tests hexToRgb parses 3-digit hex colors
statusReason: expected { r: 15, g: +0, b: 240 } to deeply equal { r: +0, g: 255, b: +0 }

[Killed] ArithmeticOperator
src/main/utils/colorUtils.js:18:23
     normalized.length === 3
       ? normalized
           .split("")
-          .map((c) => c + c)
+          .map((c) => c - c)
           .join("")
       : normalized;
killedBy: colorUtils tests hexToRgb parses 3-digit hex colors
statusReason: expected null to deeply equal { r: +0, g: 255, b: +0 }

[Killed] ArrowFunction
src/main/utils/colorUtils.js:18:16
     normalized.length === 3
       ? normalized
           .split("")
-          .map((c) => c + c)
+          .map(() => undefined)
           .join("")
       : normalized;
killedBy: colorUtils tests hexToRgb parses 3-digit hex colors
statusReason: expected null to deeply equal { r: +0, g: 255, b: +0 }

[Killed] ConditionalExpression
src/main/utils/colorUtils.js:22:7
           .join("")
       : normalized;
 
-  if (!/^[0-9a-fA-F]{6}$/.test(expanded)) return null;
+  if (true) return null;
 
   const r = parseInt(expanded.substring(0, 2), 16);
killedBy: colorUtils tests hexToRgb parses 6-digit hex colors
statusReason: expected null to deeply equal { r: 255, g: +0, b: +0 }

[Killed] BooleanLiteral
src/main/utils/colorUtils.js:22:7
           .join("")
       : normalized;
 
-  if (!/^[0-9a-fA-F]{6}$/.test(expanded)) return null;
+  if (/^[0-9a-fA-F]{6}$/.test(expanded)) return null;
 
   const r = parseInt(expanded.substring(0, 2), 16);
killedBy: TagSelector tests uses default color when a tag has no color
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);
+ color: rgb(0, 0, 0);

[Killed] MethodExpression
src/main/utils/colorUtils.js:24:22
 
   if (!/^[0-9a-fA-F]{6}$/.test(expanded)) return null;
 
-  const r = parseInt(expanded.substring(0, 2), 16);
+  const r = parseInt(expanded, 16);
   const g = parseInt(expanded.substring(2, 4), 16);
   const b = parseInt(expanded.substring(4, 6), 16);
killedBy: TagSelector tests uses default color when a tag has no color
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);
+ color: rgb(0, 0, 0);

[Killed] MethodExpression
src/main/utils/colorUtils.js:25:22
   if (!/^[0-9a-fA-F]{6}$/.test(expanded)) return null;
 
   const r = parseInt(expanded.substring(0, 2), 16);
-  const g = parseInt(expanded.substring(2, 4), 16);
+  const g = parseInt(expanded, 16);
   const b = parseInt(expanded.substring(4, 6), 16);
 
killedBy: colorUtils tests hexToRgb parses 6-digit hex colors
statusReason: expected { r: 255, g: 16711680, b: +0 } to deeply equal { r: 255, g: +0, b: +0 }

[Killed] MethodExpression
src/main/utils/colorUtils.js:26:22
 
   const r = parseInt(expanded.substring(0, 2), 16);
   const g = parseInt(expanded.substring(2, 4), 16);
-  const b = parseInt(expanded.substring(4, 6), 16);
+  const b = parseInt(expanded, 16);
 
   return { r, g, b };
killedBy: TagSelector tests uses default color when a tag has no color
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);
+ color: rgb(0, 0, 0);

[Killed] BlockStatement
src/main/utils/colorUtils.js:39:48
  * @param {string} hexColor a hex color string, e.g. "#1e88e5"
  * @returns {"#000000"|"#ffffff"} the recommended text color
  */
-export function getContrastTextColor(hexColor) {
-  const rgb = hexToRgb(hexColor);
-  // Stryker disable next-line ConditionalExpression : defensive fallback for invalid/missing color
-  if (!rgb) return "#000000";
-
-  const { r, g, b } = rgb;
-  const yiq = (r * 299 + g * 587 + b * 114) / 1000;
-
-  return yiq >= 128 ? "#000000" : "#ffffff";
-}
+export function getContrastTextColor(hexColor) {}
 
 /**
killedBy: colorUtils tests getContrastTextColor returns black on light backgrounds
statusReason: expected undefined to be '#000000' // Object.is equality

[Killed] BooleanLiteral
src/main/utils/colorUtils.js:42:7
 export function getContrastTextColor(hexColor) {
   const rgb = hexToRgb(hexColor);
   // Stryker disable next-line ConditionalExpression : defensive fallback for invalid/missing color
-  if (!rgb) return "#000000";
+  if (rgb) return "#000000";
 
   const { r, g, b } = rgb;
killedBy: TagSelector tests uses default color when a tag has no color
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);
+ color: rgb(0, 0, 0);

[Killed] ArithmeticOperator
src/main/utils/colorUtils.js:45:26
   if (!rgb) return "#000000";
 
   const { r, g, b } = rgb;
-  const yiq = (r * 299 + g * 587 + b * 114) / 1000;
+  const yiq = (r * 299 + g / 587 + b * 114) / 1000;
 
   return yiq >= 128 ? "#000000" : "#ffffff";
killedBy: colorUtils tests getContrastTextColor returns black on light backgrounds
statusReason: expected '#ffffff' to be '#000000' // Object.is equality

[Killed] ArithmeticOperator
src/main/utils/colorUtils.js:45:15
   if (!rgb) return "#000000";
 
   const { r, g, b } = rgb;
-  const yiq = (r * 299 + g * 587 + b * 114) / 1000;
+  const yiq = (r * 299 + g * 587 + b * 114) * 1000;
 
   return yiq >= 128 ? "#000000" : "#ffffff";
killedBy: TagSelector tests uses default color when a tag has no color
statusReason: expect(element).toHaveStyle()

- Expected

- color: rgb(255, 255, 255);
+ color: rgb(0, 0, 0);

[Killed] EqualityOperator
src/main/utils/colorUtils.js:47:10
   const { r, g, b } = rgb;
   const yiq = (r * 299 + g * 587 + b * 114) / 1000;
 
-  return yiq >= 128 ? "#000000" : "#ffffff";
+  return yiq < 128 ? "#000000" : "#ffffff";
 }
 
killedBy: colorUtils tests getContrastTextColor returns black on light backgrounds
statusReason: expected '#ffffff' to be '#000000' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/colorUtils.js:47:10
   const { r, g, b } = rgb;
   const yiq = (r * 299 + g * 587 + b * 114) / 1000;
 
-  return yiq >= 128 ? "#000000" : "#ffffff";
+  return true ? "#000000" : "#ffffff";
 }
 
killedBy: colorUtils tests getContrastTextColor returns white on dark backgrounds
statusReason: expected '#000000' to be '#ffffff' // Object.is equality

[Killed] BlockStatement
src/main/utils/colorUtils.js:53:34
 /**
  * Returns a random hex color string, e.g. "#a1b2c3".
  */
-export function randomHexColor() {
-  const randomByte = () =>
-    Math.floor(Math.random() * 256)
-      .toString(16)
-      .padStart(2, "0");
-  return `#${randomByte()}${randomByte()}${randomByte()}`;
-}
+export function randomHexColor() {}
 
killedBy: colorUtils tests randomHexColor returns a valid hex color string
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ArrowFunction
src/main/utils/colorUtils.js:54:22
  * Returns a random hex color string, e.g. "#a1b2c3".
  */
 export function randomHexColor() {
-  const randomByte = () =>
-    Math.floor(Math.random() * 256)
-      .toString(16)
-      .padStart(2, "0");
+  const randomByte = () => undefined;
   return `#${randomByte()}${randomByte()}${randomByte()}`;
 }
killedBy: colorUtils tests randomHexColor returns a valid hex color string
statusReason: expected '#undefinedundefinedundefined' to match /^#[0-9a-f]{6}$/

[Survived] ArithmeticOperator
src/main/utils/colorUtils.js:55:16
  */
 export function randomHexColor() {
   const randomByte = () =>
-    Math.floor(Math.random() * 256)
+    Math.floor(Math.random() / 256)
       .toString(16)
       .padStart(2, "0");
