[Killed] BlockStatement
src/main/utils/currentUser.ts:40:47
   | { loggedIn: true; root: CurrentUserRoot }
   | { loggedIn: false; root: Record<string, never> | null };
 
-export function useCurrentUser(): CurrentUser {
-  const queryResults = useQuery<CurrentUser>({
-    queryKey: ["current user"],
-    queryFn: async (): Promise<CurrentUser> => {
-      try {
-        const response = await axios.get<ApiCurrentUser>("/api/currentUser");
-        const rolesList: string[] =
-          response.data.roles?.map((r: Role) => r.authority) ?? [];
-        return { loggedIn: true, root: { ...response.data, rolesList } };
-      } catch (e: unknown) {
-        const err = e as { status?: number };
-        if (err.status === 403) {
-          return { loggedIn: false, root: {} };
-        }
-        throw e;
-      }
-    },
-    initialData: { loggedIn: false, root: null },
-  });
-  return queryResults.data;
-}
+export function useCurrentUser(): CurrentUser {}
 
 export function useLogout() {
killedBy: AdminJobsPage tests clicking Update All Users button calls the correct API
statusReason: Cannot read properties of undefined (reading 'dataUpdateCount')

[Killed] BlockStatement
src/main/utils/currentUser.ts:43:48
 export function useCurrentUser(): CurrentUser {
   const queryResults = useQuery<CurrentUser>({
     queryKey: ["current user"],
-    queryFn: async (): Promise<CurrentUser> => {
-      try {
-        const response = await axios.get<ApiCurrentUser>("/api/currentUser");
-        const rolesList: string[] =
-          response.data.roles?.map((r: Role) => r.authority) ?? [];
-        return { loggedIn: true, root: { ...response.data, rolesList } };
-      } catch (e: unknown) {
-        const err = e as { status?: number };
-        if (err.status === 403) {
-          return { loggedIn: false, root: {} };
-        }
-        throw e;
-      }
-    },
+    queryFn: async (): Promise<CurrentUser> => {},
     initialData: { loggedIn: false, root: null },
   });
killedBy: AdminsIndexPage tests renders empty table when backend unavailable
statusReason: expected 'Query data cannot be undefined. Pleas…' to match 'Error communicating with backend via …'

[Killed] BlockStatement
src/main/utils/currentUser.ts:44:11
   const queryResults = useQuery<CurrentUser>({
     queryKey: ["current user"],
     queryFn: async (): Promise<CurrentUser> => {
-      try {
-        const response = await axios.get<ApiCurrentUser>("/api/currentUser");
-        const rolesList: string[] =
-          response.data.roles?.map((r: Role) => r.authority) ?? [];
-        return { loggedIn: true, root: { ...response.data, rolesList } };
-      } catch (e: unknown) {
+      try {} catch (e: unknown) {
         const err = e as { status?: number };
         if (err.status === 403) {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected { loggedIn: false, root: null } to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] LogicalOperator
src/main/utils/currentUser.ts:47:11
       try {
         const response = await axios.get<ApiCurrentUser>("/api/currentUser");
         const rolesList: string[] =
-          response.data.roles?.map((r: Role) => r.authority) ?? [];
+          response.data.roles?.map((r: Role) => r.authority) && [];
         return { loggedIn: true, root: { ...response.data, rolesList } };
       } catch (e: unknown) {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected { loggedIn: true, root: { …(3) } } to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ArrowFunction
src/main/utils/currentUser.ts:47:36
       try {
         const response = await axios.get<ApiCurrentUser>("/api/currentUser");
         const rolesList: string[] =
-          response.data.roles?.map((r: Role) => r.authority) ?? [];
+          response.data.roles?.map(() => undefined) ?? [];
         return { loggedIn: true, root: { ...response.data, rolesList } };
       } catch (e: unknown) {
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected { loggedIn: true, root: { …(3) } } to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/main/utils/currentUser.ts:48:28
         const response = await axios.get<ApiCurrentUser>("/api/currentUser");
         const rolesList: string[] =
           response.data.roles?.map((r: Role) => r.authority) ?? [];
-        return { loggedIn: true, root: { ...response.data, rolesList } };
+        return { loggedIn: false, root: { ...response.data, rolesList } };
       } catch (e: unknown) {
         const err = e as { status?: number };
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected { loggedIn: false, root: { …(3) } } to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/main/utils/currentUser.ts:48:40
         const response = await axios.get<ApiCurrentUser>("/api/currentUser");
         const rolesList: string[] =
           response.data.roles?.map((r: Role) => r.authority) ?? [];
-        return { loggedIn: true, root: { ...response.data, rolesList } };
+        return { loggedIn: true, root: {} };
       } catch (e: unknown) {
         const err = e as { status?: number };
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns user data from API
statusReason: expected { loggedIn: true, root: {} } to deeply equal { loggedIn: true, root: { …(3) } }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/currentUser.ts:49:28
         const rolesList: string[] =
           response.data.roles?.map((r: Role) => r.authority) ?? [];
         return { loggedIn: true, root: { ...response.data, rolesList } };
-      } catch (e: unknown) {
-        const err = e as { status?: number };
-        if (err.status === 403) {
-          return { loggedIn: false, root: {} };
-        }
-        throw e;
-      }
+      } catch (e: unknown) {}
     },
     initialData: { loggedIn: false, root: null },
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns { loggedIn: false, root: {} } for 403
statusReason: expected { loggedIn: false, root: null } to deeply equal { loggedIn: false, root: {} }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] EqualityOperator
src/main/utils/currentUser.ts:51:13
         return { loggedIn: true, root: { ...response.data, rolesList } };
       } catch (e: unknown) {
         const err = e as { status?: number };
-        if (err.status === 403) {
+        if (err.status !== 403) {
           return { loggedIn: false, root: {} };
         }
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns { loggedIn: false, root: {} } for 403
statusReason: expected { loggedIn: false, root: null } to deeply equal { loggedIn: false, root: {} }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/currentUser.ts:51:33
         return { loggedIn: true, root: { ...response.data, rolesList } };
       } catch (e: unknown) {
         const err = e as { status?: number };
-        if (err.status === 403) {
-          return { loggedIn: false, root: {} };
-        }
+        if (err.status === 403) {}
         throw e;
       }
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns { loggedIn: false, root: {} } for 403
statusReason: expected { loggedIn: false, root: null } to deeply equal { loggedIn: false, root: {} }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/main/utils/currentUser.ts:52:30
       } catch (e: unknown) {
         const err = e as { status?: number };
         if (err.status === 403) {
-          return { loggedIn: false, root: {} };
+          return { loggedIn: true, root: {} };
         }
         throw e;
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns { loggedIn: false, root: {} } for 403
statusReason: expected { loggedIn: true, root: {} } to deeply equal { loggedIn: false, root: {} }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/main/utils/currentUser.ts:52:18
       } catch (e: unknown) {
         const err = e as { status?: number };
         if (err.status === 403) {
-          return { loggedIn: false, root: {} };
+          return {};
         }
         throw e;
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns { loggedIn: false, root: {} } for 403
statusReason: expected {} to deeply equal { loggedIn: false, root: {} }

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/main/utils/currentUser.ts:57:30
         throw e;
       }
     },
-    initialData: { loggedIn: false, root: null },
+    initialData: { loggedIn: true, root: null },
   });
   return queryResults.data;
killedBy: utils/currentUser tests useCurrentUser tests useCurrentUser returns initialData when request is pending
statusReason: expected { loggedIn: true, root: null } to deeply equal { loggedIn: false, root: null }

[Killed] BlockStatement
src/main/utils/currentUser.ts:62:29
   return queryResults.data;
 }
 
-export function useLogout() {
-  const queryClient = useQueryClient();
-  const navigate = useNavigate();
-  return useMutation({
-    mutationFn: async () => {
-      await axios.post("/logout");
-      await queryClient.resetQueries({ queryKey: ["current user"] });
-      navigate("/");
-    },
-  });
-}
+export function useLogout() {}
 
 export function hasRole(
killedBy: utils/currentUser tests useLogout tests useLogout calls /logout, resets queries, and navigates to /
statusReason: Cannot read properties of undefined (reading 'mutate')

[Killed] ObjectLiteral
src/main/utils/currentUser.ts:65:22
 export function useLogout() {
   const queryClient = useQueryClient();
   const navigate = useNavigate();
-  return useMutation({
-    mutationFn: async () => {
-      await axios.post("/logout");
-      await queryClient.resetQueries({ queryKey: ["current user"] });
-      navigate("/");
-    },
-  });
+  return useMutation({});
 }
 
killedBy: utils/currentUser tests useLogout tests useLogout calls /logout, resets queries, and navigates to /
statusReason: expected "vi.fn()" to be called with arguments: [ '/' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/utils/currentUser.ts:66:29
   const queryClient = useQueryClient();
   const navigate = useNavigate();
   return useMutation({
-    mutationFn: async () => {
-      await axios.post("/logout");
-      await queryClient.resetQueries({ queryKey: ["current user"] });
-      navigate("/");
-    },
+    mutationFn: async () => {},
   });
 }
killedBy: utils/currentUser tests useLogout tests useLogout calls /logout, resets queries, and navigates to /
statusReason: expected "vi.fn()" to be called with arguments: [ '/' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/utils/currentUser.ts:77:12
 export function hasRole(
   currentUser: CurrentUser | null | undefined,
   role: string,
-): boolean {
-  if (!currentUser?.loggedIn) return false;
-  // Optional chaining is defensive: untyped JS callers may pass loggedIn: true
-  // with a missing or empty root.
-  return currentUser.root?.rolesList?.includes(role) ?? false;
-}
+): boolean {}
 
killedBy: utils/currentUser tests hasRole tests hasRole returns correct values for properly-defined currentUser
statusReason: expected undefined to be truthy

[Killed] ConditionalExpression
src/main/utils/currentUser.ts:78:7
   currentUser: CurrentUser | null | undefined,
   role: string,
 ): boolean {
-  if (!currentUser?.loggedIn) return false;
+  if (true) return false;
   // Optional chaining is defensive: untyped JS callers may pass loggedIn: true
   // with a missing or empty root.
killedBy: utils/currentUser tests hasRole tests hasRole returns correct values for properly-defined currentUser
statusReason: expected false to be truthy

[Killed] ConditionalExpression
src/main/utils/currentUser.ts:78:7
   currentUser: CurrentUser | null | undefined,
   role: string,
 ): boolean {
-  if (!currentUser?.loggedIn) return false;
+  if (false) return false;
   // Optional chaining is defensive: untyped JS callers may pass loggedIn: true
   // with a missing or empty root.
killedBy: utils/currentUser tests hasRole tests hasRole returns false for null/undefined/empty currentUser
statusReason: Cannot read properties of null (reading 'root')

[Killed] LogicalOperator
src/main/utils/currentUser.ts:81:10
   if (!currentUser?.loggedIn) return false;
   // Optional chaining is defensive: untyped JS callers may pass loggedIn: true
   // with a missing or empty root.
-  return currentUser.root?.rolesList?.includes(role) ?? false;
+  return currentUser.root?.rolesList?.includes(role) && false;
 }
 
killedBy: AppNavbar tests renders Admin menu for admins
statusReason: Unable to find an element with the text: Admin. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"

[Killed] BooleanLiteral
src/main/utils/currentUser.ts:81:57
   if (!currentUser?.loggedIn) return false;
   // Optional chaining is defensive: untyped JS callers may pass loggedIn: true
   // with a missing or empty root.
-  return currentUser.root?.rolesList?.includes(role) ?? false;
+  return currentUser.root?.rolesList?.includes(role) ?? true;
 }
 
killedBy: utils/currentUser tests hasRole tests hasRole returns false for null/undefined/empty currentUser
statusReason: expected true to be falsy
