[Killed] BlockStatement
src/main/utils/truncate.js:8:43
  * @returns {string} - the original text if it fits within maxLength, otherwise the first
  *   maxLength characters followed by "..."
  */
-export function truncate(text, maxLength) {
-  if (text === null || text === undefined) {
-    return "";
-  }
-  if (text.length <= maxLength) {
-    return text;
-  }
-  return text.slice(0, maxLength) + "...";
-}
+export function truncate(text, maxLength) {}
 
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  jones201...
Received:


Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/utils/truncate.js:9:7
  *   maxLength characters followed by "..."
  */
 export function truncate(text, maxLength) {
-  if (text === null || text === undefined) {
+  if (true) {
     return "";
   }
killedBy: BibTexEntryShowPage tests renders fetched references and citations in read-only tables
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  jones201...
Received:


Ignored nodes: comments, script, style

[Killed] ConditionalExpression
src/main/utils/truncate.js:9:7
  *   maxLength characters followed by "..."
  */
 export function truncate(text, maxLength) {
-  if (text === null || text === undefined) {
+  if (false) {
     return "";
   }
killedBy: truncate tests returns an empty string for null
statusReason: Cannot read properties of null (reading 'length')

[Killed] StringLiteral
src/main/utils/truncate.js:10:12
  */
 export function truncate(text, maxLength) {
   if (text === null || text === undefined) {
-    return "";
+    return "Stryker was here!";
   }
   if (text.length <= maxLength) {
killedBy: truncate tests returns an empty string for null
statusReason: expected 'Stryker was here!' to be '' // Object.is equality

[Killed] EqualityOperator
src/main/utils/truncate.js:12:7
   if (text === null || text === undefined) {
     return "";
   }
-  if (text.length <= maxLength) {
+  if (text.length > maxLength) {
     return text;
   }
killedBy: truncate tests returns the original text unchanged when it fits within maxLength
statusReason: expected 'hello...' to be 'hello' // Object.is equality

[Killed] ConditionalExpression
src/main/utils/truncate.js:12:7
   if (text === null || text === undefined) {
     return "";
   }
-  if (text.length <= maxLength) {
+  if (true) {
     return text;
   }
killedBy: truncate tests shortens text longer than maxLength and appends ...
statusReason: expected 'hello world' to be 'hello...' // Object.is equality

[Killed] MethodExpression
src/main/utils/truncate.js:15:10
   if (text.length <= maxLength) {
     return text;
   }
-  return text.slice(0, maxLength) + "...";
+  return text + "...";
 }
 
killedBy: truncate tests shortens text longer than maxLength and appends ...
statusReason: expected 'hello world...' to be 'hello...' // Object.is equality
