[Killed] BooleanLiteral
src/main/utils/useBackend.ts:38:20
   queryKey: unknown[],
   axiosParameters: AxiosRequestConfig,
   initialData: T,
-  suppressToasts = false,
+  suppressToasts = true,
   options: Partial<UseQueryOptions<T>> = {},
 ) {
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
src/main/utils/useBackend.ts:40:3
   initialData: T,
   suppressToasts = false,
   options: Partial<UseQueryOptions<T>> = {},
-) {
-  return useQuery<T>({
-    queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
-          toast(errorMessage);
-        }
-        console.error(errorMessage, e);
-        throw e;
-      }
-    },
-    initialData: initialData,
-    ...options,
-  });
-}
+) {}
 
 const wrappedParams = async <TData>(params: AxiosRequestConfig) => {
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: Cannot read properties of undefined (reading 'isError')

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ObjectLiteral
src/main/utils/useBackend.ts:41:22
   suppressToasts = false,
   options: Partial<UseQueryOptions<T>> = {},
 ) {
-  return useQuery<T>({
-    queryKey: queryKey,
-    queryFn: async () => {
-      try {
-        const response = await axios(axiosParameters);
-        return response.data;
-      } catch (e) {
-        const errorMessage = `Error communicating with backend via ${axiosParameters.method} on ${axiosParameters.url}`;
-        if (!suppressToasts) {
-          toast(errorMessage);
-        }
-        console.error(errorMessage, e);
-        throw e;
-      }
-    },
-    initialData: initialData,
-    ...options,
-  });
+  return useQuery<T>({});
 }
 
killedBy: utils/useBackend tests utils/useBackend useBackend tests useBackend handles 404 error correctly
statusReason: expected undefined to deeply equal [ 'initialData' ]

[Killed] BlockStatement
src/main/utils/useBackend.ts:61:68
   });
 }
 
-const wrappedParams = async <TData>(params: AxiosRequestConfig) => {
-  // Directly returning the promise allows useMutation to handle rejections.
-  const response = await axios(params);
-  return response.data as TData;
-};
+const wrappedParams = async <TData>(params: AxiosRequestConfig) => {};
 
 export function useBackendMutation<TInput, TData = unknown>(
killedBy: RoleEmailTable Check defaults for api endpoints
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
src/main/utils/useBackend.ts:71:3
   objectToAxiosParams: (object: TInput) => AxiosRequestConfig,
   useMutationParams: Partial<UseMutationOptions<TData, unknown, TInput>>,
   queryKey: string[] | null = null,
-) {
-  const queryClient = useQueryClient();
-
-  return useMutation({
-    mutationFn: (object: TInput) =>
-      wrappedParams<TData>(objectToAxiosParams(object)),
-    onError: (data) => {
-      toast(`${data}`);
-    },
-    // Stryker disable all: Not sure how to set up the complex behavior needed to test this
-    onSettled: () => {
-      if (queryKey !== null) {
-        // Handle array of query keys for cache invalidation
-        if (Array.isArray(queryKey)) {
-          queryKey.forEach((key) => {
-            queryClient.invalidateQueries({ queryKey: [key] });
-          });
-        }
-      }
-    },
-    // Stryker restore all
-    retry: false,
-    ...useMutationParams,
-  });
-}
+) {}
 
killedBy: RoleEmailTable Check defaults for api endpoints
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ArrowFunction
src/main/utils/useBackend.ts:75:17
   const queryClient = useQueryClient();
 
   return useMutation({
-    mutationFn: (object: TInput) =>
-      wrappedParams<TData>(objectToAxiosParams(object)),
+    mutationFn: () => undefined,
     onError: (data) => {
       toast(`${data}`);
killedBy: RoleEmailTable Check defaults for api endpoints
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
src/main/utils/useBackend.ts:77:24
   return useMutation({
     mutationFn: (object: TInput) =>
       wrappedParams<TData>(objectToAxiosParams(object)),
-    onError: (data) => {
-      toast(`${data}`);
-    },
+    onError: (data) => {},
     // Stryker disable all: Not sure how to set up the complex behavior needed to test this
     onSettled: () => {
killedBy: utils/useBackend tests utils/useBackend useBackendMutation tests useBackendMutation handles error correctly
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
