[Killed] ArrayDeclaration
main/components/Tags/TagSelector.jsx:25:18
 
 export default function TagSelector({
   allTags = [],
-  assignedTags = [],
+  assignedTags = ["Stryker was here"],
   onAddTag = () => {},
   onRemoveTag = () => {},
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-no-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] MethodExpression
main/components/Tags/TagSelector.jsx:33:25
   testId = "TagSelector",
 }) {
   const assignedIds = new Set(assignedTags.map((tag) => tag.id));
-  const availableTags = allTags.filter((tag) => !assignedIds.has(tag.id));
+  const availableTags = allTags;
 
   const withExplanationTooltip = (tag, tooltipId, children) => (
killedBy: TagSelector tests dropdown lists only unassigned tags, with pill and explanation
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="dropdown-item"
  data-rr-ui-dropdown-item=""
  data-testid="TagSelector-available-tag-1"
  type="button"
>

[Killed] EqualityOperator
main/components/Tags/TagSelector.jsx:51:10
         className="d-flex flex-wrap align-items-center gap-2"
         data-testid={`${testId}-assigned-tags`}
       >
-        {assignedTags.length === 0 && (
+        {assignedTags.length !== 0 && (
           <span data-testid={`${testId}-no-tags`} className="text-muted">
             No tags assigned
killedBy: TagSelector tests renders without crashing with no props
statusReason: Unable to find an element by: [data-testid="TagSelector-no-tags"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:59:13
         {assignedTags.map((tag) =>
           withExplanationTooltip(
             tag,
-            `${testId}-assigned-tag-${tag.id}-tooltip`,
+            ``,
             <span
               className="d-inline-flex align-items-center"
killedBy: TagSelector tests shows explanation tooltip when hovering over an assigned tag
statusReason: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has type:  Null
Received has value: null

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:66:25
             >
               <TagPill
                 tag={tag}
-                testId={`${testId}-assigned-tag-${tag.id}-badge`}
+                testId={``}
               />
               {canEdit && (
killedBy: TagSelector tests renders assigned tags as colored pill badges with contrast text
statusReason: Unable to find an element by: [data-testid="TagSelector-assigned-tag-1-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >

[Killed] StringLiteral
main/components/Tags/TagSelector.jsx:114:31
                   >
                     <TagPill
                       tag={tag}
-                      testId={`${testId}-available-tag-${tag.id}-badge`}
+                      testId={``}
                     />
                     <span className="ms-2 small text-muted">
killedBy: TagSelector tests dropdown lists only unassigned tags, with pill and explanation
statusReason: Unable to find an element by: [data-testid="TagSelector-available-tag-2-badge"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="TagSelector"
    >
